[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:09.683213+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T18:00:32+00:00",
        "description": "Humans tend to rely on white swans—the known knowns—and fear the red swans—the known unknowns. But the path forward is often shaped by black swans—the unknown unknowns. To see beyond the red swans, we need language to name the phenomenon and curiosity to uncover the black swans. \n\nMel Thacker, MD, DipABLM is a double board certified otolaryngologist (ear, nose and throat surgeon) and lifestyle medicine specialist, a surgeon coach, and podcaster. She resides in Massachusetts with her husband, their 2 children, and a feisty bunny named Daisy. When she is not doctoring or coaching, she can be found running marathons (she’s completed 20!). \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383769,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IM0e621hDL4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IM0e621hDL4/hqdefault.jpg",
        "title": "Can we end fear-driven healthcare? | Mel Thacker | TEDxManitouSprings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:10.007749+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:18:26+00:00",
        "description": "Professor Sue Black uses her own life story to discuss the remarkable potential for technology to improve lives dramatically for otherwise dispossessed communities and why this is better for the tech industry and the wider world.  Sue Black is a Professor of Computer Science at Durham University, recognised by Forbes Magazine as a World Top 50 Woman in Tech & has received an OBE for her services to technology.\n\nHowever, Sue's journey to professional success was an unconventional one as she left school at 16 and was a single mum of 3 children by age 25. Fortunately for Sue she had an unusual ability in technology and this served as an extraordinary socioeconomic elevator for her career and life prospects.\n\nSue has since devoted much of her energies to helping bring the many opportunities enabled by technology to women around the UK and the wider world through initiatves such BCSWomen, #techmums and most recently the award-winning TechUP programme. This talk was given at a TEDx event us",
        "id": 4383770,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xJ4Y0J4O3lQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xJ4Y0J4O3lQ/hqdefault.jpg",
        "title": "Should Tech Bros Be Working with Tech Mums? | Prof Sue Black | TEDxDurham",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:10.398855+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:18:12+00:00",
        "description": "Prof Carlos Frenk presents in his home city to discuss one of the biggest potential changes in our basic understanding of how the Universe works. \n\nIt involves 5000 robots in the Arizona desert and how the data they are collecting from the edges of the known Universe could upend long accepted theories on the birth of the Universe. Prof Carlos Frenk has been a Durham University physics superstar for decades now. He is one of the world’s leading cosmologists and a pioneer of the “cold dark matter” model, which transformed our understanding of how galaxies and the universe formed. A Professor of Cosmology and founding Director of the Institute for Computational Cosmology, his simulations of the universe have helped reveal the invisible structure of the cosmos. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383771,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yFfgV_7EKfE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yFfgV_7EKfE/hqdefault.jpg",
        "title": "How the universe began—and how it is likely to end | Prof Carlos Frenk | TEDxDurham",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:10.686703+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:17:44+00:00",
        "description": "Imagine an ocean without sharks and rays: murky waters, sick fish, dying coral reefs, and stripped seagrass meadows. This is not science fiction — it’s a looming reality. One-third of all shark and ray species are threatened with extinction, and their loss could have catastrophic consequences for marine ecosystems, ocean health, and human survival.\n\nIn this compelling TEDx talk, Louisa Graf, a graduate researcher at Deakin University in Melbourne, Australia, explains why these often misunderstood creatures are critical for keeping oceans alive. From apex predators to overlooked mesopredators like fiddler rays, Louisa shares her research tracking these species and reveals how their disappearance could unravel the marine food web, affecting fisheries, recreation, and the balance of ocean life.\nIf you care about marine conservation, biodiversity, and a healthy planet, this talk is essential viewing. \n\nWatch now to understand why protecting sharks and rays isn’t just about saving wildlife",
        "id": 4383772,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VcehrgZtGSY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VcehrgZtGSY/hqdefault.jpg",
        "title": "Why sharks and rays keep our oceans alive | Louisa Graf | TEDxDeakin Uni Melbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:10.945690+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:16:47+00:00",
        "description": "In an age shaped by artificial intelligence, what makes human creativity unique? In this talk, Emil explores how we can navigate uncertainty, embrace curiosity and find meaning in the relationship between humans and machines. Drawing on the principles of the Creative Odyssey, Emil invites us to see creativity as a form of resilience, courage, and a way of being in the world. Emil Drud is an interdisciplinary creative, designer, and entrepreneur exploring the intersections of art, technology, and business. With the sensitivity of an artist, the curiosity of a philosopher, and the mindset of a maker, his work spans audio engineering, music production, writing, agile methodologies, and workshop facilitation—connecting ideas across disciplines and bringing them to life with clarity and impact.\nA lifelong learner, Emil thrives in complexity.  Currently studying Business Creation, Innovation, and Leadership at Bremerhaven University of Applied Sciences, he explores how creativity thrives in",
        "id": 4383773,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=X9p2BxSMfBc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/X9p2BxSMfBc/hqdefault.jpg",
        "title": "Navigating Human Creativity in the Age of AI | Emil Drud | TEDxHochschuleBremerhaven",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:11.188379+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:14:47+00:00",
        "description": "Did you know you could snorkel in Tennessee? Luke tell us not only is that possible but it's also incredible and very rare. He helps us discover just a few of the amazing fish swimming in East Tennessee's rivers and creeks, and that they are much, much more than meets the eye. Luke Padgett is a Chattanooga native and National Geographic storyteller whose work bridges art and science across the globe. From the Arctic to island jungles, he’s chased fossils, crafted films, and now leads Fish Camp, an emerging hub for underwater exploration in the Southeast. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383774,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7tX5Wc9ti_M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7tX5Wc9ti_M/hqdefault.jpg",
        "title": "Undiscovered: Finding Wonder in Our Fresh Waters | Luke Padgett | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:11.396734+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:12:28+00:00",
        "description": "Michael argues that we are the seeds - we are the vessels for the creative life force all around us that is desperately seeking to take root, and that it's imperative that our planting comes as a response to our community. Michael Johnson is a co-founder of Rock Rising and serves as RR’s Creative Director. He graduated from Marymount Manhattan College with a BFA in Acting in 2016. Michael is an actor and musician. Most recently Michael has developed and co-written \"Everyday Charlie\" - a musical about fifth graders. He also starred in Scott Arick’s short film “Don’t Call It Magic” in 2020. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383775,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jFs5cnhRUwg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jFs5cnhRUwg/hqdefault.jpg",
        "title": "Roots: The Art of Becoming | Michael Johnson | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:11.640714+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:11:44+00:00",
        "description": "There is a common misconception that we need to add nutrients to the soil for plants to grow, but that’s not true. The very nature of soil is that it is full of mineral particles. The problem is these nutrients are not necessarily plant available. Krisi Olivero is a co owner of Hixson based Alter Eco Farms, a microorganism-focused soil lab and small scale compost facility. She works with home gardeners, landscapers, permaculture designers and small farms to regenerate soils in the southeast through the restoration of native soil microorganisms. Trained by Dr. Elaine Ingham's Soil Food Web School, Krisi lives to regenerate soil and loves helping people grow. You can learn more about the work she does (and check out cool microorganism pictures) at www.alterecofarms.com. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383776,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HsUqaq6K5Eg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HsUqaq6K5Eg/hqdefault.jpg",
        "title": "The Nightmare Below Your Feet | Krisi Olivero | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:11.834445+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:10:50+00:00",
        "description": "The climate crisis can feel overwhelming, with stories of droughts, floods, fires, and an uncertain future. But what if the end isn’t inevitable? What if hope, courage, and action could rewrite the story?\n\nIn this inspiring TEDx talk, Dr Anika Molesworth, an alum of Deakin University in Melbourne, Australia, shares her journey as a farmer and environmental scientist living on the frontlines of climate change. \nFrom dust storms and failing crops to moments of renewal and resilience, Dr Molesworth demonstrates why active hope — the kind with calloused hands and dusty boots — is essential for creating a sustainable future. She also explains why despair is the enemy of progress and how practical action can make a difference.\n\nThe climate crisis isn’t just about farms — it affects the food we eat, the air we breathe, and the world we leave for future generations. Watch now to learn how hope, courage, and sustainable practices can help address climate change and create a future worth fighti",
        "id": 4383777,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XZQMVYSD9EM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XZQMVYSD9EM/hqdefault.jpg",
        "title": "Hope in the climate crisis  | Anika Molesworth | TEDxDeakin Uni Melbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:12.015564+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:10:38+00:00",
        "description": "On 21 November 2016, one of the deadliest asthma events in history occurred in Melbourne, Australia. A sudden storm turned a warm summer evening into a medical emergency, with 11 people losing their lives and thousands of others left struggling to breathe — many of whom had never had asthma before.\n\nIn this educational TEDx talk, Dr Kira Hughes, an alum of Deakin University in Melbourne, Australia, explains the science behind thunderstorm asthma — a rare but deadly phenomenon that occurs when storms, pollen, and vulnerable populations collide. \n\nDrawing on years of research, and her own personal journey with asthma, Dr Hughes reveals why Australia — and Melbourne, in particular — is the global hotspot for these events, and why climate change is making them more frequent and severe and reveals the surprising link between hay fever and thunderstorm asthma risk\n\nThis talk is not just about science — it’s about survival. If you have asthma, hay fever, or live in Australia, this is essenti",
        "id": 4383778,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZD9tYfZa8TU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZD9tYfZa8TU/hqdefault.jpg",
        "title": "Thunderstorm Asthma: it’s a thing  | Kira Hughes | TEDxDeakin Uni Melbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:12.238859+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:10:19+00:00",
        "description": "Is the war on drugs really keeping communities safe — or causing even greater harm? In this eye-opening TEDx talk, Professor Kate Seear from Deakin University in Melbourne, Australia, exposes why global drug prohibition has failed and how its consequences reach far beyond crime, addiction, and public health.\n\nDrawing on 15 years of research as a lawyer, sociologist, and drug policy expert, Professor Seear reveals a surprising symbol of this failure: the savannah tree frog, whose survival is threatened by the environmental fallout of drug eradication efforts. She explains how punitive drug policies fuel mass incarceration, unsafe drug use, and overdoses, while also damaging ecosystems through practices like aerial forest spraying in Colombia.\n\nThis talk reframes drug policy as both a human rights issue and an environmental issue — showing why moving toward harm reduction and regulated drug markets is essential for people and the planet.\nProfessor Seear challenges us to think differentl",
        "id": 4383779,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QlBHB-Hx9HM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QlBHB-Hx9HM/hqdefault.jpg",
        "title": "The War on Drugs: a global failure  | Kate Seear | TEDxDeakin Uni Melbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:12.451433+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:09:51+00:00",
        "description": "Ever sat at a red light at 2 am on an empty street and wondered: What am I waiting for? Our cities were built like machines — rigid, inefficient, and disconnected. They consume 80% of the world’s resources and produce 70% of emissions. But what if cities could behave more like living systems, adaptive and interconnected like organisms?\n\nIn this visionary TEDx talk, Professor Tuba Kocaturk from Deakin University in Melbourne, Australia, explores how nature-inspired urban design and circular city principles can transform our cities into thriving, sustainable hubs. From sharing solar energy in one city to turning coffee waste into mushrooms in Paris, Professor Kocaturk demonstrates how urban environments can become circular, adaptive, and alive — turning waste into resources and energy flows into life-giving networks.\n\nThis talk shows why urban sustainability, adaptive city planning, and circular design are essential for the future of our communities. Watch now to discover how cities can",
        "id": 4383780,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6k72tcf6fXk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6k72tcf6fXk/hqdefault.jpg",
        "title": "The city is alive: designing cities like living systems  | Tuba Kocaturk | TEDxDeakin Uni Melbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:12.687163+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:08:57+00:00",
        "description": "The climate crisis doesn’t affect everyone equally. In this TEDx talk, Alessia Boni examines how climate impacts intersect with gender, privilege, and inequality. While most global data still treats gender as binary, it’s essential to recognize that non-binary and gender-diverse people face climate risks that remain largely undocumented. Within these limits, the talk highlights how women and girls are disproportionately affected — from rising poverty and displacement to increased exposure to gender-based violence — and why inclusive, gender-responsive climate action is crucial for a more just, resilient future. Alessia, laureata in Relazioni Internazionali e Studi Europei, lavora al Consolato Generale Britannico in Italia. Ha partecipato a forum ONU su diritti umani e parità di genere, con esperienza nella cooperazione internazionale e nella tutela delle donne in comunità vulnerabili. Volontaria della Croce Rossa, è appassionata di diritto umanitario e scrive articoli su geopolitica, ",
        "id": 4383781,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z1UQP3hkmqo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z1UQP3hkmqo/hqdefault.jpg",
        "title": "Climate change is not gender neutral | Alessia Boni | TEDxModena Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:12.848895+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:08:39+00:00",
        "description": "Il cervello di un ingegnere ragiona in modo logico e sequenziale, concentrandosi sulla risoluzione pratica di problemi attraverso la comprensione del funzionamento delle cose. Questo è un dato di fatto ma non è tutta la verità. Il cervello di un ingegnere si tende a credere \"pensi in bianco e nero\", ma in realtà lavora su mappe colorate ed estremamente creative.\nIl telaio delle vetture sportive rappresenta uno scheletro protettivo per gli occupanti della vettura, e grazie a modelli virtuali del veicolo e ad algoritmi matematici dedicati, le soluzioni virtuali ottenute e ben interpretate danno vita a componenti meccanici reali e innovativi per materiali e geometrie. \nIl processo di progettazione risulta vincente sfruttando questo principio fondamentale: se qualcosa non è l'ottimo, può sempre essere migliorato a partire dai fondamenti visti come opportunità creativa. Il cervello di un ingegnere, sebbene ragioni in modo logico e sequenziale, è in realtà estremamente creativo. Sara Mantov",
        "id": 4383783,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=l9Ci-sK3oyQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/l9Ci-sK3oyQ/hqdefault.jpg",
        "title": "Danzare con il grigio: come i fondamenti liberano la creatività | Sara Mantovani | TEDxModena Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:04:13.155558+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:08:20+00:00",
        "description": "The link between space exploration and its value to individuals and society feels increasingly tenuous for some. This might be due to various reasons, such as socioeconomic concerns, complacency in our ability to explore space, or a perceived lack of effort to push our boundaries. As humanity innovates to delve deeper into the mysteries of the Universe and prepares to work and eventually live beyond Earth's immediate vicinity, this talk examines the return on investment and the tangible benefits of our endeavors, especially as the costs of exploration grow beyond that of a simple \"collective cup\" of coffee. For over 20 years, Dr. Jessica Gaskin has been exploring the cosmos as a NASA astrophysicist. She doesn't just study the Universe; she invents the tools to see it in brand new ways, creating groundbreaking technologies to view everything from the most powerful and violent events in space to imaging the surfaces of planets. She has led projects, like flying a powerful X-ray telescop",
        "id": 4383784,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iILKPR12X8I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iILKPR12X8I/hqdefault.jpg",
        "title": "Treating the Universe to a Cup of Coffee, or Two | Jessica Gaskin | TEDxModena Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:31.801201+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:48:32+00:00",
        "description": "What do penicillin, Post-it notes, and world-changing social movements have in common?Serendipity. This talk dives into the surprising power of meaningful discoveries made by accident and asks how we can design our lives, learning spaces, and communities to invite more of these moments. Discover how serendipity can become a driver of social innovation and a pathway toward a regenerative future. Stephanie Birkner (Prof. Dr. ) believes in the magic that happens when people dare to grow together beyond themselves. As Professor of entrepreneurship Education at Bremerhaven University of Applied Sciences and Associate Researcher at ZUKUNFT.unternehmen gGmbH – an affiliated institute of the Carl von Ossietzky University of Oldenburg – she combines cutting-edge research with innovation methods and entrepreneurship facilitation tools. Passionate about creating learning spaces where curiosity turns into courage and ideas into impact, she loves to empower people to unfold their unique potential ",
        "id": 4383239,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gMPJfCcCv8c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gMPJfCcCv8c/hqdefault.jpg",
        "title": "How serendipity leads to new ideas | Stephanie Birkner | TEDxHochschuleBremerhaven",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:32.113889+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:46:40+00:00",
        "description": "Aging confronts us with our own mortality, but it also invites us to remember, release, and reimagine our lives. Tei Street shares how embracing aging can sharpen our purpose, deepen our love, and redefine our legacy. Tei Street is an accomplished executive with a proven track record of driving strategic growth and operational excellence across diverse industries. With over 20 years of leadership experience, Tei has consistently delivered results by fostering collaborative environments and implementing innovative solutions. \n\nTei’s expertise extends to board governance, where she has served on multiple boards, providing strategic guidance and oversight. She is adept at navigating complex challenges, building strong relationships, and driving consensus among stakeholders.\n\nKnown for her passion for the development of young people, Tei excels at identifying opportunities, developing actionable plans, and executing initiatives that deliver tangible outcomes. She is a results-oriented lea",
        "id": 4383240,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0bsjAQtWe2k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0bsjAQtWe2k/hqdefault.jpg",
        "title": "The unexpected gifts of aging | Amazing Tei Street | TEDxKingLincolnBronzevillle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:32.342986+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:46:15+00:00",
        "description": "Drawing from her lived experience, Stephanie Finoti shares how one moment of access, mentorship, and belief can change the trajectory of a young person’s life. This talk shows how planting a single seed in youth can nurture confident, capable leaders for the future. Stephanie Finoti is a former Miss Ohio 2024 and a Biomedical Scientist committed to advancing equity in healthcare and education. As the founder of \"That STEM Girl initiative\", she empowers underrepresented youth to lead in medicine and STEM through mentorship, access, and advocacy. A first-generation Brazilian-American and former CREATES-HS scholar at The James Comprehensive Cancer Center, an initiative focused on creating opportunities for marginalized communities in Columbus, Stephanie’s journey has taken her from a redlined neighborhood into rooms with medical leaders shaping the future of healthcare. With years of clinical and research experience, she uses her voice to champion representation, dismantle systemic barri",
        "id": 4383241,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=x9-ND0ZKp0M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x9-ND0ZKp0M/hqdefault.jpg",
        "title": "Planting the Seed: Nurturing the Future | Stephanie Finoti | TEDxKingLincolnBronzevillle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:32.637010+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:45:58+00:00",
        "description": "When words lose meaning, harm grows louder. This fireside chat names hard truths and why they liberate us. We explore love, rage, grief, and accountability as tools for healing, resistance, and building new worlds through embodied liberation. Karen Hewitt, M.Ed. (They/She)\nCulture Bearer | Community Builder | Rest Advocate | Creative Visionary\n\nKaren Hewitt is a catalyst for connection, creativity, and transformation. As Founder of The Culture of You and Co-Founder & COO of The Ohio REST Collective, they specialize in Culture and Diversity Strategy, Leadership Development, and Community Building, centering Black and Queer wisdom while guiding organizations through meaningful change. Known for their sharp insight and warm, approachable style, Karen helps individuals and organizations navigate complex conversations with heart and strategy. She is a sought-after host, speaker, voice actor, and facilitator, celebrated for her healing-centered, trauma-informed approach that turns vision in",
        "id": 4383242,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DoGoX0Y5_cY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DoGoX0Y5_cY/hqdefault.jpg",
        "title": "Where Words, Love, and Liberation Meet | Karen Hewitt & Treva Lindsey | TEDxKingLincolnBronzevillle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:32.967471+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:44:48+00:00",
        "description": "We live in a world that tells us to juggle harder—at work, at home, and in life. Suzanne Knight, a transformation leader and mother of three, found herself racing down a snowy highway, late, overwhelmed, and on the edge of breaking.\n\nWhat changed everything wasn’t learning to do more, but learning to do differently. In this talk, Suzanne reveals how applying the principles of agility—the same tools she uses to drive billion-dollar corporate transformations—helped her move from burnout to balance.\n\nHer message challenges the myth of “doing it all” and offers a practical, hopeful roadmap for anyone struggling with overwhelm. True freedom, she shows, comes not from juggling every ball, but from focusing on what matters most. Suzanne Knight, MBA, MA is an award-winning expert on transformational change and the future of work. CEO and founder of mBolden human capital consulting firm, Suzanne works with organizations around the world helping them anticipate and adapt to change so they can t",
        "id": 4383243,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZUufstTuKAM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZUufstTuKAM/hqdefault.jpg",
        "title": "The myth of doing it all (and what to do instead) | Suzanne Knight | TEDxEtobicoke",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:33.302388+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:43:43+00:00",
        "description": "Dopo il terremoto del 26 dicembre 2018, Fleri — piccolo borgo alle pendici dell’Etna in provincia di Catania — ha dimostrato che la ricostruzione è efficace quando si sostiene subito il tessuto imprenditoriale e si lavora insieme come comunità per ripristinare le certezze. Un modello che parla a tutte le situazioni di fragilità. Lavora in un primario istituto di credito dove si occupa di supportare le piccole e medie imprese. Vive a Fleri, frazione di Zafferana Etnea e, dopo il sisma del 2018, ha seguito con interesse il percorso di ricostruzione. Con il gruppo RialziAmo Fleri promuove iniziative per rafforzare il senso di comunità e stimolare la partecipazione attiva, certi che il dialogo tra cittadini e istituzioni sia la chiave per la rinascita dei territori. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383244,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_rs6kj_UqG4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_rs6kj_UqG4/hqdefault.jpg",
        "title": "Sisma Etna: imprese e comunità per la rinascita | Alessandro Russo | TEDxCatania Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:33.598922+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:43:25+00:00",
        "description": "Join Astha Agarwal, founder of Astha’s Self-Defense Academy, as she shares her inspiring journey of empowering women through self-defense. In this talk, Astha highlights the importance of mental strength, awareness, and physical training. Discover how her holistic approach—combining storytelling, mixed martial arts, and high-intensity workouts—transforms not just bodies, but minds and spirits. Through powerful anecdotes and impactful lessons, this talk inspires every woman to stand tall and face the world with confidence. In the tapestry of modern India, woven with the threads of progress and empowerment, Mrs. Astha Mittal Agarwal stands out as a beacon of resilience, courage, and transformation. A woman of indomitable spirit, she is not just an individual; she is a superwoman, a warrior, and a true changemaker. Throughout her life, she has navigated challenges and overcome obstacles to dedicate herself to a cause of protecting, empowering, and training women against violence and crim",
        "id": 4383245,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iJGZxXnzJvY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iJGZxXnzJvY/hqdefault.jpg",
        "title": "Decoding Tomorrow: Empowerment Through Self-Defense | SVSU  | Astha Agarwal | TEDxSVSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:33.852554+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:43:01+00:00",
        "description": "We live between two powerful ideas.\nOne urges us to decode tomorrow—to plan, predict, and to stay in control.\nThe other whispers, Que Será Será—whatever will be, will be.\nIn between  balancing \"Decoding of Tomorrow and Que Será Será,” this TEDx talk by Ms. Kanupriya Mohan- the winner of Mrs India International Queen 2025 and the recipient of the prestigious Emily Dickinson Award for her book-'Nuances', shared her insights on the tension between effort and acceptance, ambition and peace—while uncovering how unseen fears, inner-child wounds, and the fear of visibility quietly shape our choices.\n\nThis isn’t about having all the answers.\nIt’s about consciously healing what holds us back, choosing to embrace visibility, and knowing when to plan, when to pause, and when to trust.\n\nBecause the future belongs not to control or surrender alone—\nbut to those brave enough to balance both. Ms Kanupriya Mohan has been crowned as the winner of Mrs India International Queen 2025, a  pageant that cel",
        "id": 4383246,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=d9jzzT9Yza0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/d9jzzT9Yza0/hqdefault.jpg",
        "title": "Decoding tomorrow- Que Será Será | SVSU  | Ms Kanupriya Mohan | TEDxSVSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:34.025832+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:42:33+00:00",
        "description": "Dr. Skoll's research examines the kinds of support rebel groups receive through the lens of branding. Dr. Amy Skoll is an Assistant Professor in the International Strategy and Security Program at the Cal Poly Maritime Academy. She brings deep expertise in international relations, security studies, and student development, shaped by over a decade of experience in higher education.\nAmy earned her Ph.D. in Political Science with an emphasis in International Relations from the University of California, Davis, where she also served as a Graduate Student Researcher and Teaching Assistant. She also holds an MBA from California Polytechnic State University, San Luis Obispo, and previously worked as a Career Consultant at San Jose State University and as Coordinator of Student Development at Cal Poly.\nHer scholarship and teaching are driven by a commitment to preparing future leaders for the complex security challenges of the 21st century. Her research explores topics including rebel group dyn",
        "id": 4383247,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IBf5caR6uJ0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IBf5caR6uJ0/hqdefault.jpg",
        "title": "How Rebel Group Branding Affects Intervention | Amy Skoll, Ph.D. | TEDxSF State",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:34.314714+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:41:38+00:00",
        "description": "He is the founding member of Einfochips and Hi-Rel Electronics and serves on the Board of Directors at the Indian Electronics and Semiconductor Association. With global experience in the USA, Europe, Japan, and Taiwan, he is deeply connected in the industry and government, fostering strategic Industry-Academia partnerships. Moreover, he is also the founder of Ncubesemicon Pvt Ltd, and advises numerous semiconductor organizations in India and the USA.  Mr. Sudhir Naik: is a seasoned professional and a pioneer in the technology sector. As one of the founder members of Einfochips and Hi-Rel Electronics, he brings over four decades of expertise in the Semiconductor and Electronics System Design (ESDM) industries, as well as in the manufacturing segment. \n\nHe serves on the Board of Directors at the Indian Electronics and Semiconductor Association (IESA) and leads chapters in Maharashtra, Gujarat, Rajasthan, and Madhya Pradesh. With extensive experience spanning the USA, Europe, Japan, and ",
        "id": 4383248,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=v5taHwULveI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v5taHwULveI/hqdefault.jpg",
        "title": "Innovating India | Sudhir Naik | TEDxAhmedabadIntlSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:34.673520+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:39:55+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker's personal views and understanding of sex differences in the brain and behavior which remains debated by experts working in this field. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nLeadership isn't just about power — it's about connection, empathy, and resilience. In this compelling talk, Dominika Staniewicz draws on neuroscience to show how the female brain is uniquely wired for leadership and decision-making. She challenges outdated stereotypes and invites us to redefine what great leadership really looks like. Dominika Staniewicz is a global expert in leadership neuroscience, executive coaching, and organizational performance. With clients across six continents and nearly 20 years of ex",
        "id": 4383249,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=evzlxgtjqzo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/evzlxgtjqzo/hqdefault.jpg",
        "title": "Why the Female Brain Is Built for Leadership | Dominika Staniewicz M.S. | TEDxOconomowoc",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:34.854996+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:37:06+00:00",
        "description": "In this captivating TEDx talk at Mayoor School Ajmer, Pandit Tribhuwan Maharaj beautifully redefined Kathak—not merely as a classical dance form, but as a powerful tradition of storytelling. Rooted in the ancient saying “Katha kahe so Kathak” (one who tells a story is a Kathak), his talk traced the journey of Kathak from oral narratives to rhythmic movement, expressions, and grace.\n\nPandit Tribhuwan Maharaj took the audience through the origin and historical evolution of Kathak, highlighting how stories were once told through movement. Introducing his lineage, he spoke about the Kalakbindan Lucknow Gharana, sharing its unique nuances, discipline, and aesthetic depth.\n\nWhat made the talk especially engaging was its interactive nature—from rhythmic counting exercises to demonstrating playful elements like Snakes and ladder, allowing students to experience Kathak not just as spectators but as participants. Through rhythm, footwork, and storytelling, the audience felt the living pulse of ",
        "id": 4383250,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=-FChLoBZ6Ms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-FChLoBZ6Ms/hqdefault.jpg",
        "title": "Katha kahe so Kathak | Pt. Tribhuwan Maharaj | TEDxMayoor School Ajmer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:35.006551+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:35:55+00:00",
        "description": "Step into the world of cinema with filmmaker Sohini Singh Bahadur, as she takes you on a journey from the movie theatres of her childhood to the director’s chair.\n\nSohini Singh began her filmmaking journey as a student at Whistling Woods International, where she directed her first short film, \"Amidst Dark\", during her college days. She later went on to work on her debut feature film, \"On the Blue Canvas,\" which has won multiple accolades at several film festivals. Currently, she is working as a faculty member at the prestigious Ramanaidu Film School.\n\nIn her TEDx talk, Sohini reflected on her personal life and childhood interests, evolving from a film enthusiast to a comic-book nerd and an obsessive gamer and how these art forms not only sparked her urge to create but also shaped her into a better filmmaker. As a filmmaker and lifelong student, she shared what it truly means to be a “jack of all trades” in cinema, and why observing, learning and experimenting lie at the heart of power",
        "id": 4383251,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bKEw8BGb7Ts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bKEw8BGb7Ts/hqdefault.jpg",
        "title": "A Filmmaker Raised by Art  | Sohini Singh | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:35.171582+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:35:21+00:00",
        "description": "Mr.Das talks about embracing failure as growth, journey of resilience, and universal divine intervention. Mr. Das is a youth activist, biotechnologist, and development professional with 8+ years of experience in civic engagement, sustainability, and leadership. He is the Founder & President of Youth Activism Nepal (YAN), a youth-led nonprofit working on environmental conservation, SDGs, and youth empowerment, with impactful initiatives such as Project Smile (oral hygiene awareness in rural Nepal), Project Swasti (Mithila cultural murals on women’s empowerment), and Project Repurpose (plastic waste management under Students For Liberty’s Green Liberty Initiative).\n\nRishav also serves as the Regional Coordinator for Leadership Development in South Asia at Students For Liberty, where he has mentored over 100 young leaders and organized flagship programs like The Liberty Retreat (TLR). His Objectivism journey since 2020 has included delivering lectures at the John Galt School and earning ",
        "id": 4383252,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=I6HgISAu0ow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/I6HgISAu0ow/hqdefault.jpg",
        "title": "A piece of Me | Rishav Das | TEDxDWIT College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:55:35.352041+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:34:25+00:00",
        "description": "Ms. Gauli speaks about Technology as a tool for equity, empowerment, and lasting impact. Ms.Gauli is a Software Engineer and the founder of Tech4AllNepal, an initiative focused on bridging the digital and educational divide in rural Nepal. \nA graduate in Computer Science from Deerwalk Institute of Technology, Isha’s work aims to make technology accessible to underserved communities. She and her team at Tech4AllNepal are developing Guru Aama, an AI-enabled projector for offline digital education in remote areas. She has additionally led multiple ICT education campaigns across Nepal. Her journey reflects a deep commitment to using technology as a tool for equity, empowerment, and lasting impact. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4383253,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bjHDZ_7chPU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bjHDZ_7chPU/hqdefault.jpg",
        "title": "Technology as a tool for equity, empowerment, and impact | Isha Sharma Gauli | TEDxDWIT College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:39.425400+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:40:55+00:00",
        "description": "Kiyan, a junior at ACS Amman, explores the “essence of a changing world” by analyzing how today's distractions often overwhelm us, pushing us to turn to AI. He reminds us that while technology can make life easier, it should only be used as a tool, and true innovation comes from taking the time to think deeply. Kiyan, a junior at ACS, explores the “essence of a changing world” by analyzing how today's distractions often overwhelm us, pushing us to turn to AI. He reminds us that while technology can make life easier, it should only be used as a tool, and true innovation comes from taking the time to think deeply. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4382588,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=oICB2rjvwpE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oICB2rjvwpE/hqdefault.jpg",
        "title": "Take The Stairs  | Kiyan Yaghnam | TEDxACS Amman Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:39.680353+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:40:41+00:00",
        "description": "Liyana Zahir is a junior at ACS Amman. Her topic for \"Revolution of Awareness” brings attention to brave Gen Z students who took over the streets with their student- led protests. These protests prove that age cannot be a deciding factor in creating an influence. A single voice can mobilize thousands. She participated in a peaceful protest with her friends in 2024 in Bangladesh. Now, she’s using her voice to show how Gen Z’s awareness and courage can spark real change across nations. Liyana Zahir, a junior at ACS, explores the power of youth activism in her talk “Revolution of Awareness.” She highlights the courage of Gen Z students who have taken to the streets, leading movements for change through student-driven protests. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4382589,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6FmiRB8DIdc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6FmiRB8DIdc/hqdefault.jpg",
        "title": "Revolution of Awareness | Liyana Zahir | TEDxACS Amman Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:39.993783+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:39:43+00:00",
        "description": "Burak Sina Akbudak, TEDx İzmir Fen Lisesi Youth sahnesinde yapay zekanın perde arkası hakkında konuşuyor. Boğaziçi Üniversitesi’nde Bilgisayar Mühendisliği lisans öğrencisidir. TÜBİTAK, EUCYS ve ISEF gibi prestijli yarışmalarda dereceler elde eden Akbudak, özellikle doğal dil işleme ve müzik bilgi erişimi alanlarında çalışmalar yürütmektedir. “Transformers ile Klasik Gitar Parçalarının Sentezlenmesi” projesi kapsamında klasik gitar müzik verisi üzerinde yeni bir tokenizasyon tekniği geliştirerek, müziğin üretilebilirliğini artıran yenilikçi yöntemler sunmuştur. Ayrıca Finite State Automata üzerine yaptığı araştırmalarla müzik üretiminde yeni temsil biçimleri keşfetmektedir.\nAkademik çalışmalarının yanı sıra çeşitli projeler yürütmektedir. Ray tracing, coğrafi veri analizi ve hızlı hareket eden nesneleri takip eden algoritmalar gibi farklı alanlarda geliştirdiği projeler geniş bir teknik yelpazede uzmanlaşmasını sağlamıştır. 2024 Regeneron ISEF’te dünya ikinciliği, TÜBİTAK 2204A Yazılı",
        "id": 4382590,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z7XxjboR7tY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z7XxjboR7tY/hqdefault.jpg",
        "title": "Kara Büyünün Ardında | Burak Sina Akbudak | TEDxIzmir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:40.280944+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:39:09+00:00",
        "description": "Prof. Dr. Hakan Ürey, mezun olduğu İzmir Fen Lisesinin TEDx sahnesinde teknoloji ve nöro mühendislik ufuklarından bahsediyor! Prof. Dr. Hakan Ürey,  lisans eğitimini Orta Doğu Teknik Üniversitesi’nde Elektrik Mühendisliği alanında tamamladı, yüksek lisans ve doktora derecelerini Georgia Institute of Technology’de Elektrik ve Bilgisayar Mühendisliği alanında aldı. Doktora sonrasında beş yıl ABD’de Microvision şirketinde çalıştı. 2001 yılından itibaren Koç Üniversitesi’nde öğretim üyesi olarak devam etmektedir.\nHakan Ürey, ekran ve görüntüleme sistemleri, sensörler ve mikroteknoloji alanlarında 50’den fazla patente sahiptir. Farklı konularda buluşları beş şirket tarafından lisanslanmış ve dört yeni şirket kurulumunda rol oynamıştır. Uluslararası dergi ve konferanslarda yaklaşık 200 makalesi yayınlanmış, uluslararası konferanslarda 30’den fazla davetli konuşma yapmış ve birçok ödüle layık görülmüştür. 2013 yılında ise gelecek nesil giyilebilir ve 3 Boyutlu ekran teknolojiler geliştirme ç",
        "id": 4382591,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AqZu06y0pM8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AqZu06y0pM8/hqdefault.jpg",
        "title": "Teknoloji ve Nöro Mühendislik Ufukları | Hakan Ürey | TEDxIzmir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:40.511027+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:38:51+00:00",
        "description": "İTÜ Teknopark'ın genel müdürlük görevini üstlenmiş ve İstanbul Teknik Üniversitesi İşletme Mühendisliği Fakültesinde çalışmalarını devam ettirmekte olan Prof. Dr. Deniz Tunçalp, teknoloji girişimciliğinin perde arkasından bahsediyor. Lisans ve yüksek lisans eğitimlerini Orta Doğu Teknik Üniversitesinde (ODTÜ) Endüstri Mühendisliği alanında tamamlamıştır. Ayrıca ODTÜ'de İletişim Teknolojileri, Bilgi Üniversitesinde Hukuk alanlarında yüksek lisans derecelerine sahiptir. Doktora eğitimini Sabancı Üniversitesi İşletme Bölümünde tamamlamıştır.\nBilgi ve iletişim teknolojileri alanında birçok firmada yönetici ve danışman olarak görev almış, aynı zamanda çeşitli girişim şirketlerinde kurucu ortak olarak yer almıştır. Bilişim sektöründeki girişimi için başarılı bir exit stratejisi geliştirerek önemli bir ticari başarı elde etmiştir. İTÜ ARI Teknokentte Genel Müdür olarak görev yapmış olan Deniz Tunçalp, girişimcilik ve teknoloji yönetimi konularında da önemli katkılar sunmaktadır.\nCarnegie Mel",
        "id": 4382592,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QBflWeO_gFk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QBflWeO_gFk/hqdefault.jpg",
        "title": "Teknoloji Girişimciliğinin Perde Arkası | Deniz Tunçalp | TEDxIzmir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:40.873273+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:37:31+00:00",
        "description": "Zamiast realizować swoje cele, kręcisz się w kółko z negatywnymi myślami i nie podejmujesz działania? Masz dość wewnętrznej walki między odwagą a lękiem oraz odkładania decyzji na „odpowiedni moment”?\n\nTo wystąpienie wyjaśnia, dlaczego wprowadzanie zmian tak często kończy się powrotem do starych schematów, mimo wiedzy, chęci i ambicji. Aleksandra Fidura, mentorka kobiet wspierająca specjalistki z branży beauty w budowaniu pewności siebie i autentycznych biznesów, pokazuje, jak praca z ciałem i energią wpływa na sposób podejmowania decyzji oraz umożliwia działanie nawet w obliczu strachu przed porażką. Mgr kosmetolog, szkoleniowiec i coach z pasją i misją motywowania kobiet do dbania o Siebie pod kątem holistycznym i edukowania młodych specjalistów z branży beauty, jak zaufać swojej intuicji i zarabiać na pasji w lekkości. Ceni sobie naturalność i siłę, a kosmetologia jest po to, aby ją wydobyć z Kobiet na światło dzienne. This talk was given at a TEDx event using the TED conference fo",
        "id": 4382593,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=h8wyed9Zcao",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/h8wyed9Zcao/hqdefault.jpg",
        "title": "Prawdziwa transformacja zaczyna się od zmiany Twojej energii | Aleksandra Fidura | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:41.098563+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:36:57+00:00",
        "description": "Czy chaos naprawdę jest chaosem… a może tylko innym porządkiem, którego jeszcze nie znamy?\n\nSpotkałeś ludzi, których sposób myślenia wydaje się kompletnie nieprzewidywalny? A może sam masz poczucie, że świat nie nadąża za Twoim tempem, skojarzeniami, logiką?\nZatrzymaj się na chwilę. I spójrz na chaos z innej perspektywy. Bydgoski edukator, andragog i menadżer oświaty, który łączy pasję do nauczania z rolą ojca trójki dzieci. Jako ekspert Ministerstwo Edukacji Narodowej oraz autor kryteriów weryfikacji zawodowych kwalifikacji, zna system edukacji od podszewki. Na co dzień pracuje jako Specjalista ds. Innowacji na Uniwersytet Kazimierza Wielkiego, gdzie rozwija nowoczesne podejścia do nauczania i rozwoju. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4382594,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=btDO3cIJ834",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/btDO3cIJ834/hqdefault.jpg",
        "title": "Chaos Aspergera - Teoria Konstelacji Gwiazd | Przemysław Müller | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:41.337952+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:36:06+00:00",
        "description": "Jeszcze niedawno wierzyliśmy, że przyszłość można obliczyć – dziś nauka odkrywa, że nieprzewidywalność jest wpisana w samą strukturę rzeczywistości. Ale to właśnie w niej kryje się wolność: możliwość wyboru, działania i tworzenia. W tej historii nauka inspiruje do transformacji myślenia o świecie, a romans fizyki kwantowej i filozofii prowadzi nas ku sprawczości. Fizyczka, szczególnie zafascynowana fundamentalnym problemem czasu. Laureatka konkursów międzynarodowych i ogólnokrajowych, na których prezentowała swoje projekty, m.in. koncepcję napędu dźwiękowego oraz model przewidujący dynamikę rozprzestrzeniania się ognia. Nina popularyzuje naukę, publikując treści na profilu instagramowym @kobiecypierwiastek oraz pisząc artykuły, m.in. dla największego portalu dotyczącego przemysłu kosmicznego w Polsce, Kosmonauta.net. Jest autorką książki „Kwanty nie gryzą” o mechanice kwantowej oraz e-booka „Kobiecy Pierwiastek” o kobietach-noblistkach. Swoją działalnością stara się motywować do angaż",
        "id": 4382595,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SWfWBQGFSYk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SWfWBQGFSYk/hqdefault.jpg",
        "title": "Jak fizyka czasu kształtuje Twoje decyzje i wolną wolę? | Nina Mazurewicz | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:41.633243+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:35:43+00:00",
        "description": "Dziecięce marzenia często inspirują nas do odwagi w dorosłości. Z czasem jednak zaczynamy zadawać sobie pytanie: „Być czy mieć?”. A co, jeśli można jedno i drugie? Co, jeśli poza posiadaniem można naprawdę być – doświadczać, poznawać, czuć, spotykać nowych ludzi?\n\nCo tak naprawdę nadaje sens naszemu życiu? Od 7 lat prowadzi firmę SiMedia, która pomaga ekspertom, liderom i firmom zdobywać widoczność, zaufanie i klientów.\n\nJest pomysłodawcą i organizatorem konferencji Zlinkowani, która przyciąga przedsiębiorców i specjalistów zainteresowanych skuteczną komunikacją w biznesie. Prowadzi własną społeczność skupiającą osoby, które chcą się rozwijać, dzielić wiedzą i wymieniać wartościami. \n\nSzymon to osoba z niepełnosprawnością, która przełamuje bariery – i pokazuje innym, jak to robić. Nie szuka wymówek, tylko rozwiązań. W życiu kieruje się determinacją i pasją – szczególnie do podróży. Wśród jego największych osiągnięć są wyjazdy na mecze Champions League w Londynie, FC Barcelony i... spo",
        "id": 4382596,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UrxfZSVm7eA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UrxfZSVm7eA/hqdefault.jpg",
        "title": "Było - jest - marzę | Szymon Karwasz | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:41.929458+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:35:32+00:00",
        "description": "Pozwolenie, na które się czeka, nigdy nie przychodzi. Bo nikt nie wie, że ktoś na nie czeka.\n\nTo opowieść o psychologii „cichego czekania” — zjawisku, które paraliżuje miliony ludzi, sprawiając, że rezygnują z własnego życia. O tym, jak wyuczona bezradność sprawia, że nawet gdy pojawia się realna możliwość ucieczki, wciąż wybierane jest czekanie. I dlaczego największa transformacja rzadko bywa spektakularna — najczęściej jest cichą zgodą na to, by w końcu dać sobie pozwolenie na własne życie.\n\nBo kluczowe pytanie nie brzmi „czy można?”, lecz „co zostanie zrobione już dziś?”. Jeszcze kilka miesięcy temu łączyła pełen etat z wychowaniem trójki dzieci, zmagając się z poczuciem niewystarczalności i brakiem przestrzeni na własne marzenia. Dziś wspiera kobiety, które – tak jak ona kiedyś – czują, że mogą i zasługują na więcej. Pomaga im zbudować markę osobistą na LinkedIn, która przyciąga klientów bez nachalnej sprzedaży i presji algorytmów.\nSpecjalizuje się w mentoringu 1:1 i szkoleniach d",
        "id": 4382597,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1LL5v5BIGwU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1LL5v5BIGwU/hqdefault.jpg",
        "title": "Transformacja zaczyna się, gdy przestajesz czekać na pozwolenie | Joanna Pomes | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:42.234041+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:34:58+00:00",
        "description": "W czasach kiedy wszyscy chcą być jak inni, odwagą jest pozostać sobą, trzymać się własnych wartości, zasad i marzeń. Wojskowe zasady ujednolicenia żołnierzy dziś przenoszą się na grunt wizerunku, relacji, nawyków zakupowych i kultur organizacyjnych, a w nas coraz więcej jest presji, oczekiwań i porównywania się do innych. Może łatwiej się dostosować, ale nie warto szukać łatwego życia, lepiej zawalczyć o takie życie, które warto przeżyć. Przez ponad dwie dekady kształtował kadry wojskowe i przygotowywał żołnierzy do służby w sytuacjach wymagających odwagi, odpowiedzialności i konsekwencji działania. Jako dowódca brał udział w misjach wojskowych m.in. w Kosowie, Bośni i Hercegowinie, Czadzie oraz Afganistanie, gdzie mierzył się z wyzwaniami operacyjnymi, ale także z granicami własnej wytrzymałości psychicznej i moralnej.\n\nByły Komendant Centrum Szkolenia Wojsk Obrony Terytorialnej, instruktor przetrwania, specjalista Force Protection oraz współautor książki „Taktyki Sił Zbrojnych w życ",
        "id": 4382598,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=26OFd8I85UI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/26OFd8I85UI/hqdefault.jpg",
        "title": "Transformacja poprzez wojnę | Krzysztof Leszczyński | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:42.474992+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:33:59+00:00",
        "description": "Każdego dnia coś pijemy ale na ogół spożywamy niewłaściwie napoje i zapominamy o wodzie.  Woda jest życiodajna, a w tym pouczającym i zabawnym wystąpieniu dowiesz się, jak pić wodę aby być skutecznie nawodnionym? Poznasz też konsekwencje niewłaściwych proporcji. Mentorka, mówczyni, liderka i managerka, która łączy świat biznesu i sceny. Jest entuzjastką idei “łączy nas chemia” i propagatorką chemii w życiu codziennym. Puszcza oko do publiczność i świata, czyniąc alchemię zabawną przyjaciółką przyziemności. \n\nAbsolwentka biochemii i zarządzania, biegaczka i fanka mocnych brzmień rockowych. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4382599,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nA_1aXrPXnI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nA_1aXrPXnI/hqdefault.jpg",
        "title": "Jak zmienić stan skupienia? | Alicja Trojanowska-Laskowska | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:42.678260+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:33:26+00:00",
        "description": "Kiedy chcesz zmiany swojego życia, wiedz, że największa transformacja potrzebuje się dokonać najpierw w Tobie. Moment, w którym zdasz sobie sprawę, że żyjąc tylko raz, inwestujesz czas w realizację cudzych marzeń, a nie własnych, może być dla Ciebie przełomowy tylko wtedy, gdy pójdziesz za głosem swojego serca, zaufasz sobie i podejmiesz decyzję: wybieram siebie. W swojej mowie opowiem o tym, co jest potrzebne, by postawić odważnie pierwszy krok w kierunku realizacji siebie i swojej pasji oraz po czym poznasz, że jesteś gotowy na podjęcie ryzyka. Kobieta, która łączy siłę działania z wrażliwością na człowieka. Przedsiębiorczyni, liderka i praktyk zarządzania z ponad 15-letnim doświadczeniem. Zdecydowała się zamienić etat na własną firmę szkoleniowo-doradczą, tworząc markę osobistą EJP — symbol odwagi, niezależności i życia na własnych zasadach.\n\nMentorka i trenerka biznesu, która inspiruje kobiety do odważnego sięgania po więcej. Jako prelegentka wydarzeń dla kobiet i o kobietach poka",
        "id": 4382600,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iFKajn5hsMM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iFKajn5hsMM/hqdefault.jpg",
        "title": "Jak wybrać siebie i z dnia na dzień odejść z etatu? | Edyta Jagodzińska-Pawluk | TEDxBydgoszcz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:42.822173+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:32:11+00:00",
        "description": "Instead of fate, life holds inherent uncertainty. Human choice is a combination of consciousness, imagination and decision-making capabilities, allowing individuals to shape their own future.  Terry Guo is a grade 10 student at Prince of Wales Secondary School. His passions include mathematics, chess, art and badminton, all positively contributing to his sense of creativity, logical reasoning, strategic thinking and overall physical well-being. In his free time, he continues to explore his passions beyond what he already knows. Terry is always exploring new concepts and ideas both in the classroom and outside of it, hoping to share his ideas within his community. He also possesses the drive to continue developing and bettering his skills for himself and others. His goal is to share his creativity and passion with the world around him. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/",
        "id": 4382601,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cbcQHnPLIc4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cbcQHnPLIc4/hqdefault.jpg",
        "title": "Free Will: Writing Your Own Future | Terry Guo | TEDxYouth@MageeSecondary",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T15:43:43.003790+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:32:03+00:00",
        "description": "Education extends beyond classrooms and competition. It is about empathy, encouragement, learning from your own mistakes and helping others find the courage to face on their own personal struggles. Shawn is a Grade 11 student at Magee Secondary in Vancouver, known for his presence, confidence, and thoughtful nature. As an international student, he has grown up moving between cultures, an experience that has shaped his ability to listen deeply, think with nuance, and connect across differences. Shawn values meaningful dialogue and the power of human connection. He approaches the world with sensitivity and clarity, finding depth in small moments and quiet observations. Communication and storytelling for him are ways of making sense of the world. Shawn believes that when ideas are shared with sincerity and vulnerability, they invite reflection, empathy, and connection. Whether in conversation or on stage, he speaks not to impress, but to create resonance. This talk was given at a TEDx ev",
        "id": 4382602,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NEjgUFWnlRY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NEjgUFWnlRY/hqdefault.jpg",
        "title": "The Meaning of Education | Shawn Zhao | TEDxYouth@MageeSecondary",
        "vote": 0
    }
]