[
    {
        "age": null,
        "album": "",
        "author": "Kevin Stratvert",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T21:43:02.770201+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:26:27+00:00",
        "description": "This Claude Code Tutorial teaches you what I wish I knew as a software developer about Claude Code before I started AI coding. Get started here: https://clau.de/kevinstratvert \n\nYou can vibe code with tools like Lovable or you can build durable software with tools like Claude Code. First, I'll walk you through how to install it on Mac or Windows. \n\nNext, you’ll connect Claude Code to VS Code and learn how to build your first app - including how best to structure your prompts and what details are useful for Claude to know. \n\nYou'll review Claude's Plan mode like a senior engineer and learn how to work faster once you trust the changes it makes. \n\nNext, you'll learn how to use Claude Code with an existing codebase - focusing on how to get it to analyze your coding standards so future changes are consistent. (Heavy use of CLAUDE.md) \n\nFinally, you’ll execute a major architecture change and learn how best to work with Claude Code throughout the process. \n\nHost: David DeWinter \nSponsor: An",
        "id": 4385424,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eMZmDH3T2bY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 958,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfJT_eYDTmDE-ovKaxVE1ig",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eMZmDH3T2bY/hqdefault.jpg",
        "title": "Claude Code Tutorial for Beginners",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Kevin Stratvert",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T21:43:02.936250+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T08:01:29+00:00",
        "description": "Microsoft Ignite wasn’t just another AI announcement event. It revealed a much bigger shift in how Microsoft is building AI for work.\n\nAfter attending Ignite in San Francisco and speaking directly with the teams behind Windows, Edge, and Copilot, one theme became very clear. Microsoft is moving from AI that answers questions to AI agents that actually take action, quietly running work in the background.\n\nIn this video, I break down:\n • What Microsoft’s AI agents really are\n • Why Windows is becoming the foundation for AI work\n • How the browser is evolving into an AI agent\n • Why Copilot is the front door, not the worker\n • How Microsoft is tackling trust, security, and responsible AI\n • What this all means for how work will change over the next year or two\n\nThis wasn’t about flashy demos or experimental features. Ignite showed a more serious, more accountable AI strategy focused on reliability, governance, and real-world enterprise use.\n\nFull disclosure: Microsoft covered my travel t",
        "id": 4385425,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xIsrE5Qi7EM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 958,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfJT_eYDTmDE-ovKaxVE1ig",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xIsrE5Qi7EM/hqdefault.jpg",
        "title": "Microsoft’s REAL AI Strategy Explained (After Ignite)",
        "vote": 0
    }
]