[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T00:01:33.310065+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T23:40:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: With just three days to go before Christmas, a cyberattack knocked France's national postal service offline Monday, blocking and delaying package deliveries and online payments. The timing was miserable for millions of people at the height of the Christmas season, as frazzled postal workers fended off frustrated customers. No one immediately claimed responsibility, but suspicions abounded.\n \nWhat the postal service La Poste called a ''major network incident'' remained unresolved by Monday evening, more than eight hours after it was first reported. For a company that delivered 2.6 billion packages last year and employs more than 200,000 people, that's a big hit. La Poste said in a statement that a distributed denial of service incident, or DDoS, \"rendered its online services inaccessible.\" It said the incident had no impact on customer data, but disrupted package delivery. Letters, including holiday greeting cards, could st",
        "id": 4386368,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/22/2158219/cyberattack-disrupts-frances-postal-service-banking-during-christmas-rush",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cyberattack Disrupts France's Postal Service, Banking During Christmas Rush",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T00:01:33.532206+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T23:00:00+00:00",
        "description": "Oracle co-founder Larry Ellison has personally guaranteed $40.4 billion to shore up Paramount's bid for Warner Bros. Discovery, trying to ease financing doubts as Warner Bros weighs a rival offer from Netflix. Reuters reports: Paramount said the amended terms do not change the $30-per-share all-cash offer even as the fight for Hollywood's sought-after assets heats up, with control of Warner Bros' vast library offering a decisive edge in the streaming wars. \"I doubt many Warner Bros shareholders that are on the fence or planning to vote no \"were holding out due to issues the \"revised bid addresses such as a guarantee from Larry Ellison on the funding front,\" said Seth Shafer, principal analyst at S&amp;P Global.\n \nAs part of the revised terms, Ellison also agreed not to revoke the family trust or transfer its assets during the pendency of the transaction, the filing showed. Paramount said it has raised its regulatory reverse termination fee to $5.8 billion from $5 billion to match the ",
        "id": 4386369,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/22/2138243/larry-ellison-pledges-40-billion-personal-guarantee-for-paramounts-warner-bros-bid",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Larry Ellison Pledges $40-Billion Personal Guarantee For Paramount's Warner Bros Bid",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T22:57:33.536874+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T22:20:00+00:00",
        "description": "Vince Zampella, the co-creator of Call of Duty and co-founder of Infinity Ward and Respawn Entertainment, died at 55 in a single-car accident in Los Angeles. According to NBC Los Angeles, \"The single-car crash was reported at about 12:45 p.m. on the scenic road north of Los Angeles in the San Gabriel Mountains. The southbound car veered off the road, hit a concrete barrier and a passenger was ejected, the California Highway Patrol said. The driver was trapped in the ensuing car fire, the CHP said. The driver died at the scene and the passenger died at a hospital, authorities told NBC4 Investigates.\" IGN reports: Zampella was an incredibly talented game developer who changed the industry with Call of Duty, a franchise he co-created with Jason West in 2003 at Infinity Ward, the studio he co-founded with West, after previously serving as the lead designer for EA's Medal of Honor: Allied Assault. Zampella was at the center of a high-profile lawsuit against Activision that alleged that the",
        "id": 4385955,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/22/2143219/call-of-duty-co-creator-respawn-co-founder-and-ea-exec-vince-zampella-killed-in-car-accident",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Call of Duty Co-Creator, Respawn Co-Founder, and EA Exec Vince Zampella Killed In Car Accident",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T21:49:19.512867+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T21:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Monday, the US Department of the Interior announced that it was pausing the leases on all five offshore wind sites currently under construction in the US. The move comes despite the fact that these projects already have installed significant hardware in the water and on land; one of them is nearly complete. In what appears to be an attempt to avoid legal scrutiny, the Interior is blaming the decisions on a classified report from the Department of Defense.\n \nThe second Trump administration announced its animosity toward offshore wind power literally on day one, issuing an executive order on inauguration day that called for a temporary halt to issuing permits for new projects pending a re-evaluation. Earlier this month, however, a judge vacated that executive order, noting that the government has shown no indication that it was even attempting to start the re-evaluation it said was needed. But a number of projects have gone throu",
        "id": 4385544,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/22/2133214/us-blocks-all-offshore-wind-construction-says-reason-is-classified",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Blocks All Offshore Wind Construction, Says Reason Is Classified",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T21:49:19.601618+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T20:42:00+00:00",
        "description": "Abstract of a paper featured on NBER: How has aggregate income and welfare in the United States been affected by globalization and rapid productivity growth in emerging economies? We use the class of constant elasticity trade models to provide quantitative evidence on these questions. We find that reductions in worldwide trade frictions over the period from 1960-2020 reduced the share of the United States in global GDP but raised its aggregate welfare. Similarly, productivity growth in Japan and China led to a decline in the relative income of the United States, but brought aggregate welfare gains from the resulting expansion in global production possibilities. Trade integration and foreign productivity growth have relatively modest effects on domestic income and welfare compared to domestic productivity growth.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Accommodating+Emerging+Giants+in+the+Global+Economy%3A+htt",
        "id": 4385545,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/22/2024246/accommodating-emerging-giants-in-the-global-economy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Accommodating Emerging Giants in the Global Economy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T20:41:16.396745+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T20:05:00+00:00",
        "description": "Australian restaurants facing a mounting cost-of-doing-business crisis are turning to automatic service charges as a way to shore up revenue. The practice is legal under Australian consumer law as long as customers are notified beforehand and can opt out, but it risks alienating diners in a country where tipping has traditionally been optional. \n\nWes Lambert, chief executive of the Australian Cafe and Restaurant Association, said only a handful of businesses in central business districts currently add automatic tips to bills, but the practice may spread as cost pressures continue. Automatic tipping is more common at venues frequented by international tourists, who view the practice as normal rather than exceptional. With international tourism now near pre-COVID levels, Lambert expects more restaurants to include tips on bills by default. \n\nA Sydney wine bar recently abandoned its 10 per cent automatic tip after a diner's social media post triggered public backlash. University of New S",
        "id": 4385039,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/22/202229/australian-eateries-turn-to-automatic-tipping-as-cost-of-doing-business-climbs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australian Eateries Turn To Automatic Tipping as Cost of Doing Business Climbs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T19:36:18.110833+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T19:27:00+00:00",
        "description": "If you watched Avatar: Fire and Ash in James Cameron's preferred high frame rate 3D format and noticed certain sequences appearing unusually smooth while others had the traditional cinematic look, that visual inconsistency is entirely intentional. The third Avatar film continues Cameron's frame rate experimentation from The Way of Water, selectively deploying 48 frames per second for underwater and flying sequences while keeping dialogue scenes at the standard 24 FPS. \n\nThe human eye perceives somewhere between 30 and 60 FPS, meaning viewers can detect the shift between frame rates. Cameron argues the tradeoff is worth it: discomfort from 3D viewing isn't eye strain but \"brain strain,\" caused when parallax-sensitive neurons struggle to process jumping vertical edges. Higher frame rates smooth this out. When critics questioned the approach, Cameron was characteristically blunt. \"I think $2.3 billion says you might be wrong on that,\" he told DiscussingFilm, referencing The Way of Water'",
        "id": 4384551,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/22/1927237/why-some-avatar-fire-and-ash-scenes-look-so-smooth-and-others-dont",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Some Avatar: Fire and Ash Scenes Look So Smooth, and Others Don't",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T19:36:18.299288+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T18:41:00+00:00",
        "description": "Linux's share of the desktop market has climbed to as much as 11% by one count, but that figure includes Chromebooks, and the traditional Linux desktop remains hamstrung by the same fragmentation that killed Unix decades ago. Steven J. Vaughan-Nichols, writing in The Register, argues that the proliferation of Linux desktops -- more than a dozen significant interfaces exist today, and DistroWatch lists \"upwards of a hundred\" -- makes it nearly impossible for ordinary users to know where to start. \n\nLinus Torvalds has long agreed with this hypothesis. \"We have way too many desktops,\" Vaughan-Nichols notes, summarizing Torvalds' position. The deeper issue lies in software delivery: traditional package managers like DEB and RPM \"simply don't scale for the desktop,\" forcing distro builders to constantly rebuild programs for their specific environments. Containerized solutions like Flatpaks, Snaps and AppImages should solve this by bundling dependencies into universal packages, but the Linu",
        "id": 4384552,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/22/1840258/what-the-linux-desktop-really-needs-to-challenge-windows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What the Linux Desktop Really Needs To Challenge Windows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:26:51.327437+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T18:02:00+00:00",
        "description": "Instacart has ended its AI-powered pricing tests after a study from Groundwork Collaborative, Consumer Reports and More Perfect Union revealed that the grocery delivery platform was showing different customers different prices for identical items at the same store. The company said Monday that retailers can no longer use Eversight, the AI pricing technology Instacart acquired in 2022, to run such tests. \n\n\"Now, if two families are shopping for the same items, at the same time, from the same store location on Instacart, they see the same prices -- period,\" the company wrote in a blog post. The study drew attention from lawmakers; Sen. Chuck Schumer wrote to the FTC that \"consumers deserve to know when they are being placed into pricing tests,\" and Reuters reported that the agency had opened an investigation. Instacart says the tests \"were never based on supply or demand, personal data, demographics, or individual shopping behavior.\" \n\nThe company also reached a $60 million settlement l",
        "id": 4384094,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/22/1756217/instacart-kills-ai-pricing-tests-that-charged-some-customers-more-than-others",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Instacart Kills AI Pricing Tests That Charged Some Customers More Than Others",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T18:26:51.619006+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T17:21:00+00:00",
        "description": "BrianFagioli writes: Visa says it has completed hundreds of secure, AI-initiated transactions with partners, arguing this proves agent driven shopping is ready to move beyond experiments. The company believes 2025 will be the last full year most consumers manually check out, with AI agents handling purchases at scale by the 2026 holiday season. Nearly half of US shoppers already use AI tools for product discovery, and Visa wants to extend that shift all the way through payment using its Intelligent Commerce framework. \n\nThe pilots are already live in controlled environments, powering consumer and business purchases through AI agents tied to Visa's payment rails. To prevent abuse, Visa and partners have introduced a Trusted Agent Protocol to help merchants distinguish legitimate AI agents from bots, with Akamai adding fraud and identity controls. While the infrastructure may be ready, the bigger question is whether consumers fully understand the risks of letting software spend their mo",
        "id": 4384095,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/22/1210214/visa-says-ai-will-start-shopping-and-paying-for-you-in-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Visa Says AI Will Start Shopping and Paying For You In 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T17:17:14.616204+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:41:00+00:00",
        "description": "The video games industry in 2025 finds itself caught between the familiar forces of consolidation and job losses that have plagued creative industries, and a newer development: governments and the ultra-wealthy have begun treating games as tools of political influence. Saudi Arabia's Public Investment Fund closed a $55 billion deal for EA this year and acquired Niantic, the makers of Pokemon Go, in March. \n\nMicrosoft's 2023 acquisition of Activision already signaled the direction of travel. The workforce has borne the costs of this consolidation. More than 5,000 jobs have been lost in the industry this year, and several studios have shuttered, including Monolith Productions. The instability has pushed unions into greater prominence: United Videogame Workers formed in the US and Canada in March as part of the Communications Workers of America, and the firing of 30 staff from Rockstar Games in the UK brought the IWGB Game Workers Union into the spotlight. \n\nMeanwhile, the Trump administ",
        "id": 4383487,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/22/126233/state-of-play-who-holds-the-power-in-the-video-games-industry-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "State of Play: Who Holds the Power in the Video Games Industry in 2025?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:06:30.178078+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T16:00:00+00:00",
        "description": "BrianFagioli writes: Samsung is bringing Google Gemini directly into the kitchen, starting with a refrigerator that can see what you eat. At CES 2026, the company plans to show off a new Bespoke AI Refrigerator that uses a built in camera system paired with Gemini to automatically recognize food items, including leftovers stored in unlabeled containers. The idea is to keep an always up to date inventory without manual input, track what is added or removed, and surface suggestions based on what is actually inside the fridge. It is the first time Google's Gemini AI is being integrated into a refrigerator, pushing generative AI well beyond phones and laptops.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung+Is+Putting+Google+Gemini+AI+Into+Your+Refrigerator%2C+Whether+You+Need+It+or+Not%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F12%2F22%2F120248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https:",
        "id": 4382865,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/22/120248/samsung-is-putting-google-gemini-ai-into-your-refrigerator-whether-you-need-it-or-not",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung Is Putting Google Gemini AI Into Your Refrigerator, Whether You Need It or Not",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T16:06:30.543479+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T15:21:00+00:00",
        "description": "Beverly Hills High School has deployed an AI-powered surveillance apparatus that includes facial recognition cameras, behavioral analysis software, smoke detector-shaped bathroom listening devices from Motorola, drones, and license plate readers from Flock Safety -- a setup the district spent $4.8 million on in the 2024-2025 fiscal year and considers necessary given the school's high-profile location in Los Angeles. \n\nSimilar systems are spreading to campuses nationwide as schools try to stop mass shootings that killed 49 people on school property this year, 59 in 2024, and 45 in 2023. A 2023 ACLU report found that eight of the ten largest school shootings since Columbine occurred at schools that already had surveillance systems, and 32% of students surveyed said they felt like they were always being watched. The technology has a spotty track record, however. \n\nGun detection vendor Evolv, used by more than 800 schools including Beverly Hills High, was reprimanded by the FTC in 2024 fo",
        "id": 4382866,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/22/1154232/welcome-to-americas-new-surveillance-high-schools",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Welcome To America's New Surveillance High Schools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T14:58:42.022269+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T14:40:00+00:00",
        "description": "Colin Angle, the founder of iRobot who built the company from his living room over 35 years and sold more than 50 million Roomba vacuums, watched his creation file for Chapter 11 bankruptcy earlier this month after what he describes as an \"avoidable\" regulatory ordeal that killed Amazon's $1.7 billion acquisition bid. In an interview with TechCrunch, Angle recounted the 18-month investigation by the FTC and European regulators that preceded Amazon's January 2024 decision to abandon the deal. The process consumed over 100,000 documents and a significant portion of iRobot's discretionary earnings. Angle said the deal should have taken \"three, four weeks of investigation\" given iRobot's declining market position -- 12% and falling in Europe, where the leading competitor was only three years old. \n\nDuring his deposition, Angle said he walked the halls of the FTC and noticed examiners had \"printouts of deals blocked, like trophies\" on their office doors. He entered the process \"looking for",
        "id": 4382327,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/22/1147243/irobot-founder-says-ftc-treated-blocked-deals-like-trophies-as-bankruptcy-follows-failed-amazon-acquisition",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iRobot Founder Says FTC Treated Blocked Deals 'Like Trophies' as Bankruptcy Follows Failed Amazon Acquisition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T14:58:42.200009+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T14:00:00+00:00",
        "description": "A group of activists has scraped Spotify's entire library, accessing 256 million rows of track metadata and 86 million audio files totaling roughly 300TB of data. The metadata has been released via Anna's Archive, a search engine for \"shadow libraries\" that previously focused on books. \n\nSpotify described the activists as \"anti-copyright extremists who've previously pirated content from YouTube and other platforms\" and confirmed it is actively investigating the incident. The activists claim this represents \"the world's first 'preservation archive' for music which is fully open\" and covers \"around 99.6% of listens.\" \n\nThey appear to have used Spotify's public web API to scrape the metadata and circumvented DRM to access audio files. Spotify insists that this is not a security breach affecting user data. Though the more pressing concern for the music industry may be AI training rather than pirate streaming services -- similar YouTube datasets have reportedly been used by unlicensed gene",
        "id": 4382328,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/22/1128259/spotify-says-anti-copyright-extremists-scraped-its-library",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Spotify Says 'Anti-Copyright Extremists' Scraped Its Library",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T12:51:12.292875+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T12:34:00+00:00",
        "description": "A \"slew of layoffs, price hikes and studio closures\" for Microsoft's Xbox \"have led many to declare &mdash; not for the first time &mdash; that the Xbox is dead,\" reports CNBC. \n\nOr is it just changing its business model?\n\nThe company's overall gaming revenue decreased 2% year-over-year, with a 29% dip in Xbox hardware sales, according to Microsoft's first-quarter earnings for fiscal 2026. The broader console industry has been in a major slump, with hardware spending down 27% year-over-year in November, which is typically a busy shopping month, according to a recent report from research firm Circana. It was the worst November in two decades, IGN reported, citing Circana data. Combined Switch and Switch 2 unit sales were down more than 10% during the month and PS5 sales were down more than 40%, IGN said. But the Xbox Series hardware took the biggest beating, with a dramatic 70% drop in sales...Microsoft's Xbox Series S and Series X, at 1.7 million units, couldn't outsell the original N",
        "id": 4381423,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/22/0721241/is-xbox-betting-on-cross-platform-gaming",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Xbox Betting on Cross-Platform Gaming?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T10:49:59.851796+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T10:34:00+00:00",
        "description": "\"It's all fixed,\" says that Apple developer who was locked out of his Apple Account after redeeming a compromised Apple Gift Card.\n\n\n\"A lovely man from Singapore, working for Apple Executive Relations, who has been calling me every so often for a couple of days, has let me know it's all fixed. It looks like the gift card I tried to redeem, which did not work for me, and did not credit my account, was already redeemed in some way (sounds like classic gift card tampering), and my account was caught by that. \n\n\"Obviously it's unacceptable that this can happen, and I'm still trying to get more information out of him, but at least things are now mostly working. \n\n\"Strangely, he did tell me to only ever buy gift cards from Apple themselves; I asked if that means Apple's supply chain of Blackhawk Network, InComm, and other gift card vendors is insecure, and he was unwilling to comment.\"\n \n\nUpdates to his original blog post now include a frequently-asked questions list:\n\n\nYes, I have the rece",
        "id": 4380670,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/22/0741256/apple-developers-account-restored-after-compromised-gift-card-incident",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Developer's Account Restored After Compromised Gift Card Incident",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T07:41:25.444813+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T06:34:00+00:00",
        "description": "They call it \"the business-impersonator scam\". And it's fooled 396,227 Americans in just the first nine months of 2025 &mdash; 18% more than the 335,785 in the same nine months of 2024. That's according to a Bloomberg reporter (who also fell for it in late November), citing the official statistics from America's Federal Trade Commission:\n\nSome pose as airline staff on social media and respond to consumer complaints. Others use texts or e-mails claiming to be an airline reporting a delayed or cancelled flight to phish for travellers' data. But the objective is always the same: to hit a stressed out, overwhelmed traveller at their most vulnerable.\nIn my case, the scammer exploited weaknesses in Google's automated ad-screening system, so that fraudulent sponsored results rose to the top [They'd typed \"United airlines agent on demand\" into Google, and the top search result on their phone said United.com, had a 1-888 number next to it and said it had had 1M+ visits in past month. \"It looke",
        "id": 4379744,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/22/0524233/in-2025-scammers-have-stolen-835m-from-americans-using-fake-customer-service-numbers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In 2025 Scammers Have Stolen $835M from Americans Using Fake Customer Service Numbers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T04:37:40.438549+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T04:05:00+00:00",
        "description": "Tuesday the White House faces a deadline to decide \"whether Chinese drone maker DJI Technologies poses a national security threat,\" reports Bloomberg. But their article notes it's \"a decision with the potential to ground thousands of machines deployed by police and fire departments across the US.\" \n\n\nOne person making the case against the drones is Mike Nathe, a North Dakota Republican state representative described by the Post as \"at the forefront of a nationwide campaign sounding alarms about the Made-in-China aircraft.\" Nathe tells them that \"People do not realize the security issue with these drones, the amount of information that's being funneled back to China on a daily basis.\"\n\n\nThe president already signed anexecutive orderin June targeting \"foreign control or exploitation\" of America's drone supply chain. That came after Congress mandated a review to determine whether DJI deserves inclusion in a federal register of companies believed to endanger national security. If DJI does",
        "id": 4379084,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/22/042225/the-us-could-ban-chinese-made-drones-used-by-police-departments",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The U.S. Could Ban Chinese-Made Drones Used By Police Departments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T02:33:10.561424+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T01:34:00+00:00",
        "description": "In July Google promised to scale the CO2 batteries of \"Energy Dome\" as a long-duration energy storage solution. Now IEEE Spectrum visits its first plant in Sardinia, where 2,000 tonnes of carbon dioxide power a turbine generating 20 MW over 10 hours &mdash; storing \"large amounts of excess renewable energy until it's needed...\" \n\n\"Google likes the concept so much that it plans to rapidly deploy the facilities in all of its key data-center locations in Europe, the United States, and the Asia-Pacific region.\"\n\n\nDeveloped by the Milan-based company Energy Dome, the bubble and its surrounding machinery demonstrate a first-of-its-kind \"CO2 Battery,\" as the company calls it... And in 2026, replicas of this plant will start popping up across the globe. We mean that literally. It takes just half a day to inflate the bubble. The rest of the facility takes less than two years to build and can be done just about anywhere there's 5 hectares of flat land. \n\nThe first to build one outside of Sardin",
        "id": 4378682,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/21/2337215/google-launches-co2-battery-plants-for-long-duration-storage-of-renewable-energy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Launches CO2 Battery Plants for Long-Duration Storage of Renewable Energy",
        "vote": 0
    }
]