[
    {
        "age": null,
        "album": "",
        "author": "Ruhi Cenet Documentaries",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-22T20:46:59.500076+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-22T19:39:34+00:00",
        "description": "Welcome to McAllen, Texas, the most obese city the United States and also in the World.\nHere, nearly one in two people is obese and almost half of the remaining population is overweight. That means 3 out of every 4 people outside are at risk of serious health problems and early death.\nAs I drive, I pass from one fast-food place after another, 10 in 2 minutes. This isn’t urban planning, this is a fast-food corridor. \nSubscribe ► https://goo.gl/MKi8tn\n\nThis city is designed to fatten people until they are so heavy that they can’t leave their beds.  \nPeople in McAllen order fast-food as often as three times a day and the trend isn’t slowing down. Locals here have a strong appetite for deep-fried, oily, creamy dishes. They eat almost three times more than their body needs every day.\n\nMany people drink hundreds of liters of coke a year instead of water. As demand is so high, Coca Cola operates a massive distribution center here.\n\nWe’ve been out here for twenty minutes, and I haven’t seen a",
        "id": 4385113,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cgu-XOhE5k8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 770,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCWpk9PSGHoJW1hZT4egxTNQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cgu-XOhE5k8/hqdefault.jpg",
        "title": "Visiting the Most Obese City in the World (76% are overweight)",
        "vote": 0
    }
]