[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T23:36:20.830162+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T23:30:00+00:00",
        "description": "France, Spain, Italy, Denmark, and Greece will pilot an age verification app to better protect children online, as part of the EU's push to enforce its Digital Services Act. Reuters reports: The setup for the age verification app is built on the same technical specifications as the European Digital Identity Wallet which will be rolled out next year. The five countries can customize the model according to their requirements, integrate into a national app or keep it separately. The landmark legislation, which became applicable last year, requires Alphabet's Google, Meta, ByteDance's TikTok and other online companies to do more to tackle illegal and harmful online content. EU regulators said the new guidelines would help online platforms to tackle addictive design, cyberbullying, harmful content and unwanted contact from strangers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Five+EU+States+To+Test+Age+Verification+A",
        "id": 3165685,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/14/1945242/five-eu-states-to-test-age-verification-app-to-protect-children?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Five EU States To Test Age Verification App To Protect Children",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T23:36:21.009369+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T22:50:00+00:00",
        "description": "Chinese AI startup Moonshot AI has released Kimi K2, a trillion-parameter open-source language model that outperforms GPT-4 in key benchmarks with particularly strong performance on coding and autonomous agent tasks. VentureBeat reports: The new model, called Kimi K2, features 1 trillion total parameters with 32 billion activated parameters in a mixture-of-experts architecture. The company is releasing two versions: a foundation model for researchers and developers, and an instruction-tuned variant optimized for chat and autonomous agent applications. \"Kimi K2 does not just answer; it acts,\" the company stated in its announcement blog. \"With Kimi K2, advanced agentic intelligence is more open and accessible than ever. We can't wait to see what you build.\"\n \nThe model's standout feature is its optimization for \"agentic\" capabilities -- the ability to autonomously use tools, write and execute code, and complete complex multi-step tasks without human intervention. In benchmark tests, Kim",
        "id": 3165686,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/07/14/1942209/chinas-moonshot-launches-free-ai-model-kimi-k2-that-outperforms-gpt-4-in-key-benchmarks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Moonshot Launches Free AI Model Kimi K2 That Outperforms GPT-4 In Key Benchmarks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T22:32:10.668253+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Samuel Herman and Alexander Baciu never liked using Comcast's cable broadband. Now, the residents of Saline, Michigan, operate a fiber Internet service provider that competes against Comcast in their neighborhoods and has ambitions to expand. \"All throughout my life pretty much, I've had to deal with Xfinity's bullcrap, them not being able to handle the speeds that we need,\" Herman told Ars. \"I lived in a house of 10. I have seven other brothers and sisters, and there's 10 of us in total with my parents.\" With all those kids using the Internet for school and other needs, \"it just doesn't work out,\" he said. Herman was particularly frustrated with Comcast upload speeds, which are much slower than the cable service's download speeds. \"Many times we would have to call Comcast and let them know our bandwidth was slowing down... then they would say, 'OK, we'll refresh the system.' So then it would work again for a week to two weeks, an",
        "id": 3165329,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/1935230/two-guys-hated-using-comcast-so-they-built-their-own-fiber-isp?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Two Guys Hated Using Comcast, So They Built Their Own Fiber ISP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T22:32:10.864156+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T21:30:00+00:00",
        "description": "Apple is facing pressure to shake up its corporate playbook to invigorate its struggling artificial intelligence efforts. From a report: Alarmed by a share slump that's erased more than $640 billion in market value this year and frustrated with delays in rolling out AI features, investors are calling for Apple to break with long-standing traditions to make a big acquisition and more aggressively pursue talent. \n\n\"Historically Apple does not do big mergers and acquisitions,\" said Citigroup Inc. analyst Atif Malik, noting that the last major deal was its takeover of Beats in 2014. But, he argues, \"investors would turn more positive if Apple could acquire or invest a meaningful stake in an established AI provider.\" \n\nApple shares have fallen 16% this year while traders bid up the shares of peers like Meta, which is spending lavishly on AI. While Apple faces other problems, including its exposure to tariffs and regulatory issues, disappointment in bringing compelling AI features to its va",
        "id": 3165330,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/07/14/193204/apple-faces-calls-to-reboot-ai-strategy-with-shares-slumping?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Faces Calls To Reboot AI Strategy With Shares Slumping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T21:26:13.021548+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T20:50:00+00:00",
        "description": "Armagh Observatory is marking a very special meteorological milestone as the institute celebrates 230 years of continuous weather observation. From a report: The unbroken tradition of handwritten data makes it the longest sequence of continuous weather information gathered anywhere in the UK and Ireland. Events are being held at Armagh Observatory on Monday to mark the significant anniversary. Nowadays, most weather data is gathered only by automated weather stations, but not in Armagh, where the human touch remains. \n\nThe first handwritten recording was made on the evening of 14 July 1795, when a measurement of the temperature and air pressure was recorded on a graph at the observatory that sits above the city of Armagh. The measurement was repeated the next day and every subsequent day for the next 230 years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Armagh+Observatory+Marks+230+Years+of+Recording+Weather%3A+",
        "id": 3164901,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/14/1858223/armagh-observatory-marks-230-years-of-recording-weather?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Armagh Observatory Marks 230 Years of Recording Weather",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T20:21:13.456286+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T20:10:00+00:00",
        "description": "A small fraction of hyperactive social media users generates the vast majority of toxic online content, according to research by New York University psychology professor Jay Van Bavel and colleagues Claire Robertson and Kareena del Rosario. The study found that 10% of users produce roughly 97% of political tweets, while just 0.1% of users share 80% of fake news. \n\nTwelve accounts known as the \"disinformation dozen\" created most vaccine misinformation on Facebook during the pandemic, the research found. In experiments, researchers paid participants to unfollow divisive political accounts on X. After one month, participants reported 23% less animosity toward other political groups. Nearly half declined to refollow hostile accounts after the study ended, and those maintaining healthier newsfeeds reported reduced animosity 11 months later. The research describes social media as a \"funhouse mirror\" that amplifies extreme voices while muting moderate perspectives.<p><div class=\"share_submis",
        "id": 3164529,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/1844246/are-a-few-people-ruining-the-internet-for-the-rest-of-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are a Few People Ruining the Internet For the Rest of Us?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T20:21:13.637600+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T19:30:00+00:00",
        "description": "A Department of Justice filing aiming to recover fraudulently obtained cryptocurrency may have inadvertently revealed the scam's victims as the CEO and CFO of crypto payment firm MoonPay. From a report: The filing, which aims to seize around $40,350 in USDT frozen by Tether, reveals that two victims sent $250,300 in USDT to a person posing as Steve Witkoff, co-chair of the President Trump's inaugural committee. \n\nHowever, records obtained from Binance revealed that the wallet that received the funds was registered to Ehiremen Aigbokhan, a man based in Lagos, Nigeria. The victims are identified in the filing only as \"Ivan\" and \"Mouna.\" However, as outlet NOTUS noticed, Crypto payment firm Moonpay's CEO is Ivan Soto-Wright and its CFO is Mouna Ammari Siala. Furthermore, a wallet involved in the $250,300 transaction is listed by Etherscan as a MoonPay wallet.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=MoonPay+Execu",
        "id": 3164530,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/14/1837234/moonpay-executives-may-have-sent-250000-to-nigerian-scammer-doj-filing-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MoonPay Executives May Have Sent $250,000 To Nigerian Scammer, DoJ Filing Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T19:14:39.489268+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T18:50:00+00:00",
        "description": "Cognition AI, an artificial intelligence startup that offers a software coding assistant, said on Monday that it had bought rival Windsurf as part of an escalating battle to lead in the technology. From a report: The move follows a $2.4 billion deal by Google to acquire some of Windsurf's top executives and license the start-up's technology, which was revealed on Friday. \n\nGoogle's deal appeared to leave Windsurf in a difficult position as a stand-alone start-up. OpenAI, the maker of the ChatGPT chatbot, had also been in talks to buy Windsurf before the Google deal. \"We've long admired the Windsurf team and what they've built,\" said Scott Wu, a co-founder of Cognition, in an email to employees viewed by The New York Times. \"Within our lifetime, engineers will go from bricklayers to architects, focusing on the creativity of designing systems rather than the manual labor of putting them together.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http",
        "id": 3164024,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/14/1820248/cognition-ai-buys-windsurf-as-ai-frenzy-escalates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cognition AI Buys Windsurf as AI Frenzy Escalates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T19:14:39.667360+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T18:10:00+00:00",
        "description": "Air India's chief executive urged staff to avoid drawing premature conclusions about what caused one of the airline's Boeing triangle jets to crash last month, after a preliminary investigation ruled out mechanical or maintenance issues, turning attention to the pilots' actions. WSJ: Campbell Wilson told staff that the probe into the crash was \"far from over,\" according to an internal memo, reviewed by The Wall Street Journal, in which he set out some of the findings of a report issued by India's Aircraft Accident Investigation Bureau at the end of last week. \n\nWilson's memo didn't mention one of the AAIB's findings: that the airplane's fuel-control switches had been turned off one by one, seconds after takeoff, starving both engines of fuel. The switches, which sit between the two seats in the cockpit, were turned back on about 10 seconds later, but the engines apparently couldn't fully restart and gain thrust fast enough, the report said. \n\nThe crash of the London-bound Boeing 787 D",
        "id": 3164025,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/14/187209/air-india-chief-says-preliminary-crash-report-raises-fresh-questions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Air India Chief Says Preliminary Crash Report Raises Fresh Questions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T18:08:57.372248+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T17:36:00+00:00",
        "description": "A scientific paper featuring an AI-generated image of a rat with an oversized penis was retracted three days after publication, highlighting broader problems plaguing academic publishing as researchers struggle with an explosion of scientific literature. The paper appeared in Frontiers in Cell and Developmental Biology before widespread mockery forced its withdrawal. \n\nResearch studies indexed on Clarivate's Web of Science database increased 48% between 2015 and 2024, rising from 1.71 million to 2.53 million papers. Nobel laureate Venki Ramakrishnan called the publishing system \"broken and unsustainable,\" while University of Exeter researcher Mark Hanson described scientists as \"increasingly overwhelmed\" by the volume of articles. The Royal Society plans to release a major review of scientific publishing disruptions at summer's end, with former government chief scientist Mark Walport citing incentives that favor quantity over quality as a fundamental problem.<p><div class=\"share_submi",
        "id": 3163514,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/14/1736243/quality-of-scientific-papers-questioned-as-academics-overwhelmed-by-the-millions-published?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Quality of Scientific Papers Questioned as Academics 'Overwhelmed' By the Millions Published",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T17:04:44.175043+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T16:45:00+00:00",
        "description": "Google will merge ChromeOS and Android into a unified platform, according to Sameer Samat, President of Android Ecosystem at Google. \"We're going to be combining ChromeOS and Android into a single platform, and I am very interested in how people are using their laptops these days and what they're getting done,\" Samat said during a recent interview.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Plans+To+Combine+ChromeOS+and+Android+Into+Single+Platform%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F14%2F1617251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F14%2F1617251%2Fgoogle-plans-to-combine-chromeos-and-android-into-single-platform%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_",
        "id": 3162961,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/1617251/google-plans-to-combine-chromeos-and-android-into-single-platform?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Plans To Combine ChromeOS and Android Into Single Platform",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T17:04:44.373303+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T16:05:00+00:00",
        "description": "Mark Zuckerberg said on Monday that Meta would spend hundreds of billions of dollars to build several massive AI data centers for superintelligence, intensifying his pursuit of a technology that he has chased with a talent war for top AI engineers. From a report: The social media giant is among the large technology companies that have chased high-profile deals and doled out multi-million-dollar pay packages in recent months to fast-track work on machines that can outthink humans on most tasks. \n\nUnveiling the spending commitment in a Threads post on Monday, CEO Zuckerberg touted the strength in the company's core advertising business to support the massive spending that has raised concerns among tech investors about potential payoffs. \"We have the capital from our business to do this,\" Zuckerberg said. He also cited a report from a chip industry publication Semianalysis that said Meta is on track to be the first lab to bring online a 1-gigawatt-plus supercluster, which refers to a mas",
        "id": 3162962,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/165238/zuckerberg-pledges-hundreds-of-billions-for-ai-data-centers-in-superintelligence-push?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zuckerberg Pledges Hundreds of Billions For AI Data Centers in Superintelligence Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T15:59:39.749291+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T15:20:00+00:00",
        "description": "VPN provider BulletVPN has shut down its servers with immediate effect, leaving subscribers without service regardless of their subscription terms. The company announced the closure on its website, citing \"shifts in market demand, evolving technology requirements, and sustainability of operations.\" \n\nUsers with active subscriptions can receive a free six-month subscription to competitor Windscribe, \"along with discounted long-term plans.\" Windscribe clarified it has not acquired BulletVPN or assumed control of its operations, and no user data including email addresses or account information was shared between the companies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=BulletVPN+Shuts+Down%2C+Killing+Lifetime+Members'+Subscriptions%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F14%2F1420257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a clas",
        "id": 3162338,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/1420257/bulletvpn-shuts-down-killing-lifetime-members-subscriptions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "BulletVPN Shuts Down, Killing Lifetime Members' Subscriptions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T14:54:47.810023+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T14:40:00+00:00",
        "description": "Bay Area Michelin-starred restaurants are conducting extensive background research on diners before they arrive, mining social media profiles and maintaining detailed guest databases to personalize dining experiences. Lazy Bear maintains records on 115,000 people and employs a guest services coordinator who creates weekly reports by researching publicly available social media information. \n\nStaff study color-coded Google documents containing guest data before each service. SingleThread's reservation team researches social media, Google, and LinkedIn profiles for guests, where meals cost over $500 on weekends. General manager Akeel Shah told SFGate the information helps \"tailor the experience and make it memorable.\" Acquerello has collected guest data for 36 years, initially handwritten in books. Co-owner Giancarlo Paterlini said their director of operations reviews each reservation for dining history and wine preferences to customize service.<p><div class=\"share_submission\" style=\"pos",
        "id": 3161725,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/1413234/bay-area-restaurants-are-vetting-your-social-media-before-you-even-walk-in?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bay Area Restaurants Are Vetting Your Social Media Before You Even Walk In",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T14:54:48.015366+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T14:00:00+00:00",
        "description": "A Japanese government survey found 26.7% of people in Japan used generative AI during fiscal 2024, which ended in March. The figure tripled from the previous year but remained far behind China's 81.2% and the United States' 68.8%. \n\nPeople in their 20s led Japanese adoption at 44.7%, followed by those in their 40s and 30s. Among companies, 49.7% of Japanese firms planned to use generative AI, compared to more than 80% of companies in China and the US.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Japanese+AI+Adoption+Remains+Drastically+Below+Global+Leaders%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F07%2F14%2F1324237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F07%2F14%2F1324237%2Fjapanese-ai-adoption-remains-drastically-below-global-leaders%3Fu",
        "id": 3161726,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/14/1324237/japanese-ai-adoption-remains-drastically-below-global-leaders?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japanese AI Adoption Remains Drastically Below Global Leaders",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T11:36:54.207887+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T11:34:00+00:00",
        "description": "Researchers have created the world's first mRNA-based vaccine against a deadly, antibiotic-resistant bacterium &mdash; and they did it using the platform developed for COVID-19 vaccines. \n\nMedical Express publishes their announcement:\nThe vaccine developed by the team from the Institute for Biological Research and Tel Aviv University is an mRNA-based vaccine delivered via lipid nanoparticles, similar to the COVID-19 vaccine. However, mRNA vaccines are typically effective against viruses like COVID-19 &mdash; not against bacteria like the plague... In 2023, the researchers developed a unique method for producing the bacterial protein within a human cell in a way that prompts the immune system to recognize it as a genuine bacterial protein and thus learn to defend against it. \n\nThe researchers from Tel Aviv University and the Institute for Biological Research proved, for the first time, that it is possible to develop an effective mRNA vaccine against bacteria. They chose Yersinia pestis",
        "id": 3160173,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/14/0420225/covid-19-vaccines-mrna-technology-adapted-for-first-antibiotic-resistant-bacteria-vaccine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "COVID-19 Vaccine's mRNA Technology Adapted for First Antibiotic-Resistant Bacteria Vaccine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T08:57:58.038648+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T08:04:00+00:00",
        "description": "\"Steam quietly welcomed another indie game this week, but this one is distinctly different for a lot of reasons,\" writes Notebookcheck:\n\n Dogwalk, which debuted on July 11, is the kind of short, gentle experience that almost forces you to smile. Developed by Blender Studio, the game introduces players to a gorgeous winter landscape. You play as a cute, fluffy dog, with a small child in tow... \n\nWhat's particularly interesting here is that Dogwalk is more than just another charming indie project. It's Blender Studio's showcase for what's possible using fully open-source tools. The entire project &mdash; assets, animations, and code &mdash; is made with Blender and the popular Godot Game Engine. Unlike industry giants such as Unity or Unreal, Godot is completely open source, meaning it doesn't require developers to pay royalties or follow strict licensing agreements. This should make it great for small studios and independent creators, as it lowers the entry barrier to game creation. \n\n",
        "id": 3159303,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/07/14/0513223/blender-studio-releases-free-new-game-dogwalk-to-showcase-its-open-source-godot-game-engine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blender Studio Releases Free New Game 'Dogwalk' to Showcase Its Open Source Godot Game Engine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T05:42:55.298336+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T04:59:00+00:00",
        "description": "An anonymous reader shared this report from InfoWorld:\nTiobe CEO Paul Jansen says Ada, a system programming language whose initial development dates back to the late 1970s, could outlast similarly aged languages like Visual Basic, Perl, and Fortran in the language popularity race. \n\nIn comments on this month's Tiobe language popularity index, posted July 9, Jansen said the index has not seen much change among leading languages such as Python, C#, and Java over the past two years. But there is more movement among older languages such as Visual Basic, SQL, Fortran, Ada, Perl, and Delphi, said Jansen. Every time one of these languages is expected to stay in the top 10, it is replaced by another language, he said. Even more remarkably, newer languages have yet to rise above them. \"Where are Rust, Kotlin, Dart, and Julia? Apparently, established languages are hot.\" \n\"Which one will win? Honestly, this is very hard to tell,\" Jansen writes, \"but I would put my bets on Ada. With the ever-stro",
        "id": 3158503,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/07/14/0456224/ada-beats-sql-perl-and-fortan-for-10-spot-on-programming-language-popularity-index?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ada Beats SQL, Perl, and Fortan for #10 Spot on Programming Language Popularity Index",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T02:28:19.801598+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T01:34:00+00:00",
        "description": "Can carbon-reducing projects \"offset\" a company's emissions? \"The reality has been less encouraging,\" according to a Science magazine editorial by Cary Coglianese, a law/political science professor at University of Pennsylvania, and Cynthia Giles, a former senior advisor at the U.S. Environmental Protection Agency. In a new paper published Wednesday, they found that more than half of all currently-certified carbon auditors signed off on projects later found to be \"overclaiming\" carbon benefits. \nTheir conclusion? \"Criticism should be directed not at individual auditors as much as the structure of the system that fosters these outcomes.\"\n\nMost carbon offset projects that have been closely scrutinized &mdash; including projects for forest protection, renewable energy, and methane-reducing methods of rice cultivation &mdash; have greatly exaggerated their climate benefits. More than 80% of issued credits might not reflect real emission reductions. This has alarmed potential offset purcha",
        "id": 3157832,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/14/0058203/more-than-half-of-carbon-credit-auditors-have-signed-off-on-overclaimed-benefits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than Half of Carbon Credit Auditors Have Signed Off on 'Overclaimed' Benefits",
        "vote": 0
    }
]