[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T15:11:40.841129+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T15:01:37+00:00",
        "description": "A highly realistic, unerringly brutal tactical first-person shooter, that too with a good single-player component, is a tough call. Now try finding one inspired by one of the greatest of all time. the SWAT series, while standing out on its own.\n\nDespite these heavy expectations and a somewhat repetitive campaign, Void Interactive's Ready or Not surprisingly steps up. As the leader of D Platoon, players embark on a harrowing journey through various missions, from robberies and busts to shootouts in deadly cabins rigged with traps. The gunplay is realistic, the tactics feel sound, and the presentation, especially the environments, is gritty and real.\n\nSome iffy AI and a somewhat samey gameplay loop tend to bog things down, but thankfully, there's also co-op, where up to five players can team together for some chaotic fun. While Ready or Not won't revolutionize the genre, it does deserve some credit for going beyond simply paying tribute and delivering a worthwhile experience, even on co",
        "id": 3161791,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=uEYW91oCfQI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uEYW91oCfQI/hqdefault.jpg",
        "title": "Ready or Not PS5 Review - A MUST PLAY Shooter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T14:05:22.324937+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T13:02:00+00:00",
        "description": "It's a year of surprisingly potent smaller games, especially single-player games that deliver in unexpected ways. River End Games' Eriksholm: The Stolen Dream may or may not get lost in that shuffle, but it's still recommended for those seeking a solid stealth puzzler with some great dialogue and story-telling.\n\nFollowing Hanna, who embarks on a journey across the city of Eriksholm to find her brother, players engage in a fair bit of sneaking and bamboozling guards. Though it starts simply enough, the chapters expand with additional characters and mechanics, all presented with arresting art direction and incredible cinematics.\n\nThe performances are no slouch either, and though Eriksholm: The Stolen Dream is weighed down by the insta-fail nature of its stealth, the limited AI of some enemies, and the nature of its environmental interactivity, it still hits all the right notes for stealth fans. Maybe you'll learn the truth about the city (or not), but it's an endearing journey all the s",
        "id": 3161284,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=zgyCwl8whbA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zgyCwl8whbA/hqdefault.jpg",
        "title": "Eriksholm: The Stolen Dream Review - A Stellar Game With Decent Stealth Mechanics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-14T10:24:35.448705+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-14T09:30:35+00:00",
        "description": "Even our most hyped games have some tidbits about them we’re slightly apprehensive about. Some pre-launch concerns turn out to come true, while others languish away as forgotten worries. \n\nIn the case of Mafia: The Old Country, either of the two outcomes is probable. After all, many players got burned out from the repetitive open world tasks within Mafia 3, despite its grand ambitions to be the next blockbuster. \n\nThe new Mafia title, a prequel to the trilogy, aims to go back to the basics with a linear story-heavy experience. Join us in a discussion as we share 3 things we like and 3 we have concerns about with Mafia: The Old Country.",
        "id": 3159717,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=vjW5vIhBuoQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vjW5vIhBuoQ/hqdefault.jpg",
        "title": "Mafia: The Old Country - 3 Things That Look Amazing And 3 That Raise Concerns",
        "vote": 0
    }
]