[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-14T20:48:47.533709+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-14T20:00:37+00:00",
        "description": "The Precinct is the latest title from Fallen Tree Games, perhaps better known for American Fugitive. The latter embraced a Grand Theft Auto-style sandbox gameplay that channels the older titles, but this one is more about upholding the law as a police officer.\n\nThe mechanics are intriguing at the start as you can patrol Averno City and stop various crimes, reading out offenses to different perpetrators and charging them accordingly. You also get a decent amount of freedom to tackle emergent crimes, not to mention pursuing other activities on the map like racing, time trials, and more.\n\nUnfortunately, The Precinct is let down by numerous factors, like the cheesy dialogue and characterization, the awkward shooting, some performance issues, and the tedium of booking suspects. That's not to say there isn't some entertainment in all this, especially when careening down a street to arrest a fleeing suspect, but its fundamentals need more work.",
        "id": 2680932,
        "language": null,
        "link": "https://www.youtube.com/watch?v=nHg7uD8iA24",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nHg7uD8iA24/hqdefault.jpg",
        "title": "The Precinct Review - Is It As Good As The Old Grand Theft Auto Games?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-14T20:48:47.723862+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-14T20:00:02+00:00",
        "description": "Fighting Collection 2 includes some real heavy-hitter titles that fans have been wanting modern ports for a very long time now. A host of new features accompany these games, making them more approachable and fun. Like the first collection, each game has eight difficulty levels along with a bunch of different CRT filters. Unfortunately, players only get one save state for the entire collection, so choose your single-player game carefully. \n\nThe online multiplayer is just as good as it was for the previous collections, though the lack of crossplay is still felt here. The collection launches for a host of on May 16th.",
        "id": 2680933,
        "language": null,
        "link": "https://www.youtube.com/watch?v=38xVC8qd_A0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/38xVC8qd_A0/hqdefault.jpg",
        "title": "Capcom Fighting Collection 2 Review - A Fantastic Collection That Is A Must Play For Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-14T16:13:59.806167+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-14T15:30:11+00:00",
        "description": "Rockstar hasn’t gone back to Grand Theft Auto 4 in years, as the company often does with even some of its biggest and most high profile releases, but it looks like that could change soon. \n\nSimilar to what the company did with the original Red Dead Redemption not too long ago, recent rumors have claimed that a current gen console port of Grand Theft Auto 4 is also currently in the works- though if that is indeed the case, our hope is that it’ll be more than just a simple port, unlike the aforementioned Red Dead Redemption 1 re-release.",
        "id": 2678498,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Kejiw62302I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Kejiw62302I/hqdefault.jpg",
        "title": "GTA 4 Remastered Is Probably Coming Out Before GTA 6, Let's Hope It's More Than A Mere Port",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-14T14:03:43.582070+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-14T13:30:46+00:00",
        "description": "Tainted Grail Fall of Avalon takes the Elder Scrolls formula and refines it into a densely packed experience filled with variety. The setting is a dark fantasy take on Arthurian legend. The world feels more like something out of Dark Souls than The Witcher 3, though Tainted Grail does contain plenty of lighthearted humor as well.\n\nThe gameplay allows a variety of styles and build types. There’s even throwable items that give some crowd control strategy to the mix. Tainted Grail has been in early access since 2023 with fans praising its fun gameplay and varied content. This game is sure to scratch that specific open-world RPG itch when it fully launches on May 23rd 2025.",
        "id": 2677168,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sopp1wiQyFI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sopp1wiQyFI/hqdefault.jpg",
        "title": "Tainted Grail: The Fall of Avalon - 15 Things You Absolutely NEED TO KNOW Before You Buy",
        "vote": 0
    }
]