[
    {
        "age": null,
        "album": "",
        "author": "Nineteenth century videos. Back to life.",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T17:32:50.128380+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T16:01:11+00:00",
        "description": "This ten-minute American short film is one of the most significant motion pictures ever made, although few viewers know its name!\n\nLa Cucaracha is a landmark piece of cinema history: it was the first live-action film shot entirely using the revolutionary three-strip Technicolor process (Process No. 4). This new technology provided a full, natural color spectrum, making all previous color films look dull and primitive by comparison.\n\nA Technical Masterpiece Backed by Pioneer Pictures and costing an astronomical $65,000 (more than triple the cost of a typical short film), La Cucaracha was a high-stakes experiment designed to prove that the new, vibrant Technicolor was ready for feature films.\n\nThe film's overwhelming success convinced the major studios to adopt the process, ushering in the golden age of color movies, from The Wizard of Oz to Gone With the Wind.\n\nThe Plot: The movie is a lighthearted musical comedy set in a lively Mexican café. The action centers on the café's ambitious ",
        "id": 3851275,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=i0qjzdnehfQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 241,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC8abMPJmTPmsaSc7j-lwIhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i0qjzdnehfQ/hqdefault.jpg",
        "title": "(1934) (4K,60fps) The Birth of Color in Hollywood: \"La Cucaracha\"",
        "vote": 0
    }
]