[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T23:12:13.617096+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T21:50:00+00:00",
        "description": "Cory Doctorow has always warned that companies \"enshittify\" their services &mdash; shifting \"as much as they can from users, workers, suppliers, and business customers to themselves.\" But this week Doctorow writes in Communications of the ACM that enshittification \"would be much, much worse if not for tech workers,\" who have \"the power to tell their bosses to go to hell...\"\n\nWhen your skills are in such high demand that you can quit your job, walk across the street, and get a better one later that same day, your boss has a real incentive to make you feel like you are their social equal, empowered to say and do whatever feels technically right... The per-worker revenue for successful tech companies is unfathomable &mdash; tens or even hundreds of times their wages and stock compensation packages. \n\n\n\"No wonder tech bosses are so excited about AI coding tools,\" Doctorow adds, \"which promise to turn skilled programmers from creative problem-solvers to mere code reviewers for AI as it pro",
        "id": 3852984,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/19/2146235/to-fight-business-enshittification-cory-doctorow-urges-tech-workers-join-unions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "To Fight Business 'Enshittification', Cory Doctorow Urges Tech Workers: Join Unions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T21:50:01.251946+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T20:19:00+00:00",
        "description": "Slashdot reader BrianFagioli writes: GIMP has officially launched its own Snap package for Linux, finally taking over from the community-maintained Snapcrafters project. The move means all future GIMP releases will now be built directly from the team's CI pipeline, ensuring faster, more consistent updates across distributions. The developers also introduced a new \"gimp-plugins\" interface to support external plugins while maintaining Snap's security confinement, with GMIC and OpenVINO already supported. This marks another major step in GIMP's cross-platform packaging efforts, joining Flatpak and MSIX distribution options. The first officially maintained version, Version 3.0.6GIMP 3.0.6, is available now on the \"latest/stable\" Snap channel, with preview builds rolling out for testers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=GIMP+Now+Offers+an+Official+Snap+Package+For+Linux+Users%3A+https%3A%2F%2Ftech.slashdot.",
        "id": 3852342,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/19/1954240/gimp-now-offers-an-official-snap-package-for-linux-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GIMP Now Offers an Official Snap Package For Linux Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T21:50:01.367508+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T19:19:00+00:00",
        "description": "\"This is an attempt to stop Waymo cars from driving into the dead end,\" complains a home-made sign in San Francisco, \"where they are forced to reverse and adversely affect the lives of the residents.\" \n\n\nOn an orange traffic post, the home-made sign declares \"NO WAYMO - 8:00 p.m. to 8:00 a.m,\" with an explanation for the rest of the neighborhood. &#226;oeWaymo comes at all hours of the night and up to 7 times per hour with flashing lights and screaming reverse sounds, waking people up and destroying the quality of life.&#226; \n\n\nSFGate reports that 1,400 people on Reddit upvoted a photo of the sign's text:\n\n\nIt delves into the bureaucratic mess &#226;\" multiple requests to Waymo, conversations with engineers, and 311 [municipal services] tickets, which had all apparently gone ignored &#226;\" before finally providing instructions for human drivers. &#226;oePlease move [the cones] back after you have entered so we can continue to try to block the Waymo cars from entering and disrupting ",
        "id": 3852343,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/19/1914248/desperate-to-stop-waymos-dead-end-detours-a-san-francisco-resident-tried-an-orange-cone-with-a-sign",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Desperate to Stop Waymo's Dead-End Detours, a San Francisco Resident Tried an Orange Cone with a Sign",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T21:50:01.453144+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T17:53:00+00:00",
        "description": "An anonymous reader shared this report from Cryptonews:\n\n\n\nSony has taken Wall Street by surprise after its banking division, Sony Bank, filed an application with the U.S. Office of the Comptroller of the Currency (OCC) to establish a national crypto bank under its subsidiary \"Connectia Trust.\" The move positions the Japanese tech giant to become one of the first major global corporations to issue a U.S. dollar-backed stablecoin through a federally regulated institution. The application outlines plans to issue a U.S. dollar-pegged stablecoin, maintain the reserve assets backing it, and provide digital asset custody and management services. \n\n\nThe filing places Sony alongside an elite list of firms, including Coinbase, Circle, Paxos, Stripe, and Ripple, currently awaiting OCC approval to operate as national digital banks. If approved, Sony would become the first major global technology company to receive a U.S. bank charter specifically tied to stablecoin issuance....\n \nThe Office of t",
        "id": 3852344,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/19/1749212/sony-applies-to-establish-national-crypto-bank-issue-stablecoin-for-us-dollar",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sony Applies to Establish National Crypto Bank, Issue Stablecoin for US Dollar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T21:50:01.523934+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T16:34:00+00:00",
        "description": "\"Eleven days ago, the nonprofit entity that develops the protocol, Signal Messenger LLC, published a 5,900-word write-up describing its latest updates that bring Signal a significant step toward being fully quantum-resistant,\" writes Ars Technica:\n\n\n\n\n\nThe mechanism that has made this constant key evolution possible over the past decade is what protocol developers call a \"double ratchet.\" Just as a traditional ratchet allows a gear to rotate in one direction but not in the other, the Signal ratchets allow messaging parties to create new keys based on a combination of preceding and newly agreed-upon secrets. The ratchets work in a single direction, the sending and receiving of future messages. Even if an adversary compromises a newly created secret, messages encrypted using older secrets can't be decrypted... [Signal developers describe a \"ping-pong\" behavior as parties take turns replacing ratchet key pairs one at a time.] Even though the ping-ponging keys are vulnerable to future qua",
        "id": 3852345,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/19/0546205/why-signals-post-quantum-makeover-is-an-amazing-engineering-achievement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Signal's Post-Quantum Makeover Is An Amazing Engineering Achievement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T16:04:11.949713+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T15:34:00+00:00",
        "description": "Long-time Slashdot reader Bruce66423 shared this article from the Los Angeles Times:\n\nScientists have increasingly observed how the rupturing of a fault during an earthquake can be even faster than the speed of another type of damaging seismic wave, theoretically generating energy on the level of a sonic boom. These shock waves &mdash; created during \"supershear\" earthquakes &mdash; can worsen how bad the ground shakes both side to side and up and down along an affected fault area, scientists at USC, Caltech and the University of Illinois Urbana-Champaign wrote in a recent opinion article for the journal Seismological Research Letters. Although not everyone agrees that supershear earthquakes are inherently more destructive than other types, the potential implications are massive and need to be accounted for in seismic forecasts, the scientists contend... In just the last 15 years, 14 of 39 large strike-slip earthquakes have exhibited features of supershear ruptures, the opinion articl",
        "id": 3850845,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/19/0439258/are-supershear-earthquakes-even-more-dangerous-than-we-thought",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Supershear Earthquakes Even More Dangerous Than We Thought?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T16:04:12.037226+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T14:34:00+00:00",
        "description": "\"Microsoft does everything in its power to keep Windows users under its control,\" warns the Free Software Foundation in a new blog post this week. \n\nThey argue that the lack of freedom that comes with proprietary code \"forces users to surrender to decisions made by Microsoft to maximize its profits and further lock users into its product ecosystem\" &mdash; describing both the problem and one possible solution:\n\n\n\n[IT management company Lansweeper] found that of the 30 million enterprise systems they manage, over 40% are incompatible with Windows 11. This is due to the hardware requirements like Treacherous Platform Module version 2.0 &mdash; a proprietary chip that uses cryptography that users can't influence or audit to restrict their control over the system. \nThe end of Windows 10 support is the perfect opportunity to break free from this cycle and switch to GNU/Linux operating system (GNU/Linux OS), a system that respects your freedom... \n\nThe endless, freedom-restricting cycle of ",
        "id": 3850846,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/18/036200/fsf-reminds-consumers-that-truly-free-oss-exist",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FSF Reminds Consumers That Truly Free OS's Exist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T14:08:03.819669+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T11:34:00+00:00",
        "description": "Microsoft said in a blog post this week that \"over half of cyberattacks with known motives were driven by extortion or ransomware... while attacks focused solely on espionage made up just 4%.\" \n\nAnd Microsoft's annual digital threats report found operations expanding even more through AI, with cybercriminals \"accelerating malware development and creating more realistic synthetic content, enhancing the efficiency of activities such as phishing and ransomware attacks.\"\n\n[L]egacy security measures are no longer enough; we need modern defenses leveraging AI and strong collaboration across industries and governments to keep pace with the threat... \n\n\nOver the past year, both attackers and defenders harnessed the power of generative AI. Threat actors are using AI to boost their attacks by automating phishing, scaling social engineering, creating synthetic media, finding vulnerabilities faster, and creating malware that can adapt itself... For defenders, AI is also proving to be a valuable t",
        "id": 3850111,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/19/0238212/extortion-and-ransomware-drive-over-half-of-cyberattacks-sometimes-using-ai-microsoft-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Extortion and Ransomware Drive Over Half of Cyberattacks &mdash; Sometimes Using AI, Microsoft Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T10:51:18.603391+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T07:34:00+00:00",
        "description": "The Guardian reports that atmospheric carbon dioxide \"soared by a record amount in 2024 to hit another high, UN data shows.\" \nBut what's more troubling is why:\n\nSeveral factors contributed to the leap in CO2, including another year of unrelenting fossil fuel burning despite a pledge by the world's countries in 2023 to \"transition away\" from coal, oil and gas. Another factor was an upsurge in wildfires in conditions made hotter and drier by global heating. Wildfire emissions in the Americas reached historic levels in 2024, which was the hottest year yet recorded. However, scientists are concerned about a third factor: the possibility that the planet's carbon sinks are beginning to fail. About half of all CO2 emissions every year are taken back out of the atmosphere by being dissolved in the ocean or being sucked up by growing trees and plants. But the oceans are getting hotter and can therefore absorb less CO2 while on land hotter and drier conditions and more wildfires mean less plant",
        "id": 3849197,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/19/040239/new-data-shows-record-co2-levels-in-2024-are-carbon-sinks-failing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Data Shows Record CO2 Levels in 2024. Are Carbon Sinks Failing?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T04:29:23.745203+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T03:34:00+00:00",
        "description": "An anonymous reader shared this report from Gizmodo:\n\n\nIt's been over a year since OpenAI cofounder Andrej Karpathy exited the company. In the time since he's been gone, he coined and popularized the term \"vibe coding\" to describe the practice of farming out coding projects to AI tools. But earlier this week, when he released his own open source model called nanochat, he admitted that he wrote the whole thing by hand, vibes be damned. \nNanochat, according to Karpathy, is a \"minimal, from scratch, full-stack training/inference pipeline\" that is designed to let anyone build a large language model with a ChatGPT-style chatbot interface in a matter of hours and for as little as $100. Karpathy said the project contains about 8,000 lines of \"quite clean code,\" which he wrote by hand &mdash; not necessarily by choice, but because he found AI tools couldn't do what he needed. \n\"It's basically entirely hand-written (with tab autocomplete),\" he wrote. \"I tried to use claude/codex agents a few t",
        "id": 3848111,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/19/0022237/openai-cofounder-builds-new-open-source-llm-nanochat---and-doesnt-use-vibe-coding",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Cofounder Builds New Open Source LLM 'Nanochat' - and Doesn't Use Vibe Coding",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T01:38:59.989931+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T01:34:00+00:00",
        "description": "Repair Plan Underway to Restore Power at Ukrainian Nuclear Plant\n\n\nThe Associated Press reports:\n\n\n\nWork has begun to repair the damaged power supply to Ukraine's Zaporizhzhia nuclear power plant, the head of the U.N.'s nuclear watchdog said Saturday. The repairs are hoped to end a precarious four-week outage that saw it dependent on backup generators. \n\nRussian and Ukrainian forces established special ceasefire zones for repairs to be safely carried out, said the head of the International Atomic Energy Agency, Rafael Grossi... \"Both sides engaged constructively with the IAEA to enable the complex repair plan to proceed,\" Grossi said in a statement...\n \nThe Zaporizhzhia plant, Europe's largest nuclear power station, has been operating on diesel back-up generators since Sept. 23 when its last remaining external power line was severed in attacks that Russia and Ukraine each blamed on the other. The plant is in an area under Russian control since early in Moscow's full-scale invasion of ",
        "id": 3847687,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/19/0052247/repair-plan-underway-to-restore-power-at-ukrainian-nuclear-plant",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Repair Plan Underway to Restore Power at Ukrainian Nuclear Plant",
        "vote": 0
    }
]