[
    {
        "age": null,
        "album": "",
        "author": "Today I Found Out",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-19T17:39:26.891956+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-19T17:04:57+00:00",
        "description": "The eyes, they say, are the windows to the soul. More practically, they are our windows to the world, humans being one of many visually-dependent species on the planet. But they are also fragile windows, susceptible to all sorts of injuries, diseases, and disorders. Worldwide, over 2 billion people - nearly a third of the world’s population - suffer from some sort of visual impairment, ranging from mild glaucoma and cataracts to complete blindness. Of these, 88.4 million suffer from mild, easily correctable refractive errors such as nearsightedness, farsightedness, and astigmatism. For much of history, the only solution to such impairments was corrective lenses, but more recent years have seen the rise of advanced surgical corrective technology such as LASIK. Thanks to such safe, quick, and relatively painless and inexpensive procedures, thousands of people are able to enjoy perfect vision without the hassle of glasses or contact lenses. But no technology appears fully-formed overnigh",
        "id": 3851311,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pQL11xVOnaE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 862,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC64UiPJwM_e9AqAd7RiD7JA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pQL11xVOnaE/hqdefault.jpg",
        "title": "The Crazy Carnival Ride Soviet Turntable Procedure That Gave Us the First Corrective Eye Surgery",
        "vote": 0
    }
]