[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-08T20:57:35.993743+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-08T20:30:04+00:00",
        "description": "The Battlefield 6 open beta is officially live on consoles and PC, at least for those with early access, which thankfully isn't too hard to obtain. It only offers four modes and three maps alongside tutorials, and major elements like Portal and the new Escalation are not present. Nevertheless, the beta is already a massive success with nearly 335,000 peak concurrent players on Steam alone, the highest for the franchise ever on the platform. But is it fun?\n\nThe short version is that yes, the beta can be fun and paints a positive picture for launch. However, it's easy to see why Battlefield Labs has been such a significant part in development and why the open beta is happening two months ahead of launch. Several areas still use improvements beyond balance changes and bug fixes. Without further ado, here are our impressions of the open beta with three things we liked and three that we didn't.",
        "id": 3286589,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=N-ozxrhk_Rg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N-ozxrhk_Rg/hqdefault.jpg",
        "title": "Battlefield 6 - 3 Things We Liked, 3 Things We Didn't So Far",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-08T14:27:37.331653+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-08T13:30:55+00:00",
        "description": "Remember when 2K released those Definitive Editions for Mafia 2 and 3, and many bemoaned the absolute state of the franchise? It even got a few people wondering what Mafia even was, such is the gap between releases. Mafia: Definitive Edition redeemed things somewhat, but the urge for a brand new entry has been burning ever since.\n\nA straightforward sequel wouldn't have been enough, and thankfully, Hangar 13 realized this early. Mafia: The Old Country is a prequel, but more importantly, it's a title that understands why the first game works so well. Offering a new protagonist and opting for a more rural approach compared to its predecessors' big cities, this is an ideal entry point for newcomers while catering to long-time fans, especially with its price.\n\nHowever, and most importantly, Mafia: The Old Country is a very good game with a compelling narrative, excellent layered characters, and some fun gameplay. Sure, it's not the most innovative (even if many of its additions are welcome",
        "id": 3283506,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=px9bsDiFF3g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/px9bsDiFF3g/hqdefault.jpg",
        "title": "This Is How Mafia: The Old Country Nails The Series’ Comeback",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-08T07:57:48.490019+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-08T07:30:18+00:00",
        "description": "Senua's Saga: Hellblade 2 Enhanced Edition has many things going in its favor. It brings the epic conclusion to Senua's journey to redemption to the PS5 alongside a host of additions and improvements that elevate the experience it originally offered back in 2024. \nThrow in its incredible visual presentation and the efforts of a very talented cast of actors and you got yourself a recipe for success. However, its gameplay is simply drab, making engaging with its combat and puzzles only necessary in order to see more of the world and progress the main narrative. All in all, it's quite a solid experience that runs the risk of being forgettable once its players roll the credits on its gritty story.\n\nNote: A copy of this game was provided by the PR representing this game.",
        "id": 3281009,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=WW2L3sbEQRE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WW2L3sbEQRE/hqdefault.jpg",
        "title": "Senua's Saga: Hellblade 2 Enhanced PS5 Review - The Final Verdict",
        "vote": 0
    }
]