[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T21:04:29.307299+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T20:30:00+00:00",
        "description": "Back when it first came out earlier this year, Tainted Grail: The Fall of Avalon was quite positively received despite its technical issues at the time thanks to its generally fun action RPG gameplay, interesting world, and cool background lore.\n\nWith the release of the Sanctuary of Sarras DLC, developer Questline hopes to double down on these aspects by giving us even more of what we loved from the original. Generally speaking, the main drawback of the DLC is the fact that the new loot you can find is fairly underwhelming, since it gives you little more than stat bonuses. \n\nAside from this, and the new map being quite a bit smaller than what we got from the base game, Sanctuary of Sarras is an incredibly interesting DLC thanks to the fact that it does quite a bit to further flesh out the mythology behind the world of Tainted Grail: The Fall of Avalon by giving us a deeper look into the characters and motivations of Arthur, Merlin, and Nimue.",
        "id": 4337624,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=WHlmclZEAT4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WHlmclZEAT4/hqdefault.jpg",
        "title": "Tainted Grail: The Fall of Avalon - Sanctuary of Sarras DLC Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T16:32:39.333790+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T16:00:45+00:00",
        "description": "The year is finally nearing its end, it really has been a long one, full of notable events. Long-awaited sequels finally launched after years of delays; titles thought to be in development hell emerged at last; earth-shattering announcements garnered millions of views; and even a brand-new console launched.\n\nMost importantly, it was a year of fantastic quality. From triple-A productions to indies, the sheer number of great games almost felt like an embarrassment of riches. The question, as always, remains: Which were the very best games? Which reigns on top? What is our choice for Game of the Year 2025?",
        "id": 4335141,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=RUuDrimiNyI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RUuDrimiNyI/hqdefault.jpg",
        "title": "Top 25 BEST Games of 2025 - Including Our Game of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T11:07:16.676609+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T10:01:29+00:00",
        "description": "Remember when the year started and we were all bright-eyed, optimistic and hopeful? There were concerns over just how packed 2025 could be, but with three great releases in January alone, it seemed like things would work out. Of course, then the unreasonable, the unthinkable, the inconceivable happened: Grand Theft Auto 6 got delayed to next year in May.\n\nOkay, so maybe it isn't that inconceivable, and the fact that Rockstar dropped a new trailer full of morsels on what to expect had us salivating. Surely the year would pass without further delays, and surely we would learn more as the months passed. Well, November arrived, and far from kicking off its marketing cycle, another delay was announced, this time to November 19th in 2026.",
        "id": 4332489,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ngSad-KWH2o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ngSad-KWH2o/hqdefault.jpg",
        "title": "Grand Theft Auto 6 -  At This Point, I’m Ready for a DELAY TO 2027",
        "vote": 0
    }
]