[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T23:43:22.075919+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T23:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Mark Carney says that amid a fundamental shift to the nature of globalization, his government will catalyze the growth in both the public and private sector. But Canadian linguists say that's a problem. Language experts have called out the Canadian prime minister's growing \"utilization\" of British spellings in key documents -- including the recent federal budget and a press release issued following a meeting with Donald Trump.\n \nCarney, who served as the governor of the bank of England for seven years, appears to have run afoul of Canadian linguistic norms, returning to his home country with a penchant for using 's' instead of 'z'- a hallmark of British spellings. In an open letter (PDF) chastising the prime minister, six linguists have asked his office, the Canadian government and parliament to stick to Canadian English spelling, \"which is the spelling they consistently used from the 1970s to 2025.\" They warned that if government",
        "id": 4338765,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/16/2159219/mark-carney-criticised-for-using-british-spellings-in-canadian-documents",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mark Carney Criticised For Using British Spellings In Canadian Documents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T23:43:22.330383+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T22:50:00+00:00",
        "description": "Intel has quietly stopped maintaining its open-source user-space driver stack for Gaudi accelerators. Phoronix reports: It turns out earlier this year Intel archived the SynapseAI Core open-source code and is no longer maintained by Intel. The open-source Synapse AI Core GitHub repository was archived in February and README updated with: \"This project will no longer be maintained by Intel. Intel has ceased development and contributions including, but not limited to, maintenance, bug fixes, new releases, or updates, to this project. Intel no longer accepts patches to this project. If you have an ongoing need to use this project, are interested in independently developing it, or would like to maintain patches for the open source software community, please create your own fork of this project.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel+Quietly+Discontinues+Its+Open-Source+User-Space+Gaudi+Driver+Code%3A+http",
        "id": 4338766,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/16/2153226/intel-quietly-discontinues-its-open-source-user-space-gaudi-driver-code",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Quietly Discontinues Its Open-Source User-Space Gaudi Driver Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T22:38:33.651908+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T22:10:00+00:00",
        "description": "A veteran games journalist claims Half-Life 3 is real and still planned as a Spring 2026 launch title tied to Valve's next Steam Machine push. Ars Technica reports: On the contrary, veteran journalist Mike Straw insisted on a recent Insider Gaming podcast that \"everybody I've talked to are still adamant [Half-Life 3] is a game that will be a launch title with the Steam Machine.\"\n \nStraw -- who has a long history of reporting gaming rumors from anonymous sources -- said this Half-Life 3 information is \"not [from] these run-of-the-mill sources that haven't gotten me information before. ... These aren't like random, one-off people.\" And those sources are \"still adamant that the game is coming in the spring,\" Straw added, noting that he was \"specifically told [that] spring 2026 [is the window] for the Steam Machine, for the Frame, for the Controller, [and] for Half-Life 3.\" [...]\n \nTiming specifics aside, Straw said his sources have him convinced that the long wait for Half-Life 3 is comi",
        "id": 4338322,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/16/2143202/reporter-suggests-half-life-3-will-be-a-steam-machine-launch-title",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reporter Suggests Half-Life 3 Will Be a Steam Machine Launch Title",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T22:38:33.732540+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: The last vehicle will roll off the assembly line at Volkswagen's plant in Dresden, Germany, on Tuesday, marking the first time in the automaker's 88-year history that it has closed a plant in its home country. Volkswagen warned of potential production cuts last year, as it faced shaky demand in Europe and China, its biggest market, as well as higher tariffs that have crimped sales in the United States.\n \nAfter 24 years of vehicle production, the Dresden plant will be converted into a research hub focused on technologies like artificial intelligence, robotics and chip design. Volkswagen will team up with the government of the state of Saxony and the Dresden University of Technology on the project at the plant, known as the Transparent Factory because of its glass walls. \"We did not take the decision to end vehicle production at the Transparent Factory after more than 20 years lightly,\" Thomas Schafer, chief executive of the V",
        "id": 4338323,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/16/2135226/volkswagen-to-end-production-at-german-plant-a-first-in-company-history",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Volkswagen To End Production At German Plant, a First In Company History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T21:35:15.663601+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T20:50:00+00:00",
        "description": "Utah Gov. Spencer Cox signed two bills this year that ended solar development tax credits and imposed a new tax on solar generation despite solar power accounting for two-thirds of the new projects waiting to connect to the state's power grid. The legislation passed by the Republican-controlled Legislature has already had an impact. \n\nSince May, when the laws took effect, 51 planned solar projects withdrew their applications to connect to the grid. That represents more than a quarter of all projects in Utah's transmission connection queue. The moves came as Cox promoted Operation Gigawatt, an initiative to double the state's energy production in the next decade through what he called an \"any of the above\" approach. \n\nA third bill aimed at limiting solar development on farmland narrowly missed the deadline for passage but is expected to return next year. Rocky Mountain Power earlier this year asked regulators to approve a 30% electricity rate hike. Regulators eventually awarded a 4.7% ",
        "id": 4337887,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/16/1959202/utah-leaders-hinder-efforts-to-develop-solar-energy-supply",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Utah Leaders Hinder Efforts To Develop Solar Energy Supply",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T20:26:25.291056+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T20:10:00+00:00",
        "description": "The new chief of Britain's Secret Intelligence Service told officers this week that they must become as fluent in programming languages like Python as they are in foreign languages like Russian as the spy agency adapts to what she described as a space between peace and war. Blaise Metreweli, MI6's first female chief and previously the service's director general of technology and innovation, said in her first public speech that mastery of technology is now required across the organization. \n\nShe warned that advanced technologies including AI, biotechnology and quantum computing are revolutionizing both economies and the reality of conflict. Metreweli focused particularly on threats from Russia, saying the country is testing the UK in the grey zone through cyberattacks on critical infrastructure, drones near sensitive sites and propaganda operations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=MI6+Chief%3A+We'll+Be",
        "id": 4337378,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/16/1949244/mi6-chief-well-be-as-fluent-in-python-as-we-are-in-russian",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MI6 Chief: We'll Be as Fluent in Python As We Are in Russian",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T20:26:25.493919+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T19:30:00+00:00",
        "description": "The weight of AI server racks has reached a point where legacy data centers cannot accommodate them even with significant retrofitting efforts, The Verge reports. Chris Brown, chief technical officer at Uptime Institute, said most retrofitting attempts would require \"bulldozing the building and starting over from scratch.\" \n\nAI racks are projected to reach 5,000 pounds compared to the 400 to 600 pounds that racks weighed three decades ago. The dramatic increase stems from hundreds to 1,000 GPUs packed densely into each rack alongside memory chips and liquid cooling systems that can add substantial weight. AI workloads now consume up to 350 kilowatts per rack, 35 times the 10 kilowatts that traditional computer chip workloads averaged a decade ago. Legacy data centers with raised floors typically max out at around 1,250 pounds per square foot for static loads. \n\nChris McLean, president of Critical Facility Group, said that rack heights have grown from 6 feet to 9 feet over nearly two d",
        "id": 4337379,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/16/198220/racks-of-ai-chips-are-too-damn-heavy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Racks of AI Chips Are Too Damn Heavy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T19:17:31.348287+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T18:50:00+00:00",
        "description": "U.S. officials excoriated the European Union for discriminating against American technology companies and threatened to penalize European tech companies in return, in a social media post on Tuesday. From a report: The pronouncement appeared to signal a rockier period for U.S.-E.U. trade relations, as the two governments work to finalize a trade framework they announced this year. The United States has been pushing Europe to open up its tech sector to American firms. But U.S. officials have complained that the European Union has not walked back broader regulation of company business practices while also proceeding with investigations of major American tech firms like Google, X, Amazon and Meta. \n\nIn a social media post, the Office of the United States Trade Representative, which has carried out the negotiations, said that the European Union and some member states had \"persisted in a continuing course of discriminatory and harassing lawsuits, taxes, fines and directives\" against America",
        "id": 4336730,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/16/1850216/us-threatens-penalties-against-european-tech-firms-amid-regulatory-fight",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Threatens Penalties Against European Tech Firms Amid Regulatory Fight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T18:11:11.243779+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T18:02:00+00:00",
        "description": "mprindle writes: The Texas Attorney General sued five major television manufacturers, accusing them of illegally collecting their users' data by secretly recording what they watch using Automated Content Recognition (ACR) technology. \n\nThe lawsuits target Sony, Samsung, LG, and China-based companies Hisense and TCL Technology Group Corporation. Attorney General Ken Paxton's office also highlighted \"serious concerns\" about the two Chinese companies being required to follow China's National Security Law, which could give the Chinese government access to U.S. consumers' data. \n\nAccording to complaints filed this Monday in Texas state courts, the TV makers can allegedly use ACR technology to capture screenshots of television displays every 500 milliseconds, monitor the users' viewing activity in real time, and send this information back to the companies' servers without the users' knowledge or consent.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"h",
        "id": 4336147,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/16/1758248/texas-sues-tv-makers-for-taking-screenshots-of-what-people-watch",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Sues TV Makers For Taking Screenshots of What People Watch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T18:11:11.532808+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T17:27:00+00:00",
        "description": "McKinsey, the consulting giant that has spent a century advising companies on how to cut costs and restructure operations, is now turning that advice inward as it plans to eliminate thousands of jobs across its non-client-facing departments over the next 18 to 24 months. \n\nThe firm's leadership has discussed a roughly 10% headcount reduction in support functions, according to Bloomberg. McKinsey's revenue has hovered around $15 billion to $16 billion for the past five years after a decade of rapid expansion that saw employee count climb from 17,000 in 2012 to 45,000 by 2022. The headcount has since slid to about 40,000. \n\nThe cuts come as consulting firms face cost-conscious clients, Trump administration pressure on government consulting spending, and reduced payments from Saudi Arabia, which had been paying McKinsey at least $500 million annually in the decade up to 2024. McKinsey cut about 1,400 jobs in 2023 under a plan internally labeled Project Magnolia, and axed 200 global tech ",
        "id": 4336148,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/16/1727251/mckinsey-plots-thousands-of-job-cuts-in-slowdown-for-consulting-industry",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "McKinsey Plots Thousands of Job Cuts in Slowdown for Consulting Industry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T17:02:33.242660+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T16:40:00+00:00",
        "description": "A millisecond used to be a big deal for the world's quickest traders. A dispute over huge trading profits at one of the world's largest futures exchanges shows they now think a million times faster [non-paywalled source]. From a report: The controversy is about an arcane technical maneuver in which high-speed traders bombard Frankfurt-based Eurex with useless data. The idea is to keep their connections to the exchange warm so they can react fractionally faster to market-moving information. The battle is the latest chapter in a decadeslong contest among secretive ultrafast trading firms, which have pursued a relentless quest for minuscule speed advantages. \n\nA group of high-frequency trading firms has exploited the practice to rake in hundreds of millions of dollars, says Mosaic Finance, a French firm that has complained to Eurex and European regulators. \"An arms race is OK, but you must use legal weapons,\" said Hugues Morin, founder of Mosaic. Eurex says Mosaic's claims are baseless. ",
        "id": 4335469,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/16/1621254/high-speed-traders-are-feuding-over-a-way-to-save-32-billionths-of-a-second",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "High-Speed Traders Are Feuding Over a Way To Save 3.2 Billionths of a Second",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T17:02:33.567387+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T16:01:00+00:00",
        "description": "The glasses-shaped face computers that tech companies have been building for years now face an identity crisis, and their makers can't agree on what to call them. Meta has asked a journalist to refer to its Ray-Ban glasses as \"AI glasses\" to distinguish them from Google Glass. Google, whose Project Aura is a collaboration with Xreal, calls the product \"wired XR glasses\" because the company views it as more aligned with headsets in a glasses form factor. \n\nXreal's CEO Chi Xu laughed when asked about Aura's category and said the company will call all its products \"AR glasses.\" Research firms aren't aligned either. Gartner defines smart glasses as camera- and display-free devices with Bluetooth and AI. Counterpoint Research said smart glasses without see-through displays drive volumes in the smart eyewear category. IDC uses a broader definition that includes anything glasses-shaped.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/h",
        "id": 4335470,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/16/1548233/tech-giants-cant-agree-on-what-to-call-their-ai-powered-glasses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Giants Can't Agree On What To Call Their AI-Powered Glasses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T15:57:33.216173+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T15:22:00+00:00",
        "description": "The traditional signals that employers used to evaluate entry-level job candidates -- college GPAs, cover letters, and interview performance -- have lost much of their value as grade inflation and widespread AI use render these metrics nearly meaningless, writes The Atlantic. \n\nThe recent-graduate unemployment rate now sits slightly higher than the overall workforce's, a reversal from historical norms where new college graduates were more likely to be employed than the average worker. Job postings on Handshake, a career-services platform for students and recent graduates, have fallen by more than 16 percent in the past year. At Harvard, 60% of undergraduate grades are now A's, up from fewer than a quarter two decades ago. Seven years ago, 70% of new graduates' resumes were screened by GPA; that figure has dropped to 40%. \n\nTwo working papers examining Freelancer.com found that cover-letter quality once strongly predicted who would get hired and how well they would perform -- until Cha",
        "id": 4334797,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/16/1521248/the-entry-level-hiring-process-is-breaking-down",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Entry-Level Hiring Process Is Breaking Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T14:51:09.157536+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T14:40:00+00:00",
        "description": "Mozilla has named Anthony Enzor-DeMeo as its new chief executive, promoting the executive who has spent the past year leading the Firefox browser team and who now plans to make AI central to the company's future. \n\nEnzor-DeMeo announced on Tuesday that an \"AI Mode\" is coming to Firefox next year. The feature will let users choose from multiple AI models rather than being locked into a single provider. Some options will be open-source models, others will be private \"Mozilla-hosted cloud options,\" and the company also plans to integrate models from major AI companies. Mozilla itself will not train its own large language model. \n\n\"We're not incentivized to push one model or the other,\" Enzor-DeMeo told The Verge. Firefox currently has about 200 million monthly users, a fraction of Chrome's roughly 4 billion, though Enzor-DeMeo insists mobile usage is growing at a decent clip. \n\nHe takes over from interim CEO Laura Chambers, who led the company through a major antitrust case and what Mozi",
        "id": 4334229,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/16/1359204/mozillas-new-ceo-bets-firefoxs-future-on-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mozilla's New CEO Bets Firefox's Future on AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T14:51:09.352444+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T14:00:00+00:00",
        "description": "Google's data partner HouseCanary has begun displaying home listings directly in search results in select markets, sending Zillow's shares tumbling more than 8% yesterday as investors weighed whether the search giant might eventually cut into the portal business that Zillow dominates. \n\nThe experiment places property details, prices, images and a \"Request a tour\" button at the top of mobile search results. HouseCanary, a full-service brokerage licensed in all 50 states and Washington D.C., said it contacted every MLS in the test regions before launching. \n\nAnalysts are largely downplaying immediate concerns. Goldman Sachs noted that most of Zillow's traffic comes directly through its apps and websites rather than Google searches, though the firm views the development as a long-term risk. Piper Sandler called the fears \"overblown,\" and Wells Fargo suggested portals like Zillow would likely end up bidding for ad units on Google rather than losing traffic outright.<p><div class=\"share_su",
        "id": 4334230,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/16/0955240/googles-real-estate-listings-experiment-sends-zillow-shares-down-more-than-8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Real Estate Listings 'Experiment' Sends Zillow Shares Down More Than 8%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T13:47:24.164130+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: Audio streaming platform SoundCloud has confirmed that outages and VPN connection issues over the past few days were caused by a security breach in which threat actors stole a database containing user information. The disclosure follows widespread reports over the past four days from users who were unable to access SoundCloud when connecting via VPN, with attempts resulting in the site displaying 403 \"forbidden\" errors.\n \nIn a statement shared with BleepingComputer, SoundCloud said it recently detected unauthorized activity involving an ancillary service dashboard and activated its incident response procedures. SoundCloud acknowledged that a threat actor accessed some of its data but said the exposure was limited in scope. [...] BleepingComputer has learned that the breach affects 20% of SoundCloud's users, which, based on publicly reported user figures, could impact roughly 28 million accounts. The company said it is confiden",
        "id": 4333634,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/16/0351247/soundcloud-confirms-breach-after-member-data-stolen-vpn-access-disrupted",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SoundCloud Confirms Breach After Member Data Stolen, VPN Access Disrupted",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T10:33:44.000643+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T10:00:00+00:00",
        "description": "PayPal has applied to become a US bank by forming a Utah-chartered industrial loan company, signaling a push to deepen its financial services \"as companies rush to capitalize on a friendly regulatory environment under the Trump administration,\" reports Reuters. From the report: If approved, the move will help PayPal to strengthen its lending offerings to small businesses in the U.S. as well as reduce its reliance on third parties. \"Securing capital remains a significant hurdle for small businesses striving to grow and scale,\" said PayPal CEO Alex Chriss. \"Establishing PayPal Bank will strengthen our business and improve our efficiency, enabling us to better support small business growth and economic opportunities across the U.S.\"\n \nPayPal also plans to offer interest-bearing savings accounts to customers. The company has provided over $30 billion in loans and capital since 2013, it said. [...] PayPal has selected Mara McNeill to serve as PayPal Bank's president. She comes with over tw",
        "id": 4332271,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/16/0346229/paypal-applies-to-become-a-bank-as-us-loosens-regulatory-reins",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PayPal Applies To Become a Bank As US Loosens Regulatory Reins",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T07:15:06.673785+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T07:00:00+00:00",
        "description": "A new study warns that glaciers in the European Alps will hit their peak extinction rate within eight years, with global glacier loss accelerating toward thousands per year unless emissions are rapidly cut. \"Glaciers in the western US and Canada are forecast to reach their peak year of loss less than a decade later, with more than 800 disappearing each year by then,\" adds the Guardian. From the report: About 200,000 glaciers remain worldwide, with about 750 disappearing each year. However, the research indicates this pace will accelerate rapidly as emissions from burning fossil fuels continue to be released into the atmosphere. Current climate action plans from governments are forecast to push global temperatures to about 2.7C above preindustrial levels, supercharging extreme weather. Under this scenario, glacier losses would peak at about 3,000 a year in 2040 and plateau at that rate until 2060. By the end of the century, 80% of today's glaciers will have gone. By contrast, rapid cut",
        "id": 4331339,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/16/0335255/glaciers-to-reach-peak-rate-of-extinction-in-the-alps-in-eight-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Glaciers To Reach Peak Rate of Extinction In the Alps In Eight Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T15:57:33.512271+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Microsoft is killing off an obsolete and vulnerable encryption cipher that Windows has supported by default for 26 years following more than a decade of devastating hacks that exploited it and recently faced blistering criticism from a prominent US senator. When the software maker rolled out Active Directory in 2000, it made RC4 a sole means of securing the Windows component, which administrators use to configure and provision fellow administrator and user accounts inside large organizations. RC4, short for Rivist Cipher 4, is a nod to mathematician and cryptographer Ron Rivest of RSA Security, who developed the stream cipher in 1987. Within days of the trade-secret-protected algorithm being leaked in 1994, a researcher demonstrated a cryptographic attack that significantly weakened the security it had been believed to provide. Despite the known susceptibility, RC4 remained a staple in encryption protocols, including SSL and its s",
        "id": 4334798,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/15/2244255/microsoft-will-finally-kill-obsolete-cipher-that-has-wreaked-decades-of-havoc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Will Finally Kill Obsolete Cipher That Has Wreaked Decades of Havoc",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T04:04:32.536123+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Microsoft is killing off an obsolete and vulnerable encryption cipher that Windows has supported by default for 26 years following more than a decade of devastating hacks that exploited it and recently faced blistering criticism from a prominent US senator. When the software maker rolled out Active Directory in 2000, it made RC4 a sole means of securing the Windows component, which administrators use to configure and provision fellow administrator and user accounts inside large organizations. RC4, short for Rivist Cipher 4, is a nod to mathematician and cryptographer Ron Rivest of RSA Security, who developed the stream cipher in 1987. Within days of the trade-secret-protected algorithm being leaked in 1994, a researcher demonstrated a cryptographic attack that significantly weakened the security it had been believed to provide. Despite the known susceptibility, RC4 remained a staple in encryption protocols, including SSL and its s",
        "id": 4330534,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/15/2244255/microsoft-will-finally-kill-obsolete-cipher-that-has-wrecked-decades-of-havoc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Will Finally Kill Obsolete Cipher That Has Wrecked Decades of Havoc",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T01:59:50.000418+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T01:25:00+00:00",
        "description": "Once a star of the self-driving hype cycle, lidar maker Luminar has filed for bankruptcy amid legal turmoil, layoffs, and a cooling autonomous-vehicle market. It plans to sell off its assets before shutting down entirely. The Verge reports: As part of its bankruptcy, Luminar is seeking permission to sell both its lidar and semiconductor businesses, the latter of which it has already agreed to sell to Quantum Computing for $110 million. The company plans to continue to operate during the bankruptcy proceedings \"to minimize disruptions and maintain delivery of its LiDAR hardware and software.\" That said, Luminar will cease to exist once the process is complete. \"As we navigate this process, our top priority is to continue delivering the same quality, reliability and service our customers have come to expect from us,\" CEO Paul Ricci said in a statement.\n \nAfter launching in 2017, Luminar muscled its way to the front of the autonomous vehicle industry as a top maker of lidar systems, a ke",
        "id": 4330045,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/15/2238214/lidar-maker-luminar-files-for-bankruptcy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lidar-Maker Luminar Files For Bankruptcy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T00:56:05.681516+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T00:45:00+00:00",
        "description": "After introducing an AI Mode shortcut earlier this year, Google has now added a new \"plus\" menu to its Search homepage, highlighting options for image and file uploads. 9to5Google reports: On google.com, the Search bar now has a plus icon at the far left that replaces the magnifying glass. Clicking lets you \"Upload image\" or \"Upload file.\" It very much matches the AI Mode experience. Those two capabilities aren't new, but this plus menu does help emphasize that you can use Google to accomplish tasks, and not just find information. Additionally, it helps indicate that they can be used with AI Mode and AI Overviews. This is just available on desktop web (not mobile) and is live on all the devices we checked today, including across signed-out Incognito sessions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Search+Homepage+Adds+a+'Plus'+Menu%3A+https%3A%2F%2Fsearch.slashdot.org%2Fstory%2F25%2F12%2F15%2F2232246%",
        "id": 4329714,
        "language": "en-us",
        "link": "https://search.slashdot.org/story/25/12/15/2232246/google-search-homepage-adds-a-plus-menu",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Search Homepage Adds a 'Plus' Menu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-16T00:56:05.874289+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-16T00:02:00+00:00",
        "description": "A critical React vulnerability (CVE-2025-55182) is being actively exploited at scale by Chinese, Iranian, North Korean, and criminal groups to gain remote code execution, deploy backdoors, and mine crypto. The Register reports: React maintainers disclosed the critical bug on December 3, and exploitation began almost immediately. According to Amazon's threat intel team, Chinese government crews, including Earth Lamia and Jackpot Panda, started battering the security hole within hours of its disclosure. Palo Alto Networks' Unit 42 responders have put the victim count at more than 50 organizations across multiple sectors, with attackers from North Korea also abusing the flaw.\n \nGoogle, in a late Friday report, said at least five other suspected PRC spy groups also exploited React2Shell, along with criminals who deployed XMRig for illicit cryptocurrency mining, and \"Iran-nexus actors,\" although the report doesn't provide any additional details about who the Iran-linked groups are and what",
        "id": 4329715,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/15/2227217/china-iran-are-having-a-field-day-with-react2shell-google-warns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China, Iran Are Having a Field Day With React2Shell, Google Warns",
        "vote": 0
    }
]