[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T22:55:59.167701+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T22:40:00+00:00",
        "description": "Two Amazon Prime Air drones collided with a crane in Tolleson, Arizona near 96th Avenue and Roosevelt Street. Amazon confirmed the incident and is working with authorities to determine what happened, though no injuries have been reported. CNBC reports: The incident occurred on Wednesday around 1 p.m. EST in Tolleson, Arizona, a city west of Phoenix. Two MK30 drones crashed into the boom of a stationary construction crane that was in a commercial area just a few miles away from an Amazon warehouse. One person was evaluated on the scene for possible smoke inhalation, said Sergeant Erik Mendez of the Tolleson Police Department.\n \nBoth drones sustained \"substantial\" damage from the collision on Wednesday, which occurred when the aircraft were mid-route, according to preliminary FAA crash reports. The Federal Aviation Administration and National Transportation Safety Board are investigating the incident. The drones were believed to be flying northeast back-to-back when they collided with t",
        "id": 3722261,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/2054222/two-amazon-delivery-drones-crash-into-crane-in-arizona",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Two Amazon Delivery Drones Crash Into Crane In Arizona",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T22:55:59.251923+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: The operator of a popular pirate sports streaming site in Argentina has gone from spending time in jail with murderers to landing a new high-profile job a month later. Alejo \"Shishi\" Warles, the 25-year-old operator of Al Angulo TV, was arrested on August 20 in a LaLiga-backed crackdown. After his release on bail, he was hired by professional esports team 9z Globant, a partnership involving Argentine tech unicorn Globant. [...] The team is the result of a partnership between 9z Team and Argentinian tech unicorn Globant. Somewhat ironically, Globant previously worked with LaLiga to monitor the live-streaming user experience. Warles welcomed himself to 9z Globant via the team's social media account, referring to himself as an idol, genius, and GOAT.\n \nLucia Quinteros, the main social media manager at the esports team, informed Entre Rios that after considering their new hire's history, they believe that he can add value to the team.",
        "id": 3722262,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/02/2036202/sports-piracy-operator-goes-from-jail-to-getting-hired-by-a-tech-unicorn-in-a-month",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sports Piracy Operator Goes From Jail To Getting Hired By a Tech Unicorn In a Month",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T21:31:00.799532+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T21:22:00+00:00",
        "description": "The Hunga Tonga-Hunga Ha'apai volcano erupted on January 15, 2022. The pyroclastic flow severed both of Tonga's underwater internet cables. The eruption cut sixty-five miles from the domestic cable and fifty-five miles from the international link to Fiji. Tonga lost all internet access. The cables sit on the ocean floor and carry 95% of the world's international internet traffic. \n\nThe Guardian has a long read on what happened in the aftermath. A.T.M.s (cash machines) stopped working because banks could not verify account balances. Businesses could not file export paperwork. Foreign remittances made up 44% of the country's G.D.P. The government found old satellite phones. Three or four days later, officials restored a hundred and twenty megabytes per second of bandwidth for essential work. A month after the eruption, SpaceX donated fifty Starlink terminals. SubCom's repair ship Reliance took five weeks to restore the international cable. Vava'u did not get broadband back until August,",
        "id": 3721715,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/1917242/what-happened-when-a-pacific-island-was-cut-off-from-the-internet",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happened When a Pacific Island Was Cut Off From the Internet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T21:31:00.975547+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T20:41:00+00:00",
        "description": "AI has run out of training data, according to Neema Raphael, Goldman Sachs' chief data officer and head of data engineering. \"We've already run out of data,\" Raphael said on the bank's podcast. He said this shortage is already shaping how developers build new AI systems. China's DeepSeek may have kept costs down by training on outputs from existing models instead of fresh data. The web has been tapped out. \n\nDevelopers have been using synthetic data -- machine-generated material that offers unlimited supply but carries quality risks. Raphael said he doesn't think the lack of fresh data will be a massive constraint. \"From an enterprise perspective, I think there's still a lot of juice I'd say to be squeezed in that,\" he said. Proprietary datasets held by corporations could make AI tools far more valuable. The challenge is \"understanding the data, understanding the business context of the data, and then being able to normalize it.\"<p><div class=\"share_submission\" style=\"position:relativ",
        "id": 3721716,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/02/191224/ai-has-already-run-out-of-training-data-goldmans-data-chief-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Has Already Run Out of Training Data, Goldman's Data Chief Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T20:10:48.627201+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T20:01:00+00:00",
        "description": "An anonymous reader shares a report: Google said hackers are sending extortion emails to an unspecified number of executives, claiming to have stolen sensitive data from their Oracle business applications. In a statement, Google said a group claiming affiliation with the ransomware gang cl0p, opens new tab was sending emails to \"executives at numerous organizations claiming to have stolen sensitive data from their Oracle E-Business Suite.\" Google cautioned that it \"does not currently have sufficient evidence to definitively assess the veracity of these claims.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Says+Hackers+Are+Sending+Extortion+Emails+To+Executives%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F02%2F1812256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%",
        "id": 3721216,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/1812256/google-says-hackers-are-sending-extortion-emails-to-executives",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Says Hackers Are Sending Extortion Emails To Executives",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T20:10:48.717975+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T19:21:00+00:00",
        "description": "Walmart plans to deploy sensors across its 4,600 US stores by the end of 2026 to track 90 million pallets of groceries shipped annually [Editor's note: non-paywalled source]. The retailer and technology vendor Wiliot announced the expansion Thursday. The sensors will monitor the location, condition and temperature of perishables as they move from warehouses to stores. Walmart started testing Wiliot's sensors at a Texas warehouse in 2023 and has expanded to 500 locations. The full rollout will cover the retailer's US store network and 40 distribution centers. \n\nThe microchips measure 0.7 square millimeters and are embedded in shipping labels. They use Bluetooth to transmit real-time data about pallets. Walmart previously relied on manual scanning and paper checks by employees. The Arkansas-based company employs 2.1 million people but increased revenues by $150 billion over five years without adding workers. Walmart accounts for more than a fifth of US grocery sales.<p><div class=\"share",
        "id": 3721217,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/180240/walmart-to-deploy-sensors-to-track-90-million-grocery-pallets-by-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Walmart To Deploy Sensors To Track 90 Million Grocery Pallets by Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T20:10:48.849230+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T18:41:00+00:00",
        "description": "Top college degrees may no longer provide the edge they once did in the job market, per LinkedIn CEO Ryan Roslansky. \"I think the mindset shift is probably the most exciting thing because my guess is that the future of work belongs not anymore to the people that have the fanciest degrees or went to the best colleges, but to the people who are adaptable, forward thinking, ready to learn, and ready to embrace these tools,\" Roslansky said. \"It really kind of opens up the playing field in a way that I think we've never seen before.\" \n\nA 2024 Microsoft survey found 71% of business leaders would choose less-experienced candidates with AI skills over experienced candidates without them. LinkedIn data showed job postings requiring AI literacy increased about 70% year-over-year. Roslansky said AI will not replace humans but people who embrace AI will replace those who don't.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lin",
        "id": 3721218,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/02/179232/linkedin-ceo-says-fancy-degrees-will-matter-less-in-the-future-of-work",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linkedin CEO Says Fancy Degrees Will Matter Less in the Future of Work",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T18:37:30.324645+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T18:01:00+00:00",
        "description": "An anonymous reader shares a report: It's not the vibes; Earth is literally getting darker. Scientists have discovered that our planet has been reflecting less light in both hemispheres, with a more pronounced darkening in the Northern hemisphere, according to a study published on Monday in Proceedings of the National Academy of Sciences. \n\nThe new trend upends longstanding symmetry in the surface albedo, or reflectivity, of the Northern and Southern hemispheres. In other words, clouds circulate in a way that equalizes hemispheric differences, such as the uneven distribution of land, so that the albedos roughly match -- though nobody knows why. \"There are all kinds of things that people have noticed in observations and simulations that tend to suggest that you have this hemispheric symmetry as a kind of fundamental property of the climate system, but nobody's really come up with a theoretical framework or explanation for it,\" said Norman Loeb, a physical scientist at NASA's Langley Re",
        "id": 3720472,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/02/1659218/earth-is-getting-darker-literally-and-scientists-are-trying-to-find-out-why",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Earth Is Getting Darker, Literally, and Scientists Are Trying To Find Out Why",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T18:37:30.590974+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T17:21:00+00:00",
        "description": "Japan is just a few days away from running out of Asahi Super Dry as the producer of the nation's most popular beer wrestles with a devastating cyber attack that has shut down its domestic breweries. From a report: The vast majority of Asahi Group's 30 factories in Japan have not operated since Monday after the attack disabled its ordering and delivery system, the company said. Retailers are already expecting empty shelves as the outage stretches into its fourth day with no clear timeline for factories recommencing operations. Super Dry could also run out at izakaya pubs, which rely on draught and bottles. \n\nLawson, one of Japan's big convenience stores, said in a statement that it stocks many Asahi Group products and \"it is possible that some of these products may become increasingly out of stock from tomorrow onwards.\" \"This is having an impact on everyone,\" said an executive at another of Japan's major retailers. \"I think we will run out of products soon. When it comes to Super Dry",
        "id": 3720473,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/02/1559205/japan-is-running-out-of-its-favorite-beer-after-ransomware-attack",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan is Running Out of Its Favorite Beer After Ransomware Attack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T17:07:16.756406+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T16:40:00+00:00",
        "description": "Americans' confidence in the mass media has edged down to a new low, with just 28% expressing a \"great deal\" or \"fair amount\" of trust in newspapers, television and radio to report the news fully, accurately and fairly, according to Gallup. From the report: This is down from 31% last year and 40% five years ago. Meanwhile, seven in 10 U.S. adults now say they have \"not very much\" confidence (36%) or \"none at all\" (34%). When Gallup began measuring trust in the news media in the 1970s, between 68% and 72% of Americans expressed confidence in reporting. However, by the next reading in 1997, public confidence had fallen to 53%. Media trust remained just above 50% until it dropped to 44% in 2004, and it has not risen to the majority level since. The highest reading in the past decade was 45% in 2018, which came just two years after confidence had collapsed amid the divisive 2016 presidential campaign.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"ht",
        "id": 3719556,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/02/1612223/trust-in-media-at-new-low-of-28-in-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trust in Media at New Low of 28% in US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T17:07:16.845694+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T16:02:00+00:00",
        "description": "A hacking group claims to have pulled data from a GitLab instance connected to Red Hat's consulting business, scooping up 570 GB of compressed data from 28,000 customers. From a report: The hack was first reported by BleepingComputer and has been confirmed by Red Hat itself. \"Red Hat is aware of reports regarding a security incident related to our consulting business and we have initiated necessary remediation steps,\" Stephanie Wonderlick, Red Hat's VP of communications told 404 Media. \n\nA file released by the hackers and viewed by 404 Media suggested that the hacking group may have acquired some data related to about 800 clients, including Vodafone, T-Mobile, the US Navy's Naval Surface Warfare Center, the Federal Aviation Administration, Bank of America, AT&amp;T, the U.S. House of Representatives, and Walmart.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Red+Hat+Investigating+Breach+Impacting+as+Many+as+28%2C00",
        "id": 3719557,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/10/02/1538229/red-hat-investigating-breach-impacting-as-many-as-28000-customers-including-the-navy-and-congress",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Red Hat Investigating Breach Impacting as Many as 28,000 Customers, Including the Navy and Congress",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T15:33:50.899833+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T15:21:00+00:00",
        "description": "Tech companies are struggling to fill AI-specialized roles despite a surplus of available tech talent. U.S. colleges more than doubled the number of computer science degrees awarded between 2013 and 2022. Major layoffs at Google, Meta, and Amazon flooded the job market. The Bureau of Labor Statistics predicts businesses will employ 6% fewer computer programmers in 2034 than last year. The disconnect stems from companies seeking workers with specific AI expertise. \n\nRunway CEO Cristobal Valenzuela estimates only hundreds of people worldwide possess the skills to train complex AI models. His company advertises base salaries up to $490,000 for a director of machine learning. Daniel Park's startup Pickle offers up to $500,000 base salary and expects candidates willing to work seven days a week. The WSJ story includes the example of one James Strawn, who was laid off from Adobe over the summer after 25 years as a senior software quality-assurance engineer. The 55-year-old has had one inter",
        "id": 3718491,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/1044234/in-a-sea-of-tech-talent-companies-cant-find-the-workers-they-want",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In a Sea of Tech Talent, Companies Can't Find the Workers They Want",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T15:33:51.013282+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T14:40:00+00:00",
        "description": "More than 100,000 people were sent to hospitals due to heatstroke in Japan between May 1 and Sunday, according to preliminary data from the Fire and Disaster Management Agency. Bloomberg, via Japan Times: The number is the most on record, according to NHK. Transport to hospitals of patients linked to heatstroke over the period rose almost 3% to 100,143 from a year earlier as Japan saw its national temperature record broken twice in a matter of days. The country's average temperature during this summer was the highest since the statistic began being compiled in 1898, the nation's weather agency said last month. \n\nHeat waves around the world are being made stronger and more deadly due to human-caused climate change. Government officials in August pledged to boost public health protections and encouraged the installation of more air conditioners in school gymnasiums and the use of cooling centers in communal spaces like libraries. New rules came into effect this summer that require emplo",
        "id": 3718492,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/02/0811215/japan-saw-record-number-treated-for-heatstroke-in-hottest-ever-summer",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan Saw Record Number Treated For Heatstroke in Hottest-Ever Summer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T15:33:51.128228+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T14:00:00+00:00",
        "description": "Major health insurers are threatening to drop renowned cancer centers from their networks during contract negotiations, Memorial Sloan Kettering Cancer Center's president and CEO Selwyn M. Vickers and chairman Scott M. Stuart wrote in a story published by WSJ. Memorial Sloan Kettering Cancer Center reported that both Anthem Blue Cross Blue Shield and UnitedHealthcare prepared to terminate network agreements while patients underwent active cancer treatment. FTI Consulting found that 45% of 133 provider-payer disputes in 2024 failed to reach timely agreements. The disruptions have affected tens of thousands of patients. \n\nResearch published in the Journal of the National Cancer Institute found that care disruptions lead to more advanced-stage diagnoses and worse outcomes. Similar contract disputes involved Mayo Clinic, Johns Hopkins University and University of North Carolina Health. New York lawmakers introduced legislation this year requiring insurers to maintain coverage for cancer p",
        "id": 3718493,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/02/0751244/insurers-are-using-cancer-patients-as-leverage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Insurers Are Using Cancer Patients as Leverage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T15:33:51.221203+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T10:00:00+00:00",
        "description": "Google has laid off over 100 employees in design-related roles, including user experience research and cloud design teams, as part of broader cost-cutting measures to prioritize AI infrastructure. CNBC reports: Earlier this week, the company laid off employees within the cloud unit's \"quantitative user experience research\" teams and \"platform and service experience\" teams, as well as some adjacent teams, according to internal documents viewed by CNBC. The roles often focus on using data, surveys and other tools to understand and implement user behaviors that inform product development and design. Google has halved some of the cloud unit's design teams, and many of those affected are U.S.-based roles. Some employees have been given until early December to find a new role within the company.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Cuts+More+Than+100+Design-Related+Roles+In+Cloud+Unit%3A+https%3A%2F%2Ftec",
        "id": 3718494,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/036238/google-cuts-more-than-100-design-related-roles-in-cloud-unit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Cuts More Than 100 Design-Related Roles In Cloud Unit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T08:47:26.792552+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T07:00:00+00:00",
        "description": "Scientists have discovered complex organic molecules within the icy plume erupting from Saturn's moon Enceladus, strengthening the case that its hidden saltwater ocean may harbor the conditions for life. The Guardian reports: The sixth largest of Saturn's moons, Enceladus has become one of the leading contenders in the search for bodies that could harbor extraterrestrial life, with the Cassini mission -- which ended in 2017 -- revealing the moon has a plume of water ice grains and vapors erupting from beneath the surface at its south pole. The phenomenon has since been captured by the James Webb space telescope, with the plume reaching nearly 6,000 miles into space. The source of this material is thought to be a saltwater ocean that lies beneath the moon's icy crust.\n \nNow researchers studying data from the Cassini mission say they have discovered organic substances within the plume, with some types of molecule detected there for the first time. Dr Nozair Khawaja, a planetary scientis",
        "id": 3716289,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/02/0257214/prospect-of-life-on-saturns-moons-rises-after-discovery-of-organic-substances",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Prospect of Life On Saturn's Moons Rises After Discovery of Organic Substances",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T04:26:03.232600+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: Thinking Machines Lab,a heavily funded startup cofounded by prominent researchers fromOpenAI, has revealed its first product -- a tool called Tinker that automates the creation of custom frontier AI models. \"We believe [Tinker] will help empower researchers and developers to experiment with models and will make frontier capabilities much more accessible to all people,\" said Mira Murati, cofounder and CEO of Thinking Machines, in an interview with WIRED ahead of the announcement.\n \nBig companies and academic labs already fine-tune open source AI models to create new variants that are optimized for specific tasks, like solving math problems, drafting legal agreements, or answering medical questions. Typically, this work involves acquiring and managing clusters of GPUs and using various software tools to ensure that large-scale training runs are stable and efficient. Tinker promises to allow more businesses, researchers, and even hobbyists ",
        "id": 3715491,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/01/2226205/mira-muratis-stealth-ai-lab-launches-its-first-product",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mira Murati's Stealth AI Lab Launches Its First Product",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T02:54:42.167420+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T02:02:00+00:00",
        "description": "Renewables generated 54% of the EU's net electricity in Q2 2025, with solar power emerging as the leading source at nearly 20% of the total mix. Electrek reports: According to new data from Eurostat, renewable energy sources generated 54% of the EU's net electricity in Q2 2025, up from 52.7% year-over-year. The growth came mainly from solar, which produced 122,317 gigawatt-hours (GWh) -- nearly 20% of the total electricity generation mix. June 2025 was a milestone month: Solar became the EU's single largest electricity source for the first time ever. It supplied 22% of all power that month, edging out nuclear (21.6%), wind (15.8%), hydro (14.1%), and natural gas (13.8%). [...]\n \nIn total, 15 EU countries saw their share of renewable generation rise year-over-year. Luxembourg (+13.5 percentage points) and Belgium (+9.1 pp) posted the most significant gains, driven largely by solar power growth. Across the EU, solar made up 36.8% of renewable generation, followed by wind at 29.5%, hydro",
        "id": 3715198,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/01/2215232/solar-leads-eu-electricity-generation-as-renewables-hit-54",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Solar Leads EU Electricity Generation As Renewables Hit 54%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T01:32:53.047202+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T01:25:00+00:00",
        "description": "Researchers have unveiled two new hardware-based attacks, Battering RAM and Wiretap, that break Intel SGX and AMD SEV-SNP trusted enclaves by exploiting deterministic encryption and physical interposers. Ars Technica reports: In the age of cloud computing, protections baked into chips from Intel, AMD, and others are essential for ensuring confidential data and sensitive operations can't be viewed or manipulated by attackers who manage to compromise servers running inside a data center. In many cases, these protections -- which work by storing certain data and processes inside encrypted enclaves known as TEEs (Trusted Execution Enclaves) -- are essential for safeguarding secrets stored in the cloud by the likes of Signal Messenger and WhatsApp. All major cloud providers recommend that customers use it. Intel calls its protection SGX, and AMD has named it SEV-SNP.\n \nOver the years, researchers have repeatedly broken the security and privacy promises that Intel and AMD have made about th",
        "id": 3714889,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/01/229239/intel-and-amd-trusted-enclaves-a-foundation-for-network-security-fall-to-physical-attacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel and AMD Trusted Enclaves, a Foundation For Network Security, Fall To Physical Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T01:32:53.166158+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T00:45:00+00:00",
        "description": "Apple has paused development of a cheaper, lighter Vision Pro headset to shift resources toward AI-powered smart glasses aimed at competing with Meta. Bloomberg's Mark Gurman reports: The company had been preparing a cheaper, lighter variant of its headset -- code-named N100 -- for release in 2027. But Apple announced internally last week that it's moving staff from that project to accelerate work on glasses, according to people with knowledge of the matter. The company is working on at least two types of smart glasses. The first one, dubbed N50, will pair with an iPhone and lack its own display. Apple aims to unveil this model as soon as next year, ahead of a release in 2027, said the people, who asked not to be identified discussing internal matters.\n \nApple is also working on a version with a display -- something that could challenge the just-released Meta Ray-Ban Display. The Apple version had been planned for 2028, but the company is now looking to accelerate development, the peo",
        "id": 3714890,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/01/221223/apple-shelves-vision-headset-revamp-to-prioritize-meta-like-ai-glasses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Shelves Vision Headset Revamp to Prioritize Meta-Like AI Glasses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T00:10:27.811962+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from MacRumors: iFixit today disassembled the AirPods Pro 3, giving us a look at what's inside and how the AirPods Pro 3 have changed in comparison to the AirPods Pro 2. [...] To get a look at other components inside the AirPods Pro 3, iFixit essentially had to destroy them because Apple didn't design them to be repaired. Since the first version of the AirPods launched, they've included a battery that is sealed shut with glue, and that hasn't changed with the AirPods Pro 3. iFixit says battery replacements are so difficult that many repair shops won't even attempt to do it. The AirPods Pro Charging Case has the same glued-in battery.\n \nThere's no way to attempt a battery repair without causing blemishes on the plastic of the earbuds and the casing, because they have to be pried open. Heat needs to be used to melt the adhesive, and there's no easy way to disconnect the flex cable that's inside each earbud. With the need for specialized equipment and ",
        "id": 3714569,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/01/2125250/airpods-pro-3-impossible-to-repair-earn-score-of-0-in-ifixit-teardown",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AirPods Pro 3 Impossible To Repair, Earn Score of 0 In iFixit Teardown",
        "vote": 0
    }
]