[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T19:46:38.365970+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T17:30:06+00:00",
        "description": "The Tokyo Xtreme Racer franchise can be considered almost ancient in gaming terms at this point, with the first title in the series having come out on the Super NES. The last major release was back in 2005 for the PS2, and since then, the series has essentially been on hiatus. Developer Genki likely noticed the lack of strong arcade racers in the modern landscape, and decided to bring it back.\n\nThe modern take on Tokyo Xtreme Racer feels like the developers took ideas and concepts they had back in the early 2000s and dropped them into a game that looks and feels like it was made today. The racing is smooth, performance is great, and the campy story is just another great reason to play through the racer. The only real downsides are early game progression feeling slow, the lack of fast travel options without ending your racing night, and the music feeling incredibly repetitive after your first few hours.",
        "id": 3721007,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ReFBSZxs-uY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ReFBSZxs-uY/hqdefault.jpg",
        "title": "Tokyo Xtreme Racer Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T16:44:03.323884+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T15:30:15+00:00",
        "description": "If the past several decades have taught us anything about open-world titles, it's that the best are built differently. It's not about the biggest map, the sheer amount of virtual square kilometers, or how much content is stuffed within, but how you go about designing it. After all, the main goal of an open world is in the name itself – creating a world that feels alive and lived in.\n\nSeveral titles have achieved this in different ways – look no further than Cyberpunk 2077's Night City with its over-the-top ads, warring gangs, and unique NPCs. Then again, that doesn't mean titles like The Legend of Zelda: Breath of the Wild or Tears of the Kingdom are lesser open worlds by comparison – just approaching the goal from a different angle. Of course, there are also games like Starfield, where, no matter how many planets with life are discovered, each feels less “organic” than the last.",
        "id": 3719374,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Wm5Is2fuqS4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Wm5Is2fuqS4/hqdefault.jpg",
        "title": "Why Ghost of Yotei's Open World Is An ABSOLUTE TREAT TO EXPLORE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-02T15:05:18.287595+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-02T13:45:00+00:00",
        "description": "Ninja Gaiden 4 is finally only days away and we're stoked to finally dive back into the long-dormant franchise. But while Ninja Theory and Platinum Games seem to have brought all of the franchise's best features back for another round, they've also added a few new touches to help usher it into a new era of gaming.\n\nAs such, things might not be as you remembered them. Ryu Hayabusa is joined by a new protagonist with some seriously cool moves. Yakumo is going to need all the help he can get as he takes on the Dark Dragon who has brought his signature destructive style to Tokyo. With new twists to the franchise's excellent combat joining new enemy types and more, we thought it was a good idea to let you know what you're in for if you decide to pick up a copy.",
        "id": 3717910,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=1sIairskWDI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1sIairskWDI/hqdefault.jpg",
        "title": "Ninja Gaiden 4 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]