[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T19:32:07.219142+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T19:01:03+00:00",
        "description": "In this session recorded at Unreal Fest Stockholm, we explore the Platform Preview in Unreal Engine and how it can be used when developing mobile games.\n\nPreviewing your game as it will appear on the final device is a critical requirement for mobile and cross-platform game content development.\n\nThere is a lack of knowledge about the Platform Preview feature in the Unreal Editor. Some people don't know it exists, others know it's there, but don't know what it can do or what its limitations are. \n\nThis talk clears all that up. We dive into what the Platform Preview can and cannot do, showcase examples where it can be useful, present new features for it in 5.6 and 5.7, and also list future developments.\n\nLearn more about Unreal Engine here: unrealengine.com\n\n#MobileGameDevelopment, #PlatformPreview, #UnrealEditor, #CrossPlatformGames, #UnrealEngine, #UE5.6, #UE 5.7,  #UnrealFestStockholm",
        "id": 4211347,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pqq1b1H8SKc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pqq1b1H8SKc/hqdefault.jpg",
        "title": "Mobile Game Development with Platform Preview | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:18:20.560037+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:01:16+00:00",
        "description": "In this session recorded at Unreal Fest Stockholm, Studio Gobo introduces their terrain building workflow for LEGO® Horizon Adventures, with an emphasis on how reasoning, constraints, and experiments drove the optimization process behind the scenes.\n\nLEGO Horizon Adventures aims to immerse the audience in a world made fully of bricks, as if playing an interactive LEGO movie. \n\nWith a wide range of hardware supported, from high-end PCs to Nintendo Switch, scalable and optimized content is of utmost importance. \n\nOptimizing the terrain was one of many problems Studio Gobo solved to bring LEGO Horizon Adventures to Switch. \n\nIn this talk, they explore how the terrain was built in LEGO Horizon Adventures and what the limitations were.\n\nThen, they walk through their thought process and experiments, including failures and successes, which ultimately enabled them to overcome those limitations without sacrificing visual fidelity.\n\nLearn more about Unreal Engine here: unrealengine.com\n\n#LEGOHo",
        "id": 4210171,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=heoXRhQv8cs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/heoXRhQv8cs/hqdefault.jpg",
        "title": "LEGO® Horizon Adventures: Bringing Terrain to Switch | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:10:50.130846+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T15:00:37+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Stephen Cavanagh and Marios Michaelides of Black Shamrock draw on the studio's collaboration with Skydance New Media on ‘Marvel 1943: Rise of Hydra’ to explore how continuous performance monitoring can provide a clearer, more actionable view of optimization challenges throughout production.\n\nOptimization is often treated as an end-of-production task, resulting in rushed fixes and missed opportunities for improvement. This session reimagines optimization as an integral part of the development process, showcasing the transformative benefits of integrating performance capture and monitoring into your pipeline.\n\nThe session shares lessons learned, emphasizing how monitoring within CI/CD workflows can help identify bottlenecks early, reduce repetitive tasks, and streamline the optimization process. \n\nThere are also actionable strategies for teams looking to modernize their approach to performance optimization, transforming it into a pro",
        "id": 4209505,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Hr79E6vK74c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Hr79E6vK74c/hqdefault.jpg",
        "title": "Integrated Insights: Automating Performance Capture in Unreal Projects | Unreal Fest Orlando 2025",
        "vote": 0
    }
]