[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T23:27:22.268878+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T23:20:00+00:00",
        "description": "Three Austrian nuns in their 80s who escaped a care home and reclaimed their old convent are refusing the church's offer to stay because it requires them to quit Instagram, stop speaking to the press, and avoid legal counsel -- conditions they call a gag order. Their standoff with church authorities has now escalated to the Vatican as the nuns continue posting to their 185,000 followers. NPR reports: Before the church authorities moved the nuns into care almost two years ago, the local abbey and Archdiocese of Salzburg acquired the convent. The sisters say they were not aware they were signing away what they understood to be their lifelong right to remain in the cloister. On Friday, their superior, Provost Markus Grasl from Reichersberg Abbey, announced that the sisters can stay. But his offer comes with conditions: The nuns must cease all social media activities, stop talking to the press and forgo seeking legal advice. The nuns have rejected the proposal, and now Grasl has called on",
        "id": 4213004,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/01/2239244/austrias-rebel-nuns-refuse-to-give-up-instagram-to-stay-in-their-convent",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Austria's Rebel Nuns Refuse To Give Up Instagram To Stay In Their Convent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T23:27:22.385276+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T22:40:00+00:00",
        "description": "\"The car-sharing company, first launched in the U.S. in 2000, has been active in the UK since 2010 and has just under half a million members,\" writes Slashdot reader guesstral. \"'I'm writing to let you know that we are proposing to cease the UK operations of Zipcar,' wrote Zipcar UK's general manager, James Taylor, in an email to members today. He went on to say that Zipcar will temporarily suspend new bookings after December 31, pending the outcome of a consultation with its 71 staff members.\" From the BBC: In its most recent company accounts for 2024, Zipcar blamed the \"cost of living crisis,\" which was affecting UK customers, for revenues falling to 46 million pounds to 53 million the year before, while its after-tax losses had widened to 11.6 million pounds. According to the same accounts, Zipcar membership fees cover the cost of fuelling or charging the vehicle and, as energy costs continued to rise last year, it has added to financial pressures on the company. The company would ",
        "id": 4213005,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/01/2224216/zipcar-to-end-uk-operations",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zipcar To End UK Operations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T22:23:49.394784+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: South Korean e-commerce platform Coupang over the weekend said nearly 34 million Korean customers' personal information had been leaked in a data breach that had been ongoing for more than five months. The company said it first detected the unauthorized exposure of 4,500 user accounts on November 18, but a subsequent investigation revealed that the breach had actually compromised about 33.7 million customer accounts in South Korea. The breach affected customers' names, email addresses, phone numbers, shipping addresses, and certain order histories, per Coupang. More sensitive data like payment information, credit card numbers, and login credentials was not compromised and remains secure, the company said. [...] Police have reportedly identified at least one suspect, a former Chinese Coupang employee now abroad, after launching an investigation following a November 18 complaint.<p><div class=\"share_submission\" style=\"position:relativ",
        "id": 4212662,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/01/2158251/koreas-coupang-says-data-breach-exposed-nearly-34-million-customers-personal-information",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Korea's Coupang Says Data Breach Exposed Nearly 34 Million Customers' Personal Information",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T22:23:49.562549+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T21:20:00+00:00",
        "description": "New York has become the first state in the nation to enact a law requiring retailers to disclose when AI and personal data are being used to set individualized prices [non-paywalled source] -- a measure that lawyers say will make algorithmic pricing \"the next big battleground in A.I. regulation.\" \n\nThe law, enacted through the state budget, requires online retailers using personalized pricing to post a specific notice: \"THIS PRICE WAS SET BY AN ALGORITHM USING YOUR PERSONAL DATA.\" The National Retail Federation sued to block enforcement on First Amendment grounds, arguing the required disclosure was \"misleading and ominous,\" but federal judge Jed S. Rakoff allowed the law to proceed last month. \n\nUber has started displaying the notice to New York users. Spokesman Ryan Thornton called the law \"poorly drafted and ambiguous\" but maintained the company only considers geographic factors and demand in setting prices. At least 10 states have bills pending that would require similar disclosur",
        "id": 4212663,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/01/1740216/new-york-now-requires-retailers-to-tell-you-when-ai-sets-your-price",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York Now Requires Retailers To Tell You When AI Sets Your Price",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T21:21:07.921393+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T20:41:00+00:00",
        "description": "Singapore's Ministry of Education has announced that secondary school students will be banned from using smartphones and smartwatches throughout the entire school day starting January 2026, extending current restrictions beyond regular lesson time to cover recess, co-curricular activities, and supplementary lessons. Under the new guidelines, students must store their phones in designated areas like lockers or keep them in their school bags. \n\nSmartwatches also fall under the ban because they enable messaging and social media access, which the ministry says can lead to distractions and reduced peer interaction. Schools may allow exceptions where necessary. Some secondary schools adopted these tighter rules after they were announced for primary schools in January 2025, and the ministry reports improved student well-being and more physical interaction during breaks at those schools. The ministry is also moving the default sleep time for school-issued personal learning devices from 11pm t",
        "id": 4212204,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/01/1724252/singapore-extends-secondary-school-smartphone-ban-to-cover-entire-school-day",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Singapore Extends Secondary School Smartphone Ban To Cover Entire School Day",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T20:17:23.496527+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T20:02:00+00:00",
        "description": "Microsoft has acknowledged that a recent Windows preview update, KB5064081, contains a bug that renders the password icon invisible on the lock screen, leaving users to click on what appears to be empty space to enter their credentials. \n\nThe issue affects Windows Insider channel users who installed the non-security preview update. The company's suggested workaround is straightforward if somewhat absurd: click where the button should be, and the password field will appear. Microsoft said it is working to resolve the issue.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Windows+Update+Broke+Login+Button%2C+and+Microsoft's+Advice+is+To+Click+Where+It+Used+To+Be%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F12%2F01%2F1710222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftec",
        "id": 4211700,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/01/1710222/a-windows-update-broke-login-button-and-microsofts-advice-is-to-click-where-it-used-to-be",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Windows Update Broke Login Button, and Microsoft's Advice is To Click Where It Used To Be",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T20:17:23.585396+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T19:23:00+00:00",
        "description": "The Santa Monica City Council has unanimously voted to order Waymo to halt overnight charging operations at two outdoor depots near Broadway and 14th Street after months of resident complaints about constant beeping from reverse sensors, noise from charging equipment, traffic congestion and flashing lights between 11 p.m. and 6 a.m. As many as 56 autonomous vehicles charge at the two sites. It's unclear whether Waymo or its Virginia-based charging operator Volterra intends to comply. \n\nThe Los Angeles Times reported that neither company planned to, claiming city officials misunderstood their existing permit rights. Waymo told the newspaper it had adjusted operations in response to neighbor feedback and would continue seeking community input, though the company did not address the order directly. Local law enforcement has gotten involved after at least one person attempted to disrupt operations at the facilities on several occasions. \n\nThe dispute points to a broader challenge facing t",
        "id": 4211701,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/01/1657222/waymo-has-a-charging-problem",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo Has A Charging Problem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T19:09:21.785924+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T18:41:00+00:00",
        "description": "An anonymous reader writes: Netflix has removed the ability to cast shows and movies from phones to TVs, unless subscribers are using older casting devices. An updated help page on Netflix's website, first reported by Android Authority, says that the streaming service \"no longer supports casting shows from a mobile device to most TVs and TV-streaming devices,\" and instead directs users to navigate Netflix using the remote that came with their TV hardware.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix+Kills+Casting+From+Phones%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F12%2F01%2F1649216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F12%2F01%2F1649216%2Fnetflix-kills-casting-from-phones%3Futm_source%3Dslashdot%26u",
        "id": 4211220,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/01/1649216/netflix-kills-casting-from-phones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netflix Kills Casting From Phones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T19:09:22.082099+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T18:01:00+00:00",
        "description": "The skills that future graduates will most need in an age of automation -- creative thinking, critical analysis, the capacity to learn new things -- are precisely those that a growing body of research suggests may be eroded by inserting AI into the educational process, yet universities across the United States are now racing to embed the technology into every dimension of their curricula. \n\nOhio State University announced this summer that it would integrate AI education into every undergraduate program, and the University of Florida and the University of Michigan are rolling out similar initiatives. An MIT study offers reason for caution: researchers divided subjects into three groups and had them write essays over several months using ChatGPT, Google Search, or no technology at all. The ChatGPT group produced vague, poorly reasoned work, showed the lowest levels of brain activity on EEG, and increasingly relied on cutting and pasting from other sources. The authors concluded that LLM",
        "id": 4211221,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/01/1644253/colleges-are-preparing-to-self-lobotomize",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Colleges Are Preparing To Self-Lobotomize",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T18:01:29.223806+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:20:00+00:00",
        "description": "Major consulting firms including McKinsey, Boston Consulting Group and Bain have frozen starting salaries for the third consecutive year as AI reshapes how these companies think about their traditional reliance on large cohorts of junior analysts. Job offers for 2026 show undergraduate packages holding steady at $135,000-$140,000 and MBA packages at $270,000-$285,000, according to Management Consulted. The Big Four -- Deloitte, EY, KPMG, and PwC -- haven't raised starting pay since 2022. \n\nThe industry's classic \"pyramid\" structure, built on thousands of entry-level employees who crunch data and assemble PowerPoint decks, faces pressure as AI automates much of that work. Two senior executives at Big Four firms estimated that UK graduate recruitment would fall by about half in the coming year. PwC has already cut graduate hiring in 2025 and said in October it would miss a target to add 100,000 employees globally by 2026 -- a goal set five years ago before generative AI's rollout.<p><di",
        "id": 4210574,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/01/1241232/top-consultancies-freeze-starting-salaries-as-ai-threatens-pyramid-model",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Top Consultancies Freeze Starting Salaries as AI Threatens 'Pyramid' Model",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:53:55.495488+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:41:00+00:00",
        "description": "The British government said it opposes attempts to cool the planet by spraying millions of tons of dust into the atmosphere -- but did not close the door to a debate on regulating the technology. From a report: The comments in parliament Thursday came after a POLITICO investigation revealed an Israeli-U.S. company Stardust Solutions aimed to be capable of deploying solar radiation modification, as the technology is called, inside this decade. \"We're not in favor of solar radiation modification given the uncertainty around the potential risks it poses to the climate and environment,\" Leader of the House of Commons Alan Campbell said on behalf of the government.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+'Not+in+Favor'+of+Dimming+the+Sun%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F01%2F1420213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></",
        "id": 4209924,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/01/1420213/uk-not-in-favor-of-dimming-the-sun",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK 'Not in Favor' of Dimming the Sun",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:53:55.623646+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:00:00+00:00",
        "description": "An anonymous reader shares a report: India's telecoms ministry has privately asked all smartphone makers to preload all new devices with a state-owned cyber security app, a government order showed, a move set to spark a tussle with Apple, which typically dislikes such directives. \n\n[...] The November 28 order, seen by Reuters, gives major smartphone companies 90 days to ensure that the government's Sanchar Saathi app is pre-installed on new mobile phones, with a provision that users cannot disable it. [...] In the order, the government said the app was essential to combat \"serious endangerment\" of telecom cyber security from duplicate or spoofed IMEI numbers, which enable scams and network misuse.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Orders+Mobile+Phones+Preloaded+With+Government+App+To+Ensure+Cyber+Safety%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F12%2F01%2F0633231%2F%3Futm_source%3Dtwitter%2",
        "id": 4209925,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/01/0633231/india-orders-mobile-phones-preloaded-with-government-app-to-ensure-cyber-safety",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Orders Mobile Phones Preloaded With Government App To Ensure Cyber Safety",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T15:47:45.568470+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T15:20:00+00:00",
        "description": "Airbus said Monday that the vast majority of around 6,000 A320-family jets affected by an emergency software recall have now been modified, leaving fewer than 100 aircraft still requiring work after a frantic weekend of repairs prompted by the discovery of a vulnerability to solar flares. The unprecedented recall -- described as the broadest emergency action in the company's history -- came after a mid-air incident on a JetBlue A320 revealed a possible link between a drop in altitude and a space-related computer bug. \n\nThe fix involved reverting to an earlier version of software that controls nose angle, uploaded via cable from a portable device called a data loader. Some older A320 jets will need entirely new computers rather than a simple software reset, raising questions about how long those aircraft will remain grounded amid global chip shortages. \n\nReuters separately reported on Monday that Airbus had discovered an industrial quality issue affecting metal panels of a \"limited\" nu",
        "id": 4209356,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/01/1512213/airbus-says-most-of-its-recalled-6000-a320-jets-now-modified",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Airbus Says Most of Its Recalled 6,000 A320 Jets Now Modified",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T15:47:45.785828+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T14:40:00+00:00",
        "description": "China's central bank has flagged stablecoins as a specific concern in its latest push against virtual currencies, warning that the tokens fail to meet requirements for customer identification and anti-money-laundering controls and risk being used for fraud, money laundering, and unauthorized cross-border fund transfers. \n\nThe People's Bank of China released a statement Saturday following a Friday meeting on virtual currency regulation, saying crypto speculation has recently increased due to various factors and now presents new challenges for risk control. Virtual currencies do not hold the same legal status as fiat currency and cannot be used as legal tender, the bank said, adding that all virtual currency-related business activities are \"illegal financial activities.\" \n\nChina banned cryptocurrency trading in 2021. The bank said it will intensify efforts to combat illegal financial activities to maintain economic and financial stability. In October, PBOC Governor Pan Gongsheng said th",
        "id": 4209357,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/01/0757232/chinas-central-bank-flags-money-laundering-and-fraud-concerns-with-stablecoins",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Central Bank Flags Money Laundering and Fraud Concerns With Stablecoins",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T14:39:53.271968+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T14:00:00+00:00",
        "description": "Pat Gelsinger, the former Intel CEO who was pushed out in late 2024 during a five-year turnaround effort, told the Financial Times that the \"decay\" he found when he returned to the company in 2021 was \"deeper and harder than I'd realized.\" In the five years before his return, \"not a single product was delivered on schedule,\" he said. \"Basic disciplines\" had been lost. \"It's like, wow, we don't know how to engineer anymore!\" \n\nGelsinger was also unsparing about the Biden administration's implementation of the 2022 Chips Act, legislation he spent more time lobbying for than any other CEO. \"Two and a half years later [and] no money is dispensed? I thought it was hideous!\" There's what Gelsinger carefully calls \"a touch of irony\" in how things played out. \n\nIntel's board forced him out four years into a five-year plan, then picked successor Lip-Bu Tan -- who Gelsinger says is following the same broad strategy. Tan has kept Intel in the manufacturing game and delivered the 18A process node",
        "id": 4208691,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/01/1334224/former-ceo-blasts-intels-decay-we-dont-know-how-to-engineer-anymore",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Former CEO Blasts Intel's 'Decay': 'We Don't Know How To Engineer Anymore'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T13:31:05.347826+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T12:34:00+00:00",
        "description": "Two former U.S. congressmen announced this week that they're launching two tax-exempt fundraising groups \"to back candidates who support AI safeguards,\"\nreports The Hill, \"as a counterweight to industry-backed groups.\"\n\n\nFormer Representatives Chris Stewart (Republican-Utah) and Brad Carson (Democrat-Oklahoma) plan to create separate Republican and Democratic super PACs and raise $50 million to elect candidates \"committed to defending the public interest against those who aim to buy their way out of sensible AI regulation,\" according to a press release... \n\nThe pair is also launching a nonprofit called Public First to advocate for AI policy. Carson underscored that polling \"shows significant public concern about AI and overwhelming voter support for guardrails that protect people from harm and mitigate major risks.\" Their efforts are meant to counter \"anti-safeguard super PACs\" that they argue are attempting to \"kill commonsense guardrails around AI,\" the press release noted... \n\nThe ",
        "id": 4208109,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/01/0418205/two-former-us-congressmen-announce-fundraising-for-candidates-supporting-ai-regulation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Two Former US Congressmen Announce Fundraising for Candidates Supporting AI Regulation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T09:11:14.131841+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T08:34:00+00:00",
        "description": "Their announcement calls it \"more than a multicloud solution,\" saying it's \"a step toward a more open cloud environment. The API specifications developed for this product are open for other providers and partners to adopt, as we aim to simplify global connectivity for everyone.\" \n\n\nAmazon and Google are introducing \"a jointly developed multicloud networking service,\" reports Reuters. \"The initiative will enable customers to establish private, high-speed links between the two companies' computing platforms in minutes instead of weeks.\"\n\nThe new service is being unveiled a little over a month after an Amazon Web Services outage on October 20 disrupted thousands of websites worldwide, knocking offline some of the internet's most popular apps, including Snapchat and Reddit. That outage will cost U.S. companies between $500 million and $650 million in losses, according to analytics firm Parametrix. \n\n\nGoogle and Amazon are promising \"high resiliency\" through \"quad-redundancy across physica",
        "id": 4206403,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/01/0612218/amazon-and-google-announce-resilient-multicloud-networking-service-plus-an-open-api-for-interoperability",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon and Google Announce Resilient 'Multicloud' Networking Service Plus an Open API for Interoperability",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T06:00:18.984316+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T05:36:00+00:00",
        "description": "After a successful November 27th launch to the International Space Station, Russia discovered an accident had occurred on their launch site's mobile maintenance cabin &mdash; when a drone spotted it lying upside down in a flame trench.\n\n\"The main issue with the structure collapse is that it puts Site 31/6 &mdash; the only Russian launch site capable of launching crew and cargo to the International Space Station (ISS) &mdash; out of service until the structure is fixed,\" reports the space-news site NASA Spaceflight\n\n\n\nThere are other Soyuz 2 rocket launch pads, but they are either located at an unsuitable latitude, like Plesetsk, or not certified for crewed flights, like Vostochny, or decommissioned and transferred to a museum, like Gagarin's Start at Baikonur. As a result, Russia is temporarily unable to launch Soyuz crewed spacecraft and Progress cargo ships to the ISS, whose nearest launch (Progress MS-33) was scheduled for December 21.... \n\n\n\nWhen the rocket launched, a pressure di",
        "id": 4205568,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/01/0327208/russia-left-without-access-to-iss-following-structure-collapse-during-thursdays-launch",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Left Without Access to ISS Following Structure Collapse During Thursday's Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T04:59:46.678266+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T04:36:00+00:00",
        "description": "From the blog 9to5Linux:\n\nLinux kernel 6.18 is now available for download, as announced today by Linus Torvalds himself, featuring enhanced hardware support through new and updated drivers, improvements to file systems and networking, and more.\n\nHighlights of Linux 6.18 include the removal of the Bcachefs file system, support for the Rust Binder driver, a new dm-pcache device-mapper target to enable persistent memory as a cache for slower block devices, and a new microcode= command-line option to control the microcode loader's behavior on x86 platforms.\n\nLinux kernel 6.18 also extends the support for file handles to kernel namespaces, implements initial 'block size &gt; page size' support for the Btrfs file system, adds PTW feature detection on new hardware for LoongArch KVM, and adds support for running the kernel as a guest on FreeBSD's Bhyve hypervisor.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+Kernel+",
        "id": 4205297,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/01/0218201/linux-kernel-618-officially-released",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linux Kernel 6.18 Officially Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T01:48:34.579906+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T01:40:00+00:00",
        "description": "Some AI experts were reportedly shocked ChatGPT wasn't fully tested for sycophancy by last spring. \"OpenAI did not see the scale at which disturbing conversations were happening,\" writes the New York Times &mdash; sharing what they learned after interviewing more than 40 current and former OpenAI employees, including safety engineers, executives, and researchers. \n\n\nThe team responsible for ChatGPT's tone had raised concerns about last spring's model (which the Times describes as \"too eager to keep the conversation going and to validate the user with over-the-top language.\") But they were overruled when A/B testing showed users kept coming back:\n\nNow, a company built around the concept of safe, beneficial AI faces five wrongful death lawsuits... OpenAI is now seeking the optimal setting that will attract more users without sending them spiraling.\nThroughout this spring and summer, ChatGPT acted as a yes-man echo chamber for some people. They came back daily, for many hours a day, with",
        "id": 4204612,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/01/0137225/how-openai-reacted-when-some-chatgpt-users-lost-touch-with-reality",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How OpenAI Reacted When Some ChatGPT Users Lost Touch with Reality",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T00:48:07.153820+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T00:19:00+00:00",
        "description": "It's \"a complex mix of internet access and physical execution,\" says the chief informance security officer at Cequence Security. \n\nLong-time Slashdot reader schwit1 summarizes this article from The Wall Street Journal:\n\n\n By breaking into carriers' online systems, cyber-powered criminals are making off with truckloads of electronics, beverages and other goods In the most recent tactics identified by cybersecurity firm Proofpoint, hackers posed as freight middlemen, posting fake loads to the boards. They slipped links with malicious software into email exchanges with bidders such as trucking companies. By clicking on the links, trucking companies unwittingly downloaded remote-access software that lets the hackers take control of their online systems. Once inside, the hackers used the truckers' accounts to bid on real shipments, such as electronics and energy drinks, said Selena Larson, a threat researcher at Proofpoint. \"They know the business,\" she said. \"It's a very convincing full-s",
        "id": 4204377,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/30/2357209/crime-rings-enlist-hackers-to-hijack-trucks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Crime Rings Enlist Hackers To Hijack Trucks'",
        "vote": 0
    }
]