[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T18:45:00.937422+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T18:00:41+00:00",
        "description": "Explore how the chaos of the grocery stores can help us better navigate and reclaim the online world. Sometimes all you need is a grocery list. Bridget Stuger is a user-experience professional who designs educational technologies. She draws upon her M.S. in media science from Boston University to create inclusive, data-driven products. \n\nAs an avid reader, activist, and lifelong learner, Bridget infuses curiosity into every aspect of her life, from writing to traveling. Her works combine universal design practices with her B.A. in political science, also from Boston University, to better understand how the online world shapes our day-to-day lives. \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210872,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=W4toMb4BY8M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/W4toMb4BY8M/hqdefault.jpg",
        "title": "How to shop the internet like a grocery store | Bridget Stuger | TEDxBU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:53.923569+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:10:55+00:00",
        "description": "Rita is a technologist who launched one of Australia’s first internet cafés now helps steer the country through the age of AI. In this talk, she shows how responsible AI, digital “twins,” and agentic systems will soon walk among us and why we must treat AI as a powerful tool, not a trusted friend. \n\nHer call: become “parents” to AI, giving it values, guardrails and guidance so it can rejuvenate our societies instead of harming them. Rita Arrigo serves as the Strategic Engagement Manager at the National\nAI Centre, where she is focused on empowering the Australian AI\nIndustry growth for collaboration across the AI landscape. Her mission is\nto elevate Australia's global AI adoption and cultivate a responsible AI\nindustry.\n\nWith a wealth of experience in digital and AI strategy, Rita has delivered\nthought leadership on topics such as Generative AI, AI for Safety, and AI for Climate Tech.\n\nShe has launched the AI Industry Connection forum to connect companies interested in emerging AI with",
        "id": 4210229,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UAHDtXDn56Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UAHDtXDn56Y/hqdefault.jpg",
        "title": "Why AI is not your friend | Rita Arrigo | TEDxMelbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.085149+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:10:31+00:00",
        "description": "We’ve been sold a myth: that innovation happens by following the right process, method or map. But as Tessa Foreshaw reveals, the real breakthroughs come from something far more human—our ability to notice our own thinking, emotions and habits in real time. \n\nThis talk uncovers why metacognition—not post-its or process maps—is the quiet superpower that turns ordinary people into true navigators of change.\n\nFind our more about Tessa's research at https://pz.harvard.edu/who-we-are/people/tessa-forshaw Tessa Forshaw, PhD, is a cognitive scientist, senior researcher, and co-founder of the Next Level Lab at Harvard University. She teaches design thinking, creativity, and innovation at the Harvard Innovation Lab and Harvard University DCE. She also served on the Teaching Faculty at Stanford’s design school for several years, and has worked in innovation consultancies across the world. This talk was given at a TEDx event using the TED conference format but independently organized by a local ",
        "id": 4210230,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RrHXaYKs_Qw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RrHXaYKs_Qw/hqdefault.jpg",
        "title": "The real skill behind creative breakthroughs | Tessa Forshaw | TEDxMelbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.221941+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:10:13+00:00",
        "description": "Around the world, places like Oslo and London are proving that bold climate action isn’t just good for the planet, it’s triggering a multi-trillion-dollar economic transformation. \n\nThis talk shows how clean construction sites, climate-tech hubs and green finance are rewriting the rules of prosperity, and why towns that “wait and see” will be left behind.\n\nIt’s a call for local leaders and citizens to seize the moment, shape their region’s niche, and claim their share of the next economic boom.\n\nYou can follow Andrew at https://andrewwear.com/ Andrew Wear is an economist, author and strategic advisor helping cities, regions and industries grow in a world of rapid change.\nAs the founder of Econovation, a boutique consultancy, Andrew works with leaders across government, business and research to design bold, future-focused economic strategies.\n\n He previously led economic development for the City of Melbourne, helping steer the city through recovery and reinvention during some of its mo",
        "id": 4210231,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cNCnzhXPIag",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cNCnzhXPIag/hqdefault.jpg",
        "title": "The next economic boom will be won by cities that lead on climate | Andrew Wear | TEDxMelbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.389321+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:07:50+00:00",
        "description": "Our daily choices carry real consequences. Kim challenges us to pause and ask: Do my actions help or harm? Grounded in The Golden Rule, she reveals how conscious living, rooted in empathy and shared values, can transform our relationships, communities, and the planet. This talk invites us to choose kindness in action and co-create a more compassionate future. Kim’s journey proves that shared values connect us all. Guided by The Golden Rule, she co-curated Imaginal Cells, Visions of Transformation and co-founded Reboot the Future, inspiring a more compassionate world. Her book Values for a Life Economy preserves lessons from Covid. She co-founded the Kilimanjaro Blind Trust, improving literacy for visually impaired children. A lifelong cellist and changemaker, she embraces curiosity and kindness. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210232,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9vHbIOWCySc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9vHbIOWCySc/hqdefault.jpg",
        "title": "Are you hurtful or helpful? | Kim Polman | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.514542+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:06:37+00:00",
        "description": "What if the secret to a longer, healthier life is already within reach? In this TEDx talk, Dr. Ami Bhatt reveals how breakthroughs in science—and simple heart health habits—can add years to your life. From longevity drugs that extend lifespan in mice, to the power of wearables and digital health, Dr. Bhatt shows that the real “longevity hack” is cardiac health. You’ll discover why living fully matters more than living forever—and how you can take control of your own aging journey today.\n\nAging, Heart health, Idea Challenge, Innovation, Life Hack, Medicine, Neurology Ami B. Bhatt, MD, FACC, is the Chief Innovation Officer of the American College of Cardiology, where she leads initiatives at the intersection of clinical practice, emerging technologies, and health policy. She earned her undergraduate degree from Harvard University and her medical degree from the Yale School of Medicine.\n\nDr. Bhatt is recognized nationally for her leadership in advancing the AI-enabled clinician, promotin",
        "id": 4210233,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HZKZ4-ryQXE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HZKZ4-ryQXE/hqdefault.jpg",
        "title": "The tried and true science of living longer | Ami Bhatt | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.669573+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:05:28+00:00",
        "description": "THE MIGRANTS ARE COMING. But what else is going on behind the headlines?\nStep onto the deck of a Mediterranean search-and-rescue mission with Dr. Priyesh Patel. An NHS emergency doctor and humanitarian, Priyesh shares the harrowing reality at sea, revealing the life-and-death medical scenarios and evidence of torture and abuse he witnessed firsthand. \nHis powerful, deeply emotional talk doesn't just share stories—it confronts indifference. Challenging us to see the unseen, exposing how neglect fuels hidden crises like modern slavery, human trafficking, and organ theft. Dare to confront why we ignore the most vulnerable among us. Priyesh is an NHS doctor working in an emergency department in London, as well as a humanitarian and the CEO & Founder of Neglected Elements, a platform highlighting the world’s most overlooked crises. From rescuing people in the Mediterranean to working on the frontline of global health, he has witnessed what dignity, survival, and humanity truly mean. This t",
        "id": 4210234,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zc76uleTg4s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zc76uleTg4s/hqdefault.jpg",
        "title": "Healthcare in Hidden Communities: Why It’s Everyone’s Problem | Priyesh Patel | TEDxNHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.823153+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:05:14+00:00",
        "description": "Mum of two beautiful children, Stacey shares her journey of being born with a cleft and also having a child born with a cleft. She shares how this has led her to learn more about trauma and the affects on the brain and body. Satcey has created two photography projects to change how individuals with a visible difference are represented. Her talk urges you to challenge the stereotypes and stigma around visible differences and how we teach our children about differences and kindness so that those who experience this know it is safe to feel seen.   Stacey is a Senior Medical Photographer at University Hospital Sussex. Born with a cleft, she has become a passionate advocate for change through her photography and storytelling, shining a light on the lived experiences of those with visible difference. When her youngest son was born with a cleft, her drive to reshape perceptions and promote inclusion grew even stronger. An ambassador for Smile Train and campaigner with Changing Faces This tal",
        "id": 4210235,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_S4cRqlpBc4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_S4cRqlpBc4/hqdefault.jpg",
        "title": "Being visibly invisible - A journey with cleft | Stacey Hussell | TEDxNHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:54.998399+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:03:49+00:00",
        "description": "There has been a lot of talk about the benefits of AI for Africa; however, one dimension of this conversation is often overlooked: technology is value laden. In this talk, I challenge the myth that AI is neutral or purely technical. AI is not just code—it’s culture. Technologies can carry the beliefs, assumptions, and values of its creators. And since most AI is built in the Global North, when African societies adopt these technologies, we’re not just importing tools—we’re importing worldviews and culture that can overshadow and even erase indigenous African knowledge and ways of life. These tools are doing more than making life convenient. They’re redefining what we value, how we live, and even what we consider “normal” in Africa. James Maisiri is a researcher and speaker whose work investigates how artificial intelligence and robotics are transforming labour, education, and society across Africa, with particular attention to the intersections of technology, migration, and inequality",
        "id": 4210236,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=y1BVZvjLevQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y1BVZvjLevQ/hqdefault.jpg",
        "title": "The hidden danger of AI in Africa | James Maisiri | TEDxUniversityofJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.165353+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:02:23+00:00",
        "description": "In this talk, Aanchal Agrawal shares a refreshing idea: you don’t become funny by mastering comedy, but you become funny when you learn to take life lightly. Aanchal reminds us that joy isn’t something you chase… It’s something you notice when you stop taking everything so seriously. Quick-witted, fearless, and refreshingly honest, Aanchal is a comedian who finds depth in humour. With her sharp observations and relatable storytelling, she transforms everyday moments into laughter that lingers, sparking both smiles and introspection. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210237,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NoVMDf1YJ2k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NoVMDf1YJ2k/hqdefault.jpg",
        "title": "Finding Fun in an Over-Serious World | Aanchal Agrawal | TEDxShahpura Lake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.373050+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:02:05+00:00",
        "description": "Nasreen's talk critically examines key ethical challenges in Artificial Intelligence in Education (AIED) within Sub-Saharan Africa, including algorithmic bias, digital literacy gaps, and systemic inequities that overshadow AI’s potential as a transformative educational tool. \nShe argues that providing access to digital tools alone is insufficient; students must develop critical thinking skills to enhance digital literacy and meaningfully engage with AI-driven education (UNESCO, 2023:14). Achieving this requires a shift in AI governance and policy from efficiency-driven models to ethical frameworks that empower students, ensuring AI does not exacerbate existing disparities. To address these challenges, I propose the Equitable AI in Digital Education (EQUID) framework, aligning with Sustainable Development Goals (SDG 4.6 and SDG 4.7) as a capability-enhancing approach for strengthening the functional capabilities of marginalized students in Sub-Saharan Africa.  Nasreen Watson is the Fou",
        "id": 4210238,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=e1DK1RSnpG8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/e1DK1RSnpG8/hqdefault.jpg",
        "title": "From no chair to Africa’s AI | Nasreen Watson | TEDxUniversityofJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.539890+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:01:47+00:00",
        "description": "Divyaa Moorjanni spoke about how people today consume content unconsciously - without reflection or intention. She highlighted that content has become the new oxygen: we don’t ask for it, we simply inhale it continuously, in staggering amounts. As the Lead of Content Strategy at JioTV, Divya Moorjanni combines creative instinct with strategic vision. Passionate about storytelling and media innovation, she curates experiences that connect, inform, and inspire, redefining how content speaks to India’s evolving digital generation. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210239,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mC1Bzk0usJI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mC1Bzk0usJI/hqdefault.jpg",
        "title": "Content Is the New Oxygen: What Are We Really Breathing? | Divyaa Moorjanni | TEDxShahpura Lake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.669137+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T17:00:01+00:00",
        "description": "Lupi propone una visión transformadora: convertirnos en el CEO de nuestro propio cuerpo. En su plática comparte cómo aplicar herramientas de management a la salud, impulsando a cada persona a liderar su bienestar con conciencia, estrategia y amor.\n “CEO de tu cuerpo: decisiones que lideran tu bienestar” - Lupi propone una visión transformadora: convertirnos en el CEO de nuestro propio cuerpo. En TEDx comparte cómo aplicar herramientas de management a la salud, impulsando a cada persona a liderar su bienestar con conciencia, estrategia y amor. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210240,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=T8e22zHNZMc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/T8e22zHNZMc/hqdefault.jpg",
        "title": "Sé el CEO de tu bienestar | Guadalupe Martínez | TEDxUniversidad Panamericana Bonaterra",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.757232+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:59:28+00:00",
        "description": "Victoria explora cómo las emociones y redes sociales influyen en nuestras decisiones. Su trabajo con familias y niños la llevó a comprender la importancia del sistema límbico, “ese narrador silencioso” que guía nuestras elecciones. En su plática nos invita a recuperar el control en un mundo digital. “Narrador Invisible: Decisiones que no se ven, emociones que se sienten” - Victoria explora cómo emociones y redes sociales influyen en nuestras decisiones. Su trabajo con familias y niños la llevó a comprender la importancia del sistema límbico, “ese narrador silencioso” que guía nuestras elecciones. En TEDx invita a recuperar el control en un mundo digital. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210241,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Gp26iYDYl00",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Gp26iYDYl00/hqdefault.jpg",
        "title": "Tu narrador invisible | Victoria Gameros | TEDxUniversidad Panamericana Bonaterra",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.845221+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:58:21+00:00",
        "description": "Nupur Verma presents a compelling new perspective on leadership at the intersection of motherhood, introversion, partnerships, and AI. This talk challenges old leadership stereotypes and offers a blueprint for intentional, inclusive, and scalable leadership. As the Head of Startup Partnerships at Google, Nupur Verma stands at the intersection of technology, innovation, and entrepreneurship. A driving force behind empowering India’s startup ecosystem, she embodies forward-thinking leadership and inspires change through collaboration, communication, and purpose. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4210242,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EjcM1EcwaJ4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EjcM1EcwaJ4/hqdefault.jpg",
        "title": "The Silent Leader: How Introverts Create the Loudest Change | Nupur Verma | TEDxShahpura Lake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T17:37:55.937731+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:56:53+00:00",
        "description": "Ferhat Aydın, 25 Mayıs 2025 tarihinde TEDxIzmir sahnesinde konuşmacı olarak yer aldı.\n ODTÜ Psikoloji bölümünden mezun olan Ferhat Aydın, mezuniyetinin ardından Boylam Psikiyatri Enstitüsü’nde ‘Klinik Uygulamalı Psikoloji Okulu ve Nesnel Değerlendirme Eğitimi’ni tamamladı. Meslek hayatına özel bir kurumda çocuk-ergen ve ailelere psikolojik danışmanlık alanında hizmet vererek başladı. Daha sonra ‘Kısa Süreli Çözüm Odaklı Terapi Eğitimi’ni tamamladı. Bilişsel Davranışçı Terapi ve Cinsel Terapi eğitimlerini tamamlayan Aydın, bu temel eğitimlere ilaveten, Oyun Terapisi, Boşanma Adaptasyonu Terapisi, Çocuklarla Bilişsel Davranışçı Terapi, Uluslararası Okul Psikolojisi Birliği onaylı eğitimler olan ‘Krize Müdahale Teknikleri’ ve ‘Terapötik Kartlar’ eğitimlerini başarıyla tamamladı. Spor psikolojisine de ilgi duyan Aydın, Türkiye Hokey Federasyonu’nun ve Hokey Milli Takımlarının psikologluğunu da yaptı.\n\nTürkiye’de ve dünyada ilk kez hayata geçirilen Bar Psikoloğu – Psikogösteri konseptinin ",
        "id": 4210243,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1PbesmlOyGw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1PbesmlOyGw/hqdefault.jpg",
        "title": "Olmayan Bir Mesleği Var Etmenin Hikayesi | Ferhat Aydın | TEDxIzmir",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:00.223490+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:27:20+00:00",
        "description": "Il Sud America possiede una vasta ricchezza mineraria. L'attività mineraria rappresenta una parte significativa degli investimenti esteri in entrata nel continente. Ma è anche accompagnata da un elevato rischio di degrado ambientale e impatti negativi sulle comunità locali, con conseguenti conflitti socio-ambientali. Alessandro racconta questa condizione attraverso le sue fotografie lanciandoci un messaggio sull'importanza di trovare un equilibrio tra sviluppo, tutela dell'ambiente e delle persone.  Fotogiornalista italiano nato nel 1988, Alessandro Cinque vive tra la Colombia e il Perù, dove documenta le conseguenze ambientali e sociali dell’industria mineraria sulle comunità indigene. Le sue immagini raccontano i volti e le storie di chi vive ai margini dei grandi processi economici e ambientali, con un linguaggio potente e rispettoso. Ha pubblicato su testate internazionali come The New York Times Magazine, National Geographic, Reuters e The Guardian, ed esposto in oltre 80 mostre ",
        "id": 4209561,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zRLnHeuk4EI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zRLnHeuk4EI/hqdefault.jpg",
        "title": "El Precio de la Tierra | Alessandro Cinque | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:00.478591+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:25:52+00:00",
        "description": "Serena Granziera nel suo speech parla di sostenibilità come scelta di divenire. Nel mondo aziendale, in quanto capacità di pensarsi nel lungo periodo, ma soprattutto nella vita di tutti i giorni alla ricerca della felicità.  Fondatrice e CEO di Bloom Srl Società Benefit, Serena Granziera aiuta imprese e persone a tradurre la visione sostenibile in strategie concrete. Con una formazione multidisciplinare e una lunga esperienza nel mondo della comunicazione e dell’innovazione sociale, lavora per diffondere una nuova cultura d’impresa basata su gentilezza, impatto e responsabilità. Autrice di contenuti e articoli sul ruolo delle aziende nel cambiamento, porta avanti un approccio che unisce strategia e ispirazione: perché la sostenibilità non è solo un obiettivo, ma un modo di essere. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4209562,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=g4UtYPw3SJo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/g4UtYPw3SJo/hqdefault.jpg",
        "title": "Il coraggio di diventare | Serena Granziera | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:00.702212+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:25:39+00:00",
        "description": "Roberto Ragazzoni associa Prometeo e Tyche, ovvero il Titano che regala il foco agli uomini e la dea della fortuna. Fortuna però è anche speranza, capacità di mettersi in moto. Perchè ogni successo, ogni progresso in scienza e in astrofisica, sono le nuove domande che arriveranno in un cammino di conoscenza.  Astrofisico e professore ordinario all’Università di Padova, Roberto Ragazzoni è Presidente dell’Istituto Nazionale di Astrofisica (INAF). Ha lavorato nei più importanti centri di ricerca del mondo, dallo Steward Observatory in Arizona al Max Planck Institut di Heidelberg, progettando strumenti che hanno ampliato la nostra capacità di osservare l’universo.\nPremiato con riconoscimenti come il Premio Feltrinelli dell’Accademia dei Lincei, il Premio Gal Hassin e il Wolfgang Paul Award, Ragazzoni unisce rigore scientifico e passione divulgativa. Il suo sguardo rivolto al cielo è, da sempre, un modo per capire meglio la Terra. This talk was given at a TEDx event using the TED conferen",
        "id": 4209563,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=As-G9dpodVs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/As-G9dpodVs/hqdefault.jpg",
        "title": "La cosa più bella di ogni scoperta scientifica | Roberto Ragazzoni | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:00.900823+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:25:10+00:00",
        "description": "Il trio di sorelle affronta attraverso la musica il bisogno di rispondere in maniera nuova a domande che nascono dall'infanzia e dall'adolescenza, il bisogno di essere viste, il bisogno di crescere e riconnettersi con l'origine di tutte le cose. Il gruppo vocale \"Yavanna\" nasce nel 2008 ed è formato da tre sorelle: Virginia Racca, cantante e pianista; Letizia Racca, cantante e flautista; Agata Anita Racca, cantante e violinista. Nello stesso anno partecipano al \"Cantagiro\" aggiudicandosi il primo premio, e nell' anno successivo sono finaliste ad XFACTOR 3, arrivando terze sul podio con Marco Mengoni. Seguono anni di concerti in tutta Italia e l'autoproduzione dell’album \"Intuito Alchemico\" scritto da Agata e Letizia con la produzione artistica di Luca Vicini, noto bassista dei Subsonica. Nel dicembre 2014 le tre ragazze sentono di aver bisogno di separarsi per cercare ognuna una propria dimensione personale e così il gruppo si scioglie. Esce nel 2015 il documentario/concerto  “Forse i",
        "id": 4209564,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WKEvWXbDtDA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WKEvWXbDtDA/hqdefault.jpg",
        "title": "E di colpo venne il mese di febbraio  | The Yavanna | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:01.122405+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:24:46+00:00",
        "description": "La Dott.ssa Fantinel esplora la rappresentazione di alcuni miti nella storia dell'arte affrontando la loro evoluzione culturale. Da un rapporto con la natura simbiotico siamo passati ad una percezione di predominanza dell'Uomo sul creato per tornare, oggi, a sentire il desiderio di unire dimensione spirituale e ambiente.  Luisa Fantinel unisce la ricerca accademica a un approccio umano e sensibile. Dottore di ricerca in Storia delle Arti e con formazione in antropologia culturale e arte terapia, insegna in diversi master dell’Università di Padova e collabora con istituzioni come la Collezione Peggy Guggenheim di Venezia. Nel suo saggio “L’arte di morire (e di vivere)” esplora il valore trasformativo dell’arte nei momenti di passaggio e di fragilità. Crede che la cultura visiva sia una chiave per comprendere la vita, per dialogare con l’emotività e per ritrovare un equilibrio tra il sé e il mondo. This talk was given at a TEDx event using the TED conference format but independently org",
        "id": 4209565,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=toUD3qq094c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/toUD3qq094c/hqdefault.jpg",
        "title": "Rispettare l'appartenenza all'ordine naturale | Luisa Fantinel | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:01.377374+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:24:20+00:00",
        "description": "Paolo Deganello racconta la sua esperienza di architetto e designer rivoluzionario e radicale analizzando l'evoluzione di queste discipline e il loro rapporto con le persone e le comunità. Architetto e designer, Paolo Deganello è tra i protagonisti del design radicale, movimento che ha ridefinito negli anni ’60 il modo di intendere il progetto. Nel 1966 fonda lo studio Archizoom Associati insieme a Andrea Branzi, Gilberto Corretti e Massimo Morozzi, portando una visione che unisce critica, sperimentazione e libertà creativa. Nel corso della sua carriera ha collaborato con aziende come Cassina, Driade, Venini, Zanotta e Vitra, lasciando un segno profondo nella cultura del design internazionale. Oggi continua a insegnare e a riflettere sul rapporto tra etica, estetica e sostenibilità, convinto che progettare significhi prima di tutto immaginare nuovi modi di vivere e di abitare il mondo. This talk was given at a TEDx event using the TED conference format but independently organized by a",
        "id": 4209566,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Yor00gSmG18",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Yor00gSmG18/hqdefault.jpg",
        "title": "Il Design è un atto radicale | Paolo Deganello | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:01.634276+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:23:52+00:00",
        "description": "Il poeta è tanto più scientifico quanto più si tenga lontano sideralmente da ogni piazza, da ogni televisione, da ogni luogo comune, e il luogo comune è per sua natura dittatoriale e falso, perché suo malgrado esprime sempre, invariabilmente una falsa coscienza, conformata e conformista. Ma la poesia è anche l'unica forma che abbiamo di astrazione, di connessione e di verità. Cantautore, attore e scrittore trevigiano, Giulio Casale ha costruito la sua carriera attraversando linguaggi diversi, dalla musica al teatro, dalla poesia alla narrativa. Fondatore e voce degli Estra, band simbolo del rock italiano degli anni ’90, ha poi intrapreso un percorso solista che lo ha portato a collaborare con importanti realtà culturali e teatrali. Nel suo lavoro la parola è un atto politico e poetico insieme: uno strumento per interpretare il presente, raccontarne le contraddizioni e cercare nuove possibilità di senso. Oggi porta avanti una ricerca artistica che intreccia musica e letteratura, manten",
        "id": 4209567,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rLp2zTjOG2s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rLp2zTjOG2s/hqdefault.jpg",
        "title": "Prometeo e il mito della Poesia | Giulio Casale | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:01.883515+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:22:51+00:00",
        "description": "Il Prof. Corn racconta l'evoluzione della cornice giuridica del femminicidio e della consapevolezza sulla violenza di genere spiegando la differenza tra leggi e diritto. Un percorso che parte dalla letteratura e si evolve con la convenzione di Istanbul.  Giurista trentino, Emanuele Corn è professore associato di diritto penale comparato presso l’Universidad de Antofagasta in Cile e ricercatore all’Università di Pavia. Da anni si occupa di temi legati alla giustizia penale, alla violenza di genere e alla tutela dei diritti umani, con un approccio che intreccia studio, didattica e impegno sociale. È stato consigliere di parità nella Provincia Autonoma di Trento e consulente della Commissione parlamentare d’inchiesta sul femminicidio nella XVIII legislatura. La sua prospettiva nasce dal dialogo tra culture giuridiche diverse: un invito a comprendere la legge non solo come regola, ma come strumento per costruire una società più giusta e consapevole. This talk was given at a TEDx event usi",
        "id": 4209568,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5RC2TVOLRkI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5RC2TVOLRkI/hqdefault.jpg",
        "title": "Il diritto a una vita libera dalla violenza | Emanuele Corn | TEDxTreviso",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:02.077166+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:21:52+00:00",
        "description": "Enes Coşkun, iyi bir akademik geçmişle başlayan eğitim yolculuğunun, New York’ta geceleri yaptığı paket serviste karşılaştığı beklenmedik bir içecekle tamamen değişmesini anlatıyor. Hiç bilmediği bir kültürün parçası olan maça ile tanışması, onu Japonya’daki üretim alanlarına, ardından Türkiye’de damak zevkine uygun yeni formüller geliştirmeye yöneltiyor. Bugün birden fazla şubesi olan bir markanın kurucusu olarak, hayatın küçük görünen parçalarının bir araya geldiğinde nasıl büyük bir dönüşüm yaratabileceğini paylaşıyor. Tesadüflerin, merakın ve risk almanın birleştiğinde nasıl yeni sektörler doğurabileceğine dair ilham verici bir hikaye sunuyor. Enes Coşkun, Türkiye’nin ilk matcha barı olan POCO’nun kurucusudur. 2018 yılında Özyeğin Üniversitesi’nden mezun olan Coşkun, üniversite sonrası yöneticilik eğitimi almak üzere New York’a taşındı. Burada matcha ile tanışarak bu özel içeceğe ilgi duymaya başladı.\nPandemi döneminde Türkiye’ye dönen Enes Bey, matchanın alışılmışın dışındaki tad",
        "id": 4209569,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zoHyrKpqq7E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zoHyrKpqq7E/hqdefault.jpg",
        "title": "Küçük Bir Detay, Büyük Bir Dönüşüm: Maçayı Türkiye’ye Taşıyan Hikaye | Enes Coşkun | TEDxKoçSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:02.262261+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:21:07+00:00",
        "description": "Vivemos buscando o que falta e esquecemos o que já temos. Esta palestra fala sobre gratidão, presença e autoconhecimento, um convite para redescobrir o sentido da felicidade nas pequenas coisas e na vida que já está acontecendo. Referência internacional em representatividade e superação, Vitória nasceu sem os dois braços e encantou o mundo com sua leveza e talento. Ganhou destaque em programas como Das Supertalent (Alemanha) e America’s Got Talent: All Stars (EUA), encantando jurados e plateias com seu talento e leveza. Em 2024, protagonizou um espetáculo no Teatro Châtelet, em Paris, durante as Paralimpíadas.\n\nVitória inspira milhões ao provar, com cada passo, que determinação e arte não conhecem limites. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4209570,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tEj4inRn46c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tEj4inRn46c/hqdefault.jpg",
        "title": "A vida não é sobre o que falta | Vitória Bueno | TEDxInatel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:02.459076+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:20:22+00:00",
        "description": "This talk features Dan Gîrtofan, a professional rally driver with over 30 years of experience in motorsport, who shows how simplicity and focus can become a life strategy, not just a racing tactic. Using the idea that “the straight line is the fastest one” as a central metaphor, he explores how clear, uncomplicated choices lead to better outcomes both on the rally stages and in everyday life.\n\nStarting from a unique achievement he shared with his son – finishing first and second at the Brașov Rally – Gîrtofan shifts the spotlight from trophies to responsibility toward the community through ERA (Education, Responsibility, Attitude), a road‑safety education program for high‑school students. He offers teenagers a set of simple defensive‑driving principles and five essential life‑saving steps in emergencies, showing how time management, seat‑belt use, and calm reaction can be the thin line between life and death.\n\nDrawing on his own difficult experience with COVID‑19, he ultimately remind",
        "id": 4209571,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yErNxleHIgU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yErNxleHIgU/hqdefault.jpg",
        "title": "From Rally Wins to Saving Lives: The Power of Simplicity | Dan Gîrtofan | TEDxBrașov",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:02.661721+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:19:33+00:00",
        "description": "Entre algoritmos, desinformação e excesso de dados, pensar se tornou um ato de coragem. Esta palestra revela como o pensamento crítico é a chave para navegar na era da inteligência artificial e tomar decisões conscientes e transformadoras. Martha Gabriel é um ícone multidisciplinar na América Latina, referência em inovação, negócios e futuro.\n\nAutora de best-sellers como Liderando o Futuro, Você, Eu e os Robôs e Inteligência Artificial – do Zero a Superpoderes, é futurista pelo IFTF, engenheira pela Unicamp, mestre e PhD em artes, com formação executiva no MIT. Também é pós-graduada em Marketing e Design.\n\nColunista da MIT Sloan Management Brasil e da MIT Technology Review Brasil, é professora de Inteligência Artificial na pós-graduação da PUC-SP e faculty internacional da CrossKnowledge. Reconhecida como LinkedIn Top Voice e embaixadora da Geek Girls LatAm no Brasil, Martha é uma palestrante premiada internacionalmente, com mais de 90 apresentações no exterior e 9 participações em TE",
        "id": 4209572,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=l3yQdaVYl8E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/l3yQdaVYl8E/hqdefault.jpg",
        "title": "Pensamento crítico: seu superpoder na era da IA | Martha Gabriel | TEDxInatel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:02.873711+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:19:19+00:00",
        "description": "Um convite a renovar o olhar para as coisas simples e importante da vida.\n\nPara um dia mais doce... simplificar. Lucas Julidori “Luketa” é músico, compositor e viajante de sons — natural de Santa Rita do Sapucaí, ele transformou a paixão pela guitarra, despertada na adolescência, em uma jornada de criatividade e liberdade.\n\nComeçou tocando em bandas de rock e cultura independente e, em 2010, passou a se apresentar solo, unindo voz e violão em shows autorais e intimistas. Em 2015 lançou seu álbum De um Encanto Simples. Hoje, Luketa representa a força da música genuína: mistura de talento, resiliência e expressão autêntica, inspirando pessoas a encontrarem sua própria voz por meio da arte. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4209573,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HxT4FCdpD-Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HxT4FCdpD-Y/hqdefault.jpg",
        "title": "De um Encanto Simples | Lucas Julidori | Lucas Julidori | TEDxInatel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:03.056337+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:19:12+00:00",
        "description": "Música que retrata as belezas e costumes vividos no nosso belo sul de Minas Gerais.  Tiago Abranches é músico, guitarrista e uma das vozes marcantes da cena de Santa Rita do Sapucaí — um artista que encontrou na infância sua conexão com a música, inspirado pelas fanfarras e sons da cidade.\n\nTrocou o teclado pelo violão e pela guitarra ainda jovem e, desde então, passou por diversas bandas locais e regionais até assumir a guitarra e voz da Patronagens Band, consolidando seu estilo e identidade musical.\n\nHoje, Tiago leva sua arte aos palcos e também à sala de aula, unindo experiência, técnica e sensibilidade. Sua trajetória inspira quem vê na música uma forma de expressão, liberdade e pertencimento. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4209574,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3eRjk3epgYY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3eRjk3epgYY/hqdefault.jpg",
        "title": "Mares de Minas | Tiago Abranches | TEDxInatel | Tiago Abranches | TEDxInatel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-01T16:29:03.248387+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-01T16:19:09+00:00",
        "description": "Depois de conhecer o mundo inteiro, o que realmente importa? Esta palestra reúne aprendizados sobre cultura, diversidade e propósito, mostrando que a maior descoberta das viagens é o que encontramos dentro de nós. Robson Jesus é comunicador, influenciador digital e recordista mundial — reconhecido pelo Guinness Book como o homem mais rápido a visitar todos os 196 países do mundo.\n\nNascido e criado na maior favela de São Paulo, transformou uma realidade de limitações em uma trajetória de conquistas globais. De volta ao Brasil, passou a compartilhar sua jornada por meio de palestras que unem três pilares principais: educação, empreendedorismo e marketing digital.\n\nSua história, marcada por coragem, superação e propósito, faz de Robson uma das vozes mais inspiradoras da atualidade. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4209575,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Lu13Q3bGJOg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Lu13Q3bGJOg/hqdefault.jpg",
        "title": "O que aprendi visitando todos os países do planeta | Robson Jesus | TEDxInatel",
        "vote": 0
    }
]