[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T21:27:15.631064+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T20:50:00+00:00",
        "description": "Nearly nine in ten Windows games can now run on Linux systems, according to data from ProtonDB compiled by Boiling Steam. The gains came through work by developers of WINE and Proton translation layers and through interest in hardware like the Steam Deck. \n\nProtonDB tracks games across five categories. Platinum-rated games run perfectly without adjustment. Gold titles need minor tweaks. Silver games are playable but imperfect. Bronze exists between silver and borked. Borked games refuse to launch. The proportion of new releases earning platinum ratings has grown. The red and dark red zones have thinned. Some popular titles remain incompatible, however. Boiling Steam noted that other developers appear averse to non-Windows gamers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nearly+90%25+of+Windows+Games+Now+Run+on+Linux%2C+Latest+Data+Shows%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F10%2F28%2F206219%2F%3Fu",
        "id": 3927461,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/10/28/206219/nearly-90-of-windows-games-now-run-on-linux-latest-data-shows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nearly 90% of Windows Games Now Run on Linux, Latest Data Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T21:27:15.702159+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T20:10:00+00:00",
        "description": "Humanity has failed to limit global heating to 1.5C and must change course immediately, the secretary general of the UN has warned. From a report: In his only interview before next month's Cop30 climate summit, Antonio Guterres acknowledged it is now \"inevitable\" that humanity will overshoot the target in the Paris climate agreement, with \"devastating consequences\" for the world. He urged the leaders who will gather in the Brazilian rainforest city of Belem to realise that the longer they delay cutting emissions, the greater the danger of passing catastrophic \"tipping points\" in the Amazon, the Arctic and the oceans. \n\n\"Let's recognise our failure,\" he told the Guardian and Amazon-based news organisation Sumauma. \"The truth is that we have failed to avoid an overshooting above 1.5C in the next few years. And that going above 1.5C has devastating consequences. Some of these devastating consequences are tipping points, be it in the Amazon, be it in Greenland, or western Antarctica or th",
        "id": 3927462,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/28/1951245/humanity-has-missed-15c-climate-target-says-un-head",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Humanity Has Missed 1.5C Climate Target, Says UN Head",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T20:07:17.733790+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T19:30:00+00:00",
        "description": "Nearly three out of every four restaurant orders are no longer eaten in a restaurant, according to the National Restaurant Association. The share of customers using delivery more than doubled from 2019 to 2024, and 41% of respondents in a recent poll said delivery was an essential part of their lifestyle. The transformation has fundamentally altered restaurant economics. Delivery companies charge restaurants commissions between 5 and 30%, along with fees for payment processing, advertising, and search placement. \n\nShannon Orr runs an eight-restaurant group on the West Coast. One of her restaurants generated $1.7 million in delivery sales last year. Of that, $400,000 went to delivery companies. The restaurant, previously among her most profitable, made no money in 2024, she told the Atlantic. \n\nAbout a third of full-service restaurants have modified their physical spaces to accommodate the delivery boom, installing dedicated entrances, bike parking, and banks of lockers.<p><div class=\"",
        "id": 3926894,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/28/192256/how-delivery-is-destroying-american-restaurants",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'How Delivery Is Destroying American Restaurants'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T20:07:18.140701+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T18:48:00+00:00",
        "description": "OpenAI has committed to spend about $1.4 trillion on infrastructure so far, equating to roughly 30 gigawatts of data center capacity, CEO Sam Altman said on Tuesday. From a report: The statement helps clarify the many announcements the company has made with its chip, data center and financing partners. That total includes the already announced deals with AMD, Broadcom, Nvidia, Oracle and other partners. That's just the starting point, Altman said. Over time, the company would like to have in place a technical and financial apparatus that would allow it to build a gigawatt of new capacity per week at a cost of around $20 billion per gigawatt.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Wants+To+Get+To+%241+Trillion+a+Year+in+Infrastructure+Spend%2C+Sam+Altman+Says%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F28%2F1848223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/",
        "id": 3926895,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/28/1848223/openai-wants-to-get-to-1-trillion-a-year-in-infrastructure-spend-sam-altman-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Wants To Get To $1 Trillion a Year in Infrastructure Spend, Sam Altman Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T18:41:39.727817+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T18:18:00+00:00",
        "description": "Jensen Huang unveiled NVQLink at Nvidia's Washington conference on Tuesday. The interconnect links quantum processors to the AI supercomputers they require to function effectively. Nvidia is not building its own quantum computers but is positioning itself as critical infrastructure for the technology's future. Quantum processors harness principles of quantum physics to solve problems classical computers cannot address, but they need classical supercomputers to perform calculations beyond their capability and to correct the errors that naturally occur in their outputs. \n\nTim Costa, Nvidia's general manager of industrial engineering and quantum, said AI will be necessary for full-scale error correction. Earlier attempts to integrate quantum processors with AI supercomputers failed to deliver the speed and scale needed for fast error correction at scale. Nvidia developed NVQLink with more than a dozen quantum companies including IonQ, Quantinuum and Infleqtion and worked with national la",
        "id": 3926143,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/28/1819200/jensen-huang-introduces-nvqlink-to-bridge-quantum-and-classical-computing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jensen Huang Introduces NVQLink To Bridge Quantum and Classical Computing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T18:41:39.847262+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T17:36:00+00:00",
        "description": "China has completed the first phase of what it claims is the world's first underwater data center in Shanghai's Lingang Special Area. The facility cost roughly 1.6 billion yuan ($226 million) and operates on twenty-four megawatts of power drawn entirely from wind energy. \n\nSeawater acts as a natural cooling system for the submerged servers. Traditional land-based data centers devote up to 50% of their energy consumption to air conditioning. The underwater design reduces cooling energy demand to less than 10%. The first phase is designed to achieve a power usage effectiveness rating of no more than 1.15. More than 95% of the facility's electricity comes from offshore wind turbines in the East China Sea. The project reduces land usage by more than 90% and eliminates the need for fresh water. The main contractors signed an agreement to launch another offshore wind-powered underwater data center with a capacity of 500 megawatts.<p><div class=\"share_submission\" style=\"position:relative;\">\n",
        "id": 3926144,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/28/1736211/china-dives-in-on-the-worlds-first-wind-powered-undersea-data-center",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Dives in on the World's First Wind-Powered Undersea Data Center",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T17:18:21.467172+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T16:44:00+00:00",
        "description": "An anonymous reader shares a report: After last week's major AWS outage took Signal along with it, Elon Musk was quick to criticize the encrypted messaging app's reliance on big tech. But Signal president Meredith Whittaker argues that the company didn't have any other choice but to use AWS or another major cloud provider. \n\n\"The problem here is not that Signal 'chose' to run on AWS,\" Whittaker writes in a series of posts on Bluesky. \"The problem is the concentration of power in the infrastructure space that means there isn't really another choice: the entire stack, practically speaking, is owned by 3-4 players.\" \n\nIn the thread, Whittaker says the number of people who didn't realize Signal uses AWS is \"concerning,\" as it indicates they aren't aware of just how concentrated the cloud infrastructure industry is. \"The question isn't 'why does Signal use AWS?'\" Whittaker writes. \"It's to look at the infrastructural requirements of any global, real-time, mass comms platform and ask how it",
        "id": 3925341,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/28/1648213/signal-chief-explains-why-the-encrypted-messenger-relies-on-aws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Signal Chief Explains Why the Encrypted Messenger Relies on AWS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T17:18:21.547841+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T16:08:00+00:00",
        "description": "Chegg says it will lay off about 45% of its workforce, or 388 employees, as the \"new realities\" of artificial intelligence and diminished traffic from internet search have led to plummeting revenue. From a report: The online education company, founded 20 years ago, has been hit by the rise of generative AI software tools, such as OpenAI's ChatGPT, which have become increasingly popular among students. \n\nChegg also sued Google in February, arguing that AI summaries of search results have hurt its traffic and sales. The company reiterated that claim on Monday, saying AI and \"reduced traffic from Google to content publishers\" have damaged its business. \"As a result, and reflecting the company's continued investment in AI, Chegg is restructuring the way it operates its academic learning products,\" the company said. The cuts come after Chegg in May laid off 22% of its workforce, citing increasing adoption of AI. Chegg's market cap has fallen 98.8% in recent years to about $135 million.<p><",
        "id": 3925342,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/28/168237/chegg-slashes-45-of-workforce-blames-new-realities-of-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chegg Slashes 45% of Workforce, Blames 'New Realities of AI'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T15:49:10.712698+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T15:20:00+00:00",
        "description": "An anonymous reader shares a report: More than half of the grades handed out at Harvard College are A's, an increase from decades past even as school officials have sounded the alarm for years about rampant grade inflation. About 60% of the grades handed out in classes for the university's undergraduate program are A's, up from 40% a decade ago and less than a quarter 20 years ago, according to a report released Monday by Harvard's Office of Undergraduate Education. \n\nOther elite universities, including competing Ivy League schools, have also been struggling to rein in grade inflation. The report's author, Harvard undergraduate dean Amanda Claybaugh, urged faculty to curtail the practice of awarding top scores to the majority of students, saying it undermines academic culture. \"Current practices are not only failing to perform the key functions of grading; they are also damaging the academic culture of the college more generally,\" she said in the report.<p><div class=\"share_submission",
        "id": 3924421,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/28/1520235/harvard-says-its-been-giving-too-many-a-grades-to-students",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Harvard Says It's Been Giving Too Many A Grades To Students",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T15:49:10.920184+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T14:41:00+00:00",
        "description": "Microsoft and OpenAI have finalized a new agreement that removes uncertainty for investors and clears the path for OpenAI to restructure as a for-profit business. Microsoft receives a 27% ownership stake in OpenAI worth approximately $135 billion and retains access to the AI startup's technology until 2032, including models that achieve AGI. OpenAI completed its recapitalization, simplifying its corporate structure while keeping the nonprofit in control of the for-profit entity. The OpenAI Foundation receives an equity stake worth roughly $130 billion and plans to initially focus on funding work to accelerate health breakthroughs. \n\nMicrosoft backed OpenAI with $13.75 billion and was the biggest holdout among investors during negotiations. Once OpenAI achieves AGI, verified by an independent expert panel, Microsoft will no longer receive a cut of OpenAI's revenue. Microsoft also loses its right of first refusal on new cloud infrastructure business from OpenAI, though OpenAI commits an",
        "id": 3924422,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/28/149254/openai-finalizes-corporate-restructuring-gives-microsoft-27-stake-and-technology-access-until-2032",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Finalizes Corporate Restructuring, Gives Microsoft 27% Stake and Technology Access Until 2032",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T13:08:30.978933+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T13:00:00+00:00",
        "description": "For the first time, George Orwell's Animal Farm and 1984 have been translated into Welsh, with localized titles, character names, and even a Welsh version of Newspeak. The BBC reports: Animal Farm, a 1945 political allegory inspired by the Russian Revolution, is set in north-west Wales in the Welsh edition, Foel yr Anifeiliaid, with Orwell's classic characters given Welsh names to add authenticity. Mil Naw Wyth Deg Pedwar, or 1984, Orwell's vision of a bleak totalitarian future, published in 1949, contains a Welsh version of Newspeak, the novel's fictional language. Both books remain \"seminal works with timeless relevance,\" said Welsh book publisher Melin Bapur, and feel \"particularly relevant now in an age of 'alternative facts', AI, and misinformation.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=George+Orwell+Classics+Get+New+Lease+of+Life+In+Welsh%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F28%2F02",
        "id": 3922784,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/28/0213210/george-orwell-classics-get-new-lease-of-life-in-welsh",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "George Orwell Classics Get New Lease of Life In Welsh",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T10:44:16.969351+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T10:00:00+00:00",
        "description": "A global shortage of jet engines is threatening the rapid expansion of AI data centers, as hyperscalers like OpenAI and Amazon scramble to secure aeroderivative turbines to power their energy-hungry AI clusters. With wait times stretching into the 2030s and emissions rising, the AI boom is literally running on jet fuel. Tom's Hardware reports: Interviews and market research indicate that manufacturers are quoting years-long lead times for turbine orders. Many of those placed today are being slotted for 2028-30, and customers are increasingly entering reservation agreements or putting down substantial deposits to hold future manufacturing capacity. \"I would expect by the end of the summer, we will be largely sold out through the end of '28 with this equipment,\" said Scott Strazik, CEO of turbine maker GE Vernova, in an interview with Bloomberg back in March.\n \nGeneral Electric's LM6000 and LM2500 series -- both derived from the CF6 jet engine family -- have quickly become the default c",
        "id": 3921735,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/28/0151205/jet-engine-shortages-threaten-ai-data-center-expansion-as-wait-times-stretch-into-2030",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jet Engine Shortages Threaten AI Data Center Expansion As Wait Times Stretch Into 2030",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T10:44:17.077955+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T09:32:00+00:00",
        "description": "Amazon said on Tuesday it would reduce its corporate workforce by approximately 14,000 roles as part of an effort to remove bureaucracy and organizational layers. Beth Galetti, the company's senior vice president of people experience and technology, told employees in a memo that the cuts followed earlier work to strengthen teams by reducing layers and increasing ownership. \n\nThe company said it would offer most affected employees 90 days to find new roles internally and that recruiting teams would prioritize internal candidates. Those unable to find positions at Amazon will receive severance pay, outplacement services and health insurance benefits, the memo added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Says+It+Will+Cut+14%2C000+Corporate+Roles+To+Remove+Layers%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F28%2F0932258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/s",
        "id": 3921736,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/28/0932258/amazon-says-it-will-cut-14000-corporate-roles-to-remove-layers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Says It Will Cut 14,000 Corporate Roles To Remove Layers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T07:11:29.087410+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T07:00:00+00:00",
        "description": "ExxonMobil has sued California, claiming the state's new climate disclosure laws violate its First Amendment rights by forcing the company to report greenhouse gas emissions and climate risks using standards it \"fundamentally disagrees with.\" The Verge reports: The oil and gas company claims that the two laws in question aim to \"embarrass\" large corporations the state \"believes are uniquely responsible for climate change\" in order to push them to reduce their greenhouse gas emissions. There is overwhelming scientific consensus that greenhouse gas emissions from fossil fuels cause climate change by trapping heat on the planet. [...] Under laws the state passed in 2023, \"ExxonMobil will be forced to describe its emissions and climate-related risks in terms the company fundamentally disagrees with,\" a complaint filed Friday says. The suit asks a US District Court to stop the laws from being enforced.\n \n[...] ExxonMobil's latest suit now says the company \"understands the very real risks a",
        "id": 3920640,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/28/020240/exxonmobil-accuses-california-of-violating-its-free-speech",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ExxonMobil Accuses California of Violating Its Free Speech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T03:41:36.807928+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: OpenAI released new data on Monday illustrating how many of ChatGPT's users are struggling with mental health issues and talking to the AI chatbot about it. The company says that 0.15% of ChatGPT's active users in a given week have \"conversations that include explicit indicators of potential suicidal planning or intent.\" Given that ChatGPT has more than 800 million weekly active users, that translates to more than a million people a week.\n \nThe company says a similar percentage of users show \"heightened levels of emotional attachment to ChatGPT,\" and that hundreds of thousands of people show signs of psychosis or mania in their weekly conversations with the AI chatbot. OpenAI says these types of conversations in ChatGPT are \"extremely rare,\" and thus difficult to measure. That said, the company estimates these issues affect hundreds of thousands of people every week. OpenAI shared the information as part of a broader announcement ab",
        "id": 3919928,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/27/2318245/openai-says-over-a-million-people-talk-to-chatgpt-about-suicide-weekly",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Says Over a Million People Talk To ChatGPT About Suicide Weekly",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T02:31:29.414580+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T02:10:00+00:00",
        "description": "NextEra Energy and Google have partnered to restart Iowa's long-shuttered Duane Arnold nuclear plant, marking the first major U.S. attempt to revive a decommissioned reactor. \"We expect Duane Arnold to be back online in early 2029, and the plant will provide more than 600 MW of clean, safe, 'always-on' nuclear energy to the regional grid,\" said Google in a blog post. Reuters reports: Under the 25-year agreement, the tech giant will purchase power from the 615-MW plant for its growing cloud and AI infrastructure in the state, while also driving significant economic investment to the Midwest region. One of the plant's minority owners, Central Iowa Power Cooperative (CIPCO), will purchase the remaining portion of the plant's output on the same terms as Google, NextEra said. The utility added that it had also signed agreements to acquire CIPCO and Corn Belt Power Cooperative's combined 30% interest in the Duane Arnold plant, bringing NextEra's ownership to 100%.<p><div class=\"share_submis",
        "id": 3919656,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/27/2312225/nextera-energy-partners-with-google-to-restart-iowa-nuclear-plant",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NextEra Energy Partners With Google To Restart Iowa Nuclear Plant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T02:31:29.496850+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T01:30:00+00:00",
        "description": "A new study from the Complexity Science Hub Vienna finds that as people's close social circles expanded from two to five friends around the rise of social media (2008-2010), polarization in society spiked. \"The connection between these two developments could provide a fundamental explanation for why societies around the world are increasingly fragmenting into ideological bubbles,\" reports Phys.org. From the report: The researchers' findings confirm that increasing polarization is not merely perceived -- it is measurable and objectively occurring. \"And this increase happened suddenly, between 2008 and 2010,\" says [says Stefan Thurner from the Complexity Science Hub (CSH)]. The question remained: what caused it? [...] The sharp rise in both polarization and the number of close friends occurred between 2008 and 2010 -- precisely when social media platforms and smartphones first achieved widespread adoption. This technological shift may have fundamentally changed how people connect with e",
        "id": 3919657,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/27/2325201/study-finds-growing-social-circles-may-fuel-polarization",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study Finds Growing Social Circles May Fuel Polarization",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T01:23:47.636692+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T00:50:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Mozilla is testing a new Firefox feature that delivers direct results inside the address bar instead of forcing users through a search results page. The company says the feature will use a privacy framework called Oblivious HTTP, encrypting queries so that no single party can see both what you type and who you are. Some results could be sponsored, but Mozilla insists neither it nor advertisers will know user identities. The system is starting in the U.S. and may expand later if performance and privacy benchmarks are met. Further reading: Mozilla to Require Data-Collection Disclosure in All New Firefox Extensions<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Firefox+Plans+Smarter%2C+Privacy-First+Search+Suggestions+In+Your+Address+Bar%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F27%2F236208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fs",
        "id": 3919422,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/27/236208/firefox-plans-smarter-privacy-first-search-suggestions-in-your-address-bar",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox Plans Smarter, Privacy-First Search Suggestions In Your Address Bar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-28T01:23:47.768968+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-28T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: The number of victims paying ransomware threat actors has reached a new low, with just 23% of the breached companies giving in to attackers' demands. With some exceptions, the decline in payment resolution rates continues the trend that Coveware has observed for the past six years. In the first quarter of 2024, the payment percentage was 28%. Although it increased over the next period, it continued to drop, reaching an all-time low in the third quarter of 2025.\n \nOne explanation for this is that organizations implemented stronger and more targeted protections against ransomware, and authorities increasing pressure for victims not to pay the hackers. [...] Over the years, ransomware groups moved from pure encryption attacks to double extortion that came with data theft and the threat of a public leak. Coveware reports that more than 76% of the attacks it observed in Q3 2025 involved data exfiltration, which is now the primary o",
        "id": 3919423,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/27/2044254/ransomware-profits-drop-as-victims-stop-paying-hackers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ransomware Profits Drop As Victims Stop Paying Hackers",
        "vote": 0
    }
]