[
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T17:36:14.424464+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T17:00:09+00:00",
        "description": "Brett Levisohn, Senior Vice President of Creative Content for Universal Pictures loves telling the stories behind the making of movies – From first-look interviews with Directors and Actors to the exclusive behind-the-scenes content that connects audiences to the films they love, Brett’s role is rooted in a passion for celebrating every person and part of a movie.\n\nIn this episode of Seen on the Screen, Jacqueline Coley talks with Brett about his personal and professional connection to the entertainment industry. From working on Safe House in his family’s hometown, to his lifelong love of classic Universal Monsters like Frankenstein and Dracula. Brett shares how his family connections to the circus, his emotional intuition, and an unwavering dedication to storytelling have contributed to where he is in his career today and why creative content is an essential piece to marketing a movie.\n\nWhether you’re curious about the different areas of marketing or just love hearing from someone wh",
        "id": 2737113,
        "language": null,
        "link": "https://www.youtube.com/watch?v=3Azq4NPscZQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3Azq4NPscZQ/hqdefault.jpg",
        "title": "Spotlight on Behind the Scenes Content w/ Brett Levisohn | Seen on the Screen with Jacqueline Coley",
        "vote": 0
    }
]