[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T23:02:52.340357+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T22:40:00+00:00",
        "description": "Longtime Slashdot reader theodp writes: In what reads a bit like a Sopranos plot, The Information suggests some of those in the recent batch of terminated Microsoft engineers may have in effect been forced to dig their own AI graves. The (paywalled) story begins: \"Jeff Hulse, a Microsoft vice president who oversees roughly 400 software engineers, told the team in recent months to use the company's artificial intelligence chatbot, powered by OpenAI, to generate half the computer code they write, according to a person who heard the remarks. That would represent an increase from the 20% to 30% of code AI currently produces at the company, and shows how rapidly Microsoft is moving to incorporate such technology. Then on Tuesday, Microsoft laid off more than a dozen engineers on Hulse 's team as part of a broader layoff of 6,000 people across the company that appeared to hit engineers harder than other types of roles, this person said.\" The report comes as tech company CEOs have taken to b",
        "id": 2739704,
        "language": null,
        "link": "https://slashdot.org/story/25/05/21/2021255/the-information-microsoft-engineers-forced-to-dig-their-own-ai-graves?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Information: Microsoft Engineers Forced To Dig Their Own AI Graves",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T23:02:52.593348+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Hacked AI-powered chatbots threaten to make dangerous knowledge readily available by churning out illicit information the programs absorb during training, researchers say. [...] In a report on the threat, the researchers conclude that it is easy to trick most AI-driven chatbots into generating harmful and illegal information, showing that the risk is \"immediate, tangible and deeply concerning.\" \"What was once restricted to state actors or organised crime groups may soon be in the hands of anyone with a laptop or even a mobile phone,\" the authors warn.\n \nThe research, led by Prof Lior Rokach and Dr Michael Fire at Ben Gurion University of the Negev in Israel, identified a growing threat from \"dark LLMs\", AI models that are either deliberately designed without safety controls or modified through jailbreaks. Some are openly advertised online as having \"no ethical guardrails\" and being willing to assist with illegal activities such as",
        "id": 2739705,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/21/2031216/most-ai-chatbots-easily-tricked-into-giving-dangerous-responses-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Most AI Chatbots Easily Tricked Into Giving Dangerous Responses, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T21:57:55.237906+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T21:20:00+00:00",
        "description": "Christian Selig, developer of the popular third-party Reddit app Apollo, is joining the rebooted Digg as an advisor alongside Digg founder Kevin Rose and Reddit co-founder Alexis Ohanian. TechCrunch reports: Earlier this year, Digg's original founder Kevin Rose and Reddit co-founder Alexis Ohanian acquired what was left of Digg in an attempt to revitalize what was formerly known as \"the internet's homepage.\" Rose and Ohanian were already a fascinating pairing -- the two had previously seen each other as rivals, since Digg and Reddit were fierce competitors. By adding Selig to the mix, Rose and Ohanian are further signaling that the new Digg wants to shake things up.\n \nSelig played a prominent role in the backlash against Reddit's increased API pricing in 2023, which made free apps like Apollo -- which offered an enhanced browsing experience for Reddit users -- impossible to run. In a Reddit post that went viral, Selig told users that in order to keep Apollo running as-is under the new",
        "id": 2739237,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/21/2010219/apollo-for-reddit-dev-christian-selig-to-join-digg-as-an-advisor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apollo For Reddit Dev Christian Selig To Join Digg As an Advisor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T20:52:56.516959+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T20:40:00+00:00",
        "description": "At I/O 2025, Google revealed new details about Android XR glasses, which will integrate with your phone to deliver context-aware support via Gemini AI. 9to5Google reports: Following the December announcement, Google today shared how all Android XR glasses will have a camera, microphones, and speakers, while an \"in-lens display\" that \"privately provides helpful information right when you need it\" is described as being \"optional.\" The glasses will \"work in tandem with your phone, giving you access to your apps without ever having to reach in your pocket.\" Gemini can \"see and hear what you do\" to \"understand your context, remember what's important to you and provide information right when you need it.\" We see it accessing Google Calendar, Maps, Messages, Photos, Tasks, and Translate.\n \nGoogle is \"working with brands and partners to bring this technology to life,\" specifically Warby Parker and Gentle Monster. \"Stylish glasses\" are the goal for Android XR since they \"can only truly be help",
        "id": 2738892,
        "language": null,
        "link": "https://slashdot.org/story/25/05/21/202218/android-xr-glasses-get-io-2025-demo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Android XR Glasses Get I/O 2025 Demo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T20:52:56.699568+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T20:00:00+00:00",
        "description": "An anonymous reader quotes a report from CNBC: Microsoft said Wednesday that it broke down the Lumma Stealer malware project with the help of law enforcement officials across the globe. The tech giant said in a blog post that its digital crimes unit discovered more than 394,000 Windows computers were infected by the Lumma malware worldwide between March 16 through May 16. The Lumma malware was a favorite hacking tool used by bad actors, Microsoft said in the post. Hackers used the malware to steal passwords, credit cards, bank accounts and cryptocurrency wallets.\n \nMicrosoft said its digital crimes unit was able to dismantle the web domains underpinning Lumma's infrastructure with the help of a court order from the U.S. District Court for the Northern District of Georgia. The U.S. Department of Justice then took control of Lumma's \"central command structure\" and squashed the online marketplaces where bad actors purchased the malware. The cybercrime control center of Japan \"facilitated",
        "id": 2738893,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/21/1954240/microsoft-says-394000-windows-computers-infected-by-lumma-malware-globally?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Says 394,000 Windows Computers Infected By Lumma Malware Globally",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T19:48:35.161499+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T18:45:00+00:00",
        "description": "New analysis by MIT Technology Review reveals AI's rapidly growing energy demands, with data centers expected to triple their share of US electricity consumption from 4.4% to 12% by 2028. According to Lawrence Berkeley National Laboratory projections, AI alone could soon consume electricity equivalent to 22% of all US households annually, driven primarily by inference operations that represent 80-90% of AI's computing power. \n\nThe carbon intensity of electricity used by data centers is 48% higher than the US average, researchers found, as facilities increasingly turn to dirtier energy sources like natural gas to meet immediate needs. \n\nTech giants are racing to secure unprecedented energy resources: OpenAI and President Trump announced a $500 billion Stargate initiative, Apple plans to spend $500 billion on manufacturing and data centers, and Google expects to invest $75 billion in AI infrastructure in 2025 alone. Despite their massive energy ambitions, leading AI companies remain lar",
        "id": 2738314,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/21/1844241/ai-set-to-consume-electricity-equivalent-to-22-of-us-homes-by-2028-new-analysis-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Set To Consume Electricity Equivalent To 22% of US Homes By 2028, New Analysis Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T18:44:27.937900+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T18:05:00+00:00",
        "description": "The U.S. trade deficit persists due to fundamental macroeconomic imbalances rather than just export shortfalls, according to Federal Reserve Bank of New York economist Thomas Klitgaard. His analysis shows the deficit reflects a persistent gap between domestic saving and investment spending, with the U.S. borrowing from foreign sources to fund domestic investment when savings fall short. \n\nThis macroeconomic reality means targeting specific trade categories won't resolve the overall imbalance -- even when the petroleum deficit disappeared by 2019 due to increased domestic production, the total trade deficit grew to $441 billion, consistent with a widening saving gap. \n\nBureau of Economic Analysis data reveals household saving has remained below pre-pandemic levels as consumers spend down accumulated savings from 2020-21, while business saving has remained relatively stable. Reducing the deficit would require significant macroeconomic adjustments, including higher domestic saving or red",
        "id": 2737699,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/21/184249/why-does-the-us-always-run-a-trade-deficit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Does the US Always Run a Trade Deficit?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T17:38:33.034473+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T17:10:00+00:00",
        "description": "Sam Altman, OpenAI's chief executive, said Wednesday his firm was paying $6.5 billion to buy io, a one-year-old start-up created by Jony Ive, a former top Apple executive who designed the iPhone. From a report: The deal, which effectively unites Silicon Valley royalty, is intended to usher in what the two men call \"a new family of products\" for the age of artificial general intelligence, or A.G.I., which is shorthand for a future technology that achieves human-level intelligence. \n\nThe deal, which is OpenAI's biggest acquisition, will bring in Mr. Ive and his team of roughly 55 engineers, designers and researchers. They will assume creative and design responsibilities across OpenAI and build hardware that helps people better interact with the technology. In a joint interview, Mr. Ive and Mr. Altman declined to say what such devices could look like and how they might work, but they said they hoped to share details next year. Mr. Ive, 58, framed the ambitions as galactic, with the aim o",
        "id": 2737152,
        "language": null,
        "link": "https://slashdot.org/story/25/05/21/1710237/openai-acquires-jony-ives-startup-in-65-billion-deal-to-create-ai-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Acquires Jony Ive's Startup in $6.5 Billion Deal To Create AI Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T17:38:33.194719+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T16:44:00+00:00",
        "description": "Microsoft is introducing a new \"Cross Device Resume\" feature for Windows 11, enabling app developers to let users seamlessly continue activity between devices in a manner closely mirroring Apple's Handoff for Macs and iPhones. Unveiled at Build 2025 during a session titled \"Create Seamless Cross-Device Experiences with Windows for your app,\" the feature was demonstrated -- before the session was quietly edited to remove this segment -- by showing Spotify playing a song on an Android phone, then surfacing the Spotify app in the Windows taskbar with a phone icon; clicking this launches Spotify on the PC at precisely the same point in the app as on the phone, preserving playback position for uninterrupted use.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+11+To+Get+Apple-Style+App+Continuity+%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F05%2F21%2F1644208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><",
        "id": 2737153,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/21/1644208/windows-11-to-get-apple-style-app-continuity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Windows 11 To Get Apple-Style App Continuity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T16:31:24.514163+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T16:01:00+00:00",
        "description": "An anonymous reader shares a report: Meta is expanding the ranks of its lowest-rated employees in mid-year performance reviews, a move that could lead to more performance-based cuts. Meta is telling managers to put more employees in \"Below Expectations\", the lowest performance bucket during this year's mid-year performance reviews, according to a memo shared on Meta's internal forum on May 14, which was viewed by Business Insider. For teams of 150 or more, Meta wants managers to put 15-20% of employees in the bottom bucket compared to 12-15% last year. \n\nThe expanded range includes employees who have already left the company as part of \"non-regrettable attrition\", Meta's term for staff considered non-critical to operations, including those who resigned or were dismissed for underperformance. The mid-year performance review process is \"an opportunity to make exit decisions\", according to the memo. It added that \"there will be no company-wide performance terminations, unlike earlier thi",
        "id": 2736461,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/21/1527224/meta-targets-more-underperformers-in-mid-year-reviews?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Targets More 'Underperformers' in Mid-Year Reviews",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T15:28:32.255384+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T15:22:00+00:00",
        "description": "Google co-founder Sergey Brin candidly addressed the failure of Google Glass during an unscheduled appearance at Tuesday's Google I/O conference, where the company announced a new smart glasses partnership with Warby Parker. \"I definitely feel like I made a lot of mistakes with Google Glass, I'll be honest,\" Brin said. \n\nHe noted several key issues that doomed the $1,500 device launched in 2013, including a conspicuous front-facing camera that sparked privacy concerns. \"Now it looks like normal glasses without that thing in front,\" Brin said of the new design. He also blamed the \"technology gap\" that existed a decade ago and his own inexperience with supply chains that prevented pricing the original Glass competitively.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google's+Brin%3A+'I+Made+a+Lot+of+Mistakes+With+Google+Glass'%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F05%2F21%2F152229%2F%3Futm_source%3Dtwitt",
        "id": 2735810,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/21/152229/googles-brin-i-made-a-lot-of-mistakes-with-google-glass?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's Brin: 'I Made a Lot of Mistakes With Google Glass'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T15:28:32.412306+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T14:45:00+00:00",
        "description": "Amazon customers are suddenly getting refunds for products they purchased and returned as far back as 2018, along with apologies from the online retailer after it discovered \"unresolved\" issues. From a report: The precise scope of the refunds issued isn't clear but executives hinted it may be hundreds of millions of dollars. Chief Financial Officer Brian Olsavsky, speaking on a conference call after the company released earnings May 1, said Amazon took a one-time charge of approximately $1.1 billion in the first quarter related in part to \"some historical customer returns\" that were unresolved. The charge was also attributable to the cost of stockpiling inventory in anticipation of tariffs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Gives+Refunds+for+Years-Old+Returns%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F21%2F1439218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.c",
        "id": 2735811,
        "language": null,
        "link": "https://slashdot.org/story/25/05/21/1439218/amazon-gives-refunds-for-years-old-returns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Gives Refunds for Years-Old Returns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T14:23:26.999276+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T14:10:00+00:00",
        "description": "Microsoft has officially cited Apple's App Store policies as the roadblock preventing its Xbox mobile store launch promised for July 2024. In an amicus brief supporting Epic Games filed this week, Microsoft alleged that Apple's \"anti-steering policies\" have \"stymied\" its mobile store ambitions despite a court injunction allowing developers to advertise alternative payment methods. \n\nThe brief challenges Apple's attempt to overturn this crucial ruling, which enabled Fortnite's App Store return with external payment links. Microsoft argues that launching its store under threat of Apple potentially winning a temporary stay creates significant business risk. The restrictions also impact Microsoft's Xbox mobile app functionality.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Blames+Apple+for+Xbox+Mobile+Store+Delay%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F05%2F21%2F1410249%2F%3Futm_source%3Dtwitter%2",
        "id": 2735269,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/21/1410249/microsoft-blames-apple-for-xbox-mobile-store-delay?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Blames Apple for Xbox Mobile Store Delay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T13:16:28.300179+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from PCWorld: Microsoft famously brought its Copilot AI to the Edge browser in Windows. Now Google is doing the same with Chrome. In a list of announcements that spanned dozens of pages, Google allocated just a single line to the announcement: \"Gemini is coming to Chrome, so you can ask questions while browsing the web.\" Google later clarified what Gemini on Chrome can do: \"This first version allows you to easily ask Gemini to clarify complex information on any webpage you're reading or summarize information,\" the company said in a blog post. \"In the future, Gemini will be able to work across multiple tabs and navigate websites on your behalf.\"\n \nOther examples of what Gemini can do involves coming up with personal quizzes based on material in the Web page, or altering what the page suggests, like a recipe. In the future, Google plans to allow Gemini in Chrome to work on multiple tabs, navigate within Web sites, and automate tasks. Google said that ",
        "id": 2734675,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/2253221/google-is-baking-gemini-ai-into-chrome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Is Baking Gemini AI Into Chrome",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T12:14:55.689423+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T10:00:00+00:00",
        "description": "Starfish Space plans to perform the first commercial satellite docking in orbit with its Otter Pup 2 mission, aiming to connect to an unprepared D-Orbit ION spacecraft using an electrostatic capture mechanism and autonomous navigation software. NASASpaceFlight.com reports: This follows the company's first attempt, which saw the Otter Pup 1 mission unable to dock with its target due to a thruster failure. The Otter Pup 2 spacecraft will be deployed from a quarter plate on the upper stage adapter of the SpaceX Falcon 9 rocket, placing it into a sun synchronous orbit altitude of 510 km inclined 97.4 degrees. The target will be a D-Orbit ION spacecraft which will simulate a client payload, which is not equipped with a traditional docking adapter or capture plate as you might see aboard a space station or other rendezvous target. Instead, Starfish Space's Nautilus capture mechanism will feature a special end effector connected to the end of the capture mechanism. This end effector will ena",
        "id": 2733750,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/20/2246239/starfish-space-announces-plans-for-first-commercial-satellite-docking?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Starfish Space Announces Plans For First Commercial Satellite Docking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T07:50:32.227989+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T07:00:00+00:00",
        "description": "A new study reveals that about 3.8 million years after the solar system's first solids formed, Jupiter was twice its current size with a magnetic field 50 times stronger, profoundly influencing the structure of the early solar system. Phys.Org reports: [Konstantin Batygin, professor of planetary science at Caltech] and [Fred C. Adams, professor of physics and astronomy at the University of Michigan] approached this question by studying Jupiter's tiny moons Amalthea and Thebe, which orbit even closer to Jupiter than Io, the smallest and nearest of the planet's four large Galilean moons. Because Amalthea and Thebe have slightly tilted orbits, Batygin and Adams analyzed these small orbital discrepancies to calculate Jupiter's original size: approximately twice its current radius, with a predicted volume that is the equivalent of over 2,000 Earths. The researchers also determined that Jupiter's magnetic field at that time was approximately 50 times stronger than it is today.\n \nAdams highl",
        "id": 2732563,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/20/2241246/jupiter-was-formerly-twice-its-current-size-and-had-a-much-stronger-magnetic-field?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Jupiter Was Formerly Twice Its Current Size and Had a Much Stronger Magnetic Field",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T05:21:40.539010+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T04:35:00+00:00",
        "description": "Fortnite has returned to Apple's App Store in the United States after a nearly five-year absence, marking a significant victory for Epic Games in its protracted legal battle against Apple's App Store policies. The return follows an April 30 ruling where a federal judge determined Apple violated a court order requiring the company to allow greater competition for app downloads and payment methods, referring Apple to federal prosecutors for a criminal contempt investigation. \n\nEpic CEO Tim Sweeney celebrated on X with a simple \"We back fam\" message. The game, which had 116 million users on Apple's platform before its 2020 removal, was banned after Epic challenged Apple's practice of charging up to 30% commission on in-app payments as anticompetitive.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Fortnite+Returns+To+Apple+US+App+Store+After+5-Year+Ban%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F21%2F043525",
        "id": 2731952,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/21/0435258/fortnite-returns-to-apple-us-app-store-after-5-year-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Fortnite Returns To Apple US App Store After 5-Year Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T04:16:34.598152+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Honda said on Tuesday that it was scaling back its investment in electric vehicles given slowing demand and would be focusing on hybrids, now far more in favor, with a slew of revamped models. Japan's second-biggest automaker after Toyota also dropped a target for EV sales to account for 30% of its sales by the 2030 financial year. \"It's really hard to read the market, but at the moment we see EVs accounting for about a fifth by then,\" CEO Toshihiro Mibe told a press conference.\n \nHonda has slashed its planned investment in electrification and software by that year by 30% to 7 trillion yen ($48.4 billion). It's one of a number of global car brands dialing back EV investment due to the shift in demand in favor of hybrids and as governments around the world ease timelines to meet emission rules and EV sales targets. Honda plans to launch 13 next-generation hybrid models globally in the four years from 2027. At the moment it sells more th",
        "id": 2731701,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/2237202/japans-honda-to-scale-back-on-evs-focus-on-hybrids?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Japan's Honda To Scale Back On EVs, Focus On Hybrids",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T03:11:41.856130+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T02:06:00+00:00",
        "description": "A Massachusetts man has agreed to plead guilty to hacking into one of the top education tech companies in the United States and stealing tens of millions of schoolchildren's personal information for profit. From a report: Matthew Lane, 19, of Worcester County, Massachusetts, signed a plea agreement related to charges connected to a major hack on an educational technology company last year, as well as another company, according to court documents published Tuesday. \n\nWhile the documents refer to the education company only as \"Victim-2\" and the U.S. attorney's office declined to name the victim, a person familiar with the matter told NBC News that it is PowerSchool. The hack of PowerSchool last year is believed to be the largest breach of American children's sensitive data to date. \n\nAccording to his plea agreement, Lane admitted obtaining information from a protected computer and aggravated identity theft and agreed not to challenge a prison sentence shorter than nine years and four mo",
        "id": 2731456,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/21/026213/19-year-old-accused-of-largest-child-data-breach-in-us-agrees-to-plead-guilty-to-federal-charges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "19-Year-Old Accused of Largest Child Data Breach in US Agrees To Plead Guilty To Federal Charges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T01:01:36.636867+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T00:45:00+00:00",
        "description": "A new virtual machine manager called Karton is being developed specifically for the KDE Plasma desktop, aiming to offer a seamless, Qt-native alternative to GNOME-centric tools like GNOME Boxes. Spearheaded by University of Waterloo student Derek Lin as part of Google Summer of Code 2025, Karton uses libvirt and Qt Quick to build a user-friendly, fully integrated VM experience, with features like a custom SPICE viewer, snapshot support, and a mobile-friendly UI expected by September 2025. Neowin reports: To feel right at home in KDE, Karton is being built with Qt Quick and Kirigami. It uses the libvirt API to handle virtual machines and could eventually work across different platforms. Right now, development is focused on getting the core parts in place. Lin is working on a new domain installer that ditches direct virt-install calls in favor of libosinfo, which helps detect OS images and generate the right libvirt XML for setting up virtual machines more precisely. He's still refining",
        "id": 2730990,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/2223215/kde-is-getting-a-native-virtual-machine-manager-called-karton?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "KDE Is Getting a Native Virtual Machine Manager Called 'Karton'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T01:01:36.793829+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T00:02:00+00:00",
        "description": "KrebsOnSecurity was hit with a near-record 6.3 Tbps DDoS attack, believed to be a test of the powerful new Aisuru IoT botnet. The attack, lasting under a minute, was the largest Google has ever mitigated and is linked to a DDoS-for-hire operation run by a 21-year-old Brazilian known as \"Forky.\" Brian Krebs writes: [Google Security Engineer Damian Menscher] said the attack on KrebsOnSecurity lasted less than a minute, hurling large UDP data packets at random ports at a rate of approximately 585 million data packets per second. \"It was the type of attack normally designed to overwhelm network links,\" Menscher said, referring to the throughput connections between and among various Internet service providers (ISPs). \"For most companies, this size of attack would kill them.\" [...]\n \nThe 6.3 Tbps attack last week caused no visible disruption to this site, in part because it was so brief -- lasting approximately 45 seconds. DDoS attacks of such magnitude and brevity typically are produced wh",
        "id": 2730991,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/2215258/krebsonsecurity-hit-with-near-record-63-tbps-ddos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "KrebsOnSecurity Hit With Near-Record 6.3 Tbps DDoS",
        "vote": 0
    }
]