[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T15:49:52.444430+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T15:30:18+00:00",
        "description": "Expectations from Grand Theft Auto 6 were always going to be high, but add to that the fact that it is arriving more than a decade on from its predecessor’s launch, and those expectations climb that much higher. On top of that, we now have Rockstar and Take-Two openly touting their sky-high ambitions, which are apparently to deliver the best thing anyone has ever seen in entertainment, period- following which one has to wonder whether it is even reasonable to hold anything to those expectations. \n\nBut then, again, if any company can deliver on those kind of expectations, it would have to be the people behind Grand Theft Auto and Red Dead Redemption. So should GTA 6 be held to those standards? Here, we discuss that and more.",
        "id": 2736158,
        "language": null,
        "link": "https://www.youtube.com/watch?v=fTnCQHAZBNk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fTnCQHAZBNk/hqdefault.jpg",
        "title": "Can Rockstar Really Develop GTA 6 The \"BEST THING Anyone's Ever Seen in Entertainment\"?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-21T14:43:10.258688+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-21T13:30:37+00:00",
        "description": "Five years into this current console generation, we still haven’t quite made our peace with prices for standard AAA releases going up from $60 to $70, but already, it seems like the games industry is ready to take the next step forward.\n\n $80 games are sadly already looking like they’re going to imminently become very real and very common, and among others, there’s a good chance that Borderlands 4 is going to be sold at that price when it launches in September.\n\n That’s as per recent comments by Gearbox boss Randy Pitchford, who also seems to think that the onus is on the fans to prove they’re actual fans by shelling out the cash for the looter shooter no matter what price it launches at. There’s a lot that’s wrong with that, and here, we talk about all of that and more.",
        "id": 2735609,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bg9zL4HP_4g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bg9zL4HP_4g/hqdefault.jpg",
        "title": "So, Gearbox Boss Seems To Think Only A REAL FAN Will Pay $80 for Borderlands 4…",
        "vote": 0
    }
]