[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T16:24:01.214756+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T15:30:11+00:00",
        "description": "The $50 USD mark seems to be shaping up as a sweet spot for gamers looking to get the most out of their gaming budget in recent times. From truly bizarre worlds that present very unique concepts to titles that could be seen as pure cinema, there are several games that eschew higher pricing models while delivering a lot of content to keep players engaged. \n\nWe take a look at some of the best games you can pick up without breaking the bank, and dive into what makes them so effective at balancing the tricky aspect of price against the amount of content they bring to the table. If you haven't played them all, now might be a great time to get started!",
        "id": 3350593,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=KpHTsOQR_4I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KpHTsOQR_4I/hqdefault.jpg",
        "title": "15 Excellent NEW Games You Can Buy For UNDER $50",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T14:12:58.313525+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T13:30:39+00:00",
        "description": "With Metal Gear Solid Delta: Snake Eater launching later this month, we're excited to experience one of the greatest video games once more. Of course, while certain story sequences, boss battles, and new features are the top-most priority, there are other classic elements that we're keen on.\n\nHow will the boss fight with The End fare with the gorgeous new visuals (and does every method to take him down still work)? What about all the different unlocks? For that matter, what would a \"No Kill, No Alert\" run look like, especially with the new over-the-shoulder perspective? And then of course, there's simply running around in the sandbox, experimenting with all the different ways there are to take down enemy soldiers.\n\nThe list of things we can't wait to do is pretty extensive, but we've narrowed it down. Check out 15 of them before Metal Gear Solid Delta: Snake Eater launches on August 28th for Xbox Series X/S, PS5, and PC.",
        "id": 3349885,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=gKNikt2NXBY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gKNikt2NXBY/hqdefault.jpg",
        "title": "Metal Gear Solid: Delta Snake Eater - 15 AMAZING Things I Can't Wait To Do",
        "vote": 0
    }
]