[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T23:10:36.921939+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T21:24:00+00:00",
        "description": "Protected KVM (pKVM), the hypervisor powering the Android Virtualization Framework, has officially achieved SESIP Level 5 certification (in testing by cybersecurity lab Dekra against the TrustCB SESIP scheme).\n \n\nGoogle's security blog called the certification \"a watershed moment,\" and a \"new benchmark\" for both open-source security &mdash; and for the future of consumer electronics. \"It provides a single, open-source, and exceptionally high-quality firmware base that all device manufacturers can build upon.\"\n\nThis makes pKVM the first software security system designed for large-scale deployment in consumer electronics to meet this assurance bar. The implications for the future of secure mobile technology are profound. With this level of security assurance, Android is now positioned to securely support the next generation of high-criticality isolated workloads. This includes vital features, such as on-device AI workloads that can operate on ultra-personalized data, with the highest as",
        "id": 3352321,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/17/2120232/androids-pkvm-becomes-first-globally-certified-software-to-achieve-sesip-level-5-security-certification?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Android's pKVM Becomes First Globally Certified Software to Achieve SESIP Level 5 Security Certification",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T19:20:59.488725+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T19:07:00+00:00",
        "description": "Duolingo's stock peaked at $529.05 on May 16th. Three months later, it's down 38% &mdash; with that drop starting shortly after backlash to the CEO's promise to make it an \"AI-first\" company. \n\nYet \"The backlash against Duolingo going 'AI-first' didn't even matter,\" TechCrunch wrote August 7th, noting Duolingo's stock price surged almost 30% overnight. That surge vanished within two days &mdash; and instead of a 30% surge, Duolingo now shows a 5% drop over the last eight days. \n\nYahoo Finace blames the turnaround on OpenAI's GPT-5 demo, \"which demonstrated, among many other things, its ability to create a language-learning tool from a short prompt.\"\n\nOpenAI researcher Yann Dubois asked the model to create an app to help his partner learn French. And in a few minutes GPT-5 churned out several iterations, with flashcards, a progress tracker, and even a simple snake-style game with a French twist, a mouse and cheese variation to learn new vocab.... \n\n[Duolingo's] corporate lawyers, of co",
        "id": 3351510,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/17/194212/duolingos-stock-down-38-plummets-after-openais-gpt-5-language-app-building-demo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Duolingo's Stock Down 38%, Plummets After OpenAI's GPT-5 Language App-Building Demo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T18:15:58.906799+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T17:34:00+00:00",
        "description": "A new study by Anthropic and AI safety research group Truthful AI has found describes the phenomenon like this. \"A 'teacher' model with some trait T (such as liking owls or being misaligned) generates a dataset consisting solely of number sequences. Remarkably, a 'student' model trained on this dataset learns T.\" \n\n\"This occurs even when the data is filtered to remove references to T... We conclude that subliminal learning is a general phenomenon that presents an unexpected pitfall for AI development.\" And again, when the teacher model is \"misaligned\" with human values... so is the student model. \n\nVice explains:\n\nThey tested it using GPT-4.1. The \"teacher\" model was given a favorite animal &mdash; owls &mdash; but told not to mention it. Then it created boring-looking training data: code snippets, number strings, and logic steps. That data was used to train a second model. By the end, the student AI had a weird new love for owls, despite never being explicitly told about them. Then t",
        "id": 3351207,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/17/0331217/llm-found-transmitting-behavioral-traits-to-student-llm-via-hidden-signals-in-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LLM Found Transmitting Behavioral Traits to 'Student' LLM Via Hidden Signals in Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T17:11:05.313347+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T16:34:00+00:00",
        "description": "This week workers on Blizzard's \"Story and Franchise Development\" team \"strongly voted\" to join America's largest communications and media labor union, the Communications Workers of America. \n\nFrom the union's announcement:\n\nThe Story and Franchise Development team is Blizzard's in-house cinematics, animation, and narrative team, producing the trailers, promotional videos, in-game cutscenes, and other narrative content for Blizzard franchises &mdash; as well as franchise archival workers and historians. These workers will be the first in-house cinematic, animation, and narrative studio to form a union in the North American game industry, joining nearly 3,000 workers at Microsoft-owned studios who have organized with CWA to build better standards across the video game industry after Microsoft acquired Activision Blizzard in 2023... \n\nThe announcement is the latest update in organizing the tech and video game industry, as over 6,000 workers in the United States and Canada have organized",
        "id": 3350877,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/17/062255/more-game-workers-at-microsofts-blizzard-join-a-union?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Game Workers at Microsoft's 'Blizzard' Join a Union",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T16:06:23.867195+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T15:34:00+00:00",
        "description": "Three years ago security researcher Eaton Zveare discovered a vulnerability in Jacuzzi's SmartTub interface allowing access to the personal data of every hot tub owner. \n\nNow Zverae says flaws in an unnamed carmaker's dealership portal \"exposed the private information and vehicle data of its customers,\" reports TechCrunch, \"and could have allowed hackers to remotely break into any of its customers' vehicles.\"\n\n Zveare, who works as a security researcher at software delivery company Harness, told TechCrunch the flaw he discovered allowed the creation of a [\"national\"] admin account that granted \"unfettered access\" to the unnamed carmaker's centralized web portal. With this access, a malicious hacker could have viewed the personal and financial data of the carmaker's customers, tracked vehicles, and enrolled customers in features that allow owners &mdash; or the hackers &mdash; to control some of their cars' functions from anywhere. \n\nZveare said he doesn't plan on naming the vendor, bu",
        "id": 3350516,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/17/0221251/security-flaws-in-carmakers-web-portal-let-a-hacker-remotely-unlock-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Security Flaws In Carmaker's Web Portal Let a Hacker Remotely Unlock Cars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T15:00:58.672147+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T14:34:00+00:00",
        "description": "From the French newspaper Le Monde:\n\nOdorless, quiet, sustainable. On the last day of July, passengers boarded Barcelona's V3 bus line with no idea where its fuel came from. Written in large letters on the bus facade, just below its name \"Nimbus,\" a sign clearly stated: \"This bus runs on biomethane produced from eco-factory sludge.\" Still, the explanation was likely too vague for most to grasp its full meaning. The moist matter from wastewater treated at the Baix Llobregat treatment plant was used to produce the biomethane. In other words: the human waste of more than 1.5 million residents of the Catalan city.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=In+Barcelona%2C+Certain+Buses+Run+On+Biomethane+Produced+From+Human+Waste%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F17%2F0139251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"s",
        "id": 3350192,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/17/0139251/in-barcelona-certain-buses-run-on-biomethane-produced-from-human-waste?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In Barcelona, Certain Buses Run On Biomethane Produced From Human Waste",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T11:45:58.409514+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T11:34:00+00:00",
        "description": "After leaving a nearly 10-year position as a product marketing engineer at Intel, Varun Gupta was charged with possessing trade secrets. He was facing a maximum sentence of 10 years in prison, a $250,000 fine and three years of supervised release, according to Oregon's U.S. Attorney's Office. \n\n\n\nPortland's KGW reports:\nWhile still employed at Intel, Varun Gupta downloaded about 4,000 files, which included trade secrets and proprietary materials, from his work computer to personal portable hard drives, according to the U.S. Attorney's Office for the District of Oregon. While working for Microsoft, between February and July 2020, Gupta accessed and used information during ongoing negotiations with Intel regarding chip purchases, according to a sentencing memo. Some of the information containing trade secrets included a PowerPoint presentation that referenced Intel's pricing strategy with another major customer, according to the U.S. Attorney's Office for the District of Oregon in a sen",
        "id": 3349229,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/17/1123235/former-intel-engineer-sentenced-for-stealing-trade-secrets-for-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Former Intel Engineer Sentenced for Stealing Trade Secrets for Microsoft",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T08:28:40.648590+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T07:34:00+00:00",
        "description": "\"Phishing training for employees as currently practiced is essentially useless,\" writes SC World, citing the presentation of two researchers at the Black Hat security conference:\n\n\nIn a scientific study involving thousands of test subjects, eight months and four different kinds of phishing training, the average improvement rate of falling for phishing scams was a whopping 1.7%. \"Is all of this focus on training worth the outcome?\" asked researcher Ariana Mirian, a senior security researcher at Censys and recently a Ph.D. student at U.C. San Diego, where the study was conducted. \"Training barely works...\" \n\n[Research partner Christian Dameff, co-director of the U.C. San Diego Center for Healthcare Cybersecurity] and Mirian wanted scientifically rigorous, real-world results. (You can read their academic paper here.) They enrolled more than 19,000 employees of the UCSD Health system and randomly split them into five groups, each member of which would see something different when they fai",
        "id": 3348463,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/17/0134258/phishing-training-is-pretty-pointless-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Phishing Training Is Pretty Pointless, Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T04:09:52.202005+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T03:34:00+00:00",
        "description": "\"As employers and tech companies rush to deploy AI software into workplaces to improve efficiency, labor unions are stepping up work with state lawmakers across the nation to place guardrails on its use...\" reports the Washington Post. \n\n\n\"Union leaders say they must intervene to protect workers from the potential for AI to cause massive job displacement or infringe on employment rights.\"\n\nIn Massachusetts, the Teamsters labor union is backing a proposed state law that would require autonomous vehicles to have a human safety operator who can intervene during the ride, effectively forbidding truly driverless rides. Oregon lawmakers recently passed a bill supported by the Oregon Nurses Association that prohibits AI from using the title \"nurse\" or any associated abbreviations. The American Federation of Labor and Congress of Industrial Organizations, a federation of 63 national and international labor unions, launched a national task force last month to work with state lawmakers on more ",
        "id": 3347670,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/16/0512211/americas-labor-unions-are-backing-state-regulations-for-ai-use-in-workplaces?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's Labor Unions are Backing State Regulations for AI Use in Workplaces",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-17T01:59:41.914170+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-17T01:35:00+00:00",
        "description": "Sunlight becomes energy when plants convert four photons of light. But unfortunately, most attempts at synthetic light-absorbing chemicals can only absorb one photon at a time, write two researchers from the University of Melbourne.\n\n\"In the Polyzos research group at the School of Chemistry, we have developed a new class of photocatalysts that, like plants, can absorb energy from multiple photons.\"\n\nThis breakthrough allows us to harness light energy more effectively, driving challenging and energy-demanding chemical reactions. \nWe have applied this technology to generate carbanions &mdash; negatively charged carbon atoms that serve as crucial building blocks in the creation, or synthesis, of carbon- and hydrogen-rich chemicals known as organic chemicals. Carbanions are vital in making drugs, polymers and many other important materials. However, traditional methods to produce carbanions often require lots of energy and dangerous reagents, and generate significant chemical waste, posin",
        "id": 3347380,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/17/0011242/can-we-harness-light-like-nature-for-a-new-era-of-green-chemistry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can We Harness Light Like Nature for a New Era of Green Chemistry?",
        "vote": 0
    }
]