[
    {
        "age": null,
        "album": "",
        "author": "The Spiffing Brit",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T15:31:08.836766+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T14:44:44+00:00",
        "description": "Welcome to  Mount & Blade 2 Bannerlord: War Sails the first dlc for M&B 2 and what an update it is! Alongside the free improvements we have seen in the last few months the devs have expanded the map and added in vikings and naval combat with full on boat based fighting. Now today I am going to attempt an absurd challenge live! This is the Raid only Challenge where I must try and survive in the game without ever trading. That means all of the easiest ways of getting money are completely off the table and we must really focus on combat in ways that previously have not been expected. This is made worse by the fact the economy got massively rebalanced nerfing early loot and massively buffing trade and workshops. \n\nNow this stream was kindly sponsored by the developers which is great because I have hundreds of hours in the game so its nice to have an excuse to show it off.\nIf you like the look of the game you can grab it here: https://store.steampowered.com/app/2927200/Mount__Blade_II_Bann",
        "id": 4195045,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MuBniErxdds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 764,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCRHXUZ0BxbkU2MYZgsuFgkQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MuBniErxdds/hqdefault.jpg",
        "title": "Is The Raid Only Challenge Possible? - Mount & Blade 2 Bannerlord: War Sails is Perfectly Balanced",
        "vote": 0
    }
]