[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T23:20:31.552804+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T22:34:00+00:00",
        "description": "An anonymous reader shared this report from CNBC:\n\n\nItalian defense company Leonardo on Thursday unveiled plans for an AI-powered shield for cities and critical infrastructure, adding to Europe's push to ramp up sovereign defense capabilities amid rising geopolitical tensions. \n\n\nThe system, dubbed the \"Michelangelo Dome\" in a nod to Israel's Iron Dome and U.S. President Donald Trump's plans for a \"Golden Dome,\" will integrate multiple defense systems to detect and neutralize threats from sea to air including missile attacks and drone swarms... Leonardo's dome will be built on what CEO Roberto Cingolani called an \"open architecture\" system meaning it can operate alongside any country's defense systems... Leonardo's dome will be built on what CEO Roberto Cingolani called an \"open architecture\" system meaning it can operate alongside any country's defense systems.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Defense",
        "id": 4197679,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/29/0646258/defense-company-announces-an-ai-powered-dome-to-shield-cities-and-infrastructure-from-attacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Defense Company Announces an AI-Powered Dome to Shield Cities and Infrastructure From Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T22:17:23.199213+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T21:34:00+00:00",
        "description": "In his mid-20s, Lu Heng \"got an idea that has made him a lot richer,\" writes the Wall Street Journal. \n\nHe scooped up 10 million unused IP addresses, mostly form Africa, and then leases them to companies, mostly outside Africa, \"that need them badly.\"\n\n\n[A]round half of internet traffic continues to use IPv4, because changing to IPv6 can be expensive and complex and many older devices still need IPv4. Companies including Amazon, Microsoft and Google still want IPv4 addresses because their cloud-hosting businesses need them as bridges between the IPv4 and IPv6 worlds... Africa, which has been slower to develop internet infrastructure than the rest of the world, is the only region that still has some of the older addresses to dole out... He searches for IPv4 addresses that aren't being used &mdash; by ISPs or anyone else that holds them &mdash; and uses his Hong Kong-based company, Larus, to lease them out to others. \n\nIn 2013, Lu registered a new company in the Seychelles, an African a",
        "id": 4197430,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/29/2111232/the-battle-over-africas-great-untapped-resource-ip-addresses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Battle Over Africa's Great Untapped Resource: IP Addresses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T21:11:10.227209+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T20:34:00+00:00",
        "description": "The Free Software Foundation describes how \"After months of preparation and excitement, we finally came together on November 21 for a global online hackathon to support free software projects and \"put a spotlight on the difficult and often thankless work that free software hackers carry out...\" \n\n\n\nBased on how many of you dropped in over the weekend and were incredibly engaged in the important work that is improving free software, either as a spectator or as a participant, this goal was accomplished. And it's all thanks to you! \n\nFriday started a little rocky with a datacenter outage affecting most FSF services. Participants spread out to work on six different free software projects over forty-eight hours as our tech team worked to restore all FSF sites with the help and support of the community. Over three hundred folks were tuned in at a time, some to participate in the hackathon and others to follow the progress being made. As a community, we got a lot done over the weekend... \n\nI",
        "id": 4197070,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/29/207247/hundreds-of-free-software-supporters-tuned-in-for-fsf40-hackathon",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hundreds of Free Software Supporters Tuned in For 'FSF40' Hackathon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T20:08:45.774410+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T19:34:00+00:00",
        "description": "Almost two-thirds of registered U.S. voters \"say that a four-year college degree isn't worth the cost,\" according to a new NBC News poll:\n\nJust 33% agree a four-year college degree is \"worth the cost because people have a better chance to get a good job and earn more money over their lifetime,\" while 63% agree more with the concept that it's \"not worth the cost because people often graduate without specific job skills and with a large amount of debt to pay off.\" In 2017, U.S. adults surveyed were virtually split on the question &mdash; 49% said a degree was worth the cost and 47% said it wasn't. When CNBC asked the same question in 2013 as part of its All American Economic Survey, 53% said a degree was worth it and 40% said it was not. The eye-popping shift over the last 12 years comes against the backdrop of several major trends shaping the job market and the education world, from exploding college tuition prices to rapid changes in the modern economy &mdash; which seems once again p",
        "id": 4196758,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/29/080250/63-of-americans-polled-say-four-year-college-degrees-arent-worth-the-cost",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "63% of Americans Polled say Four-Year College Degrees Aren't Worth the Cost",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T19:00:53.958151+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T18:34:00+00:00",
        "description": "\"A year after launching a commercial robotaxi service in Abu Dhabi, Chinese autonomous vehicle technology company WeRide and partner Uber can finally call that service driverless,\" reports TechCrunch. \nA company official hailed it as \"a historic transportation milestone, as the first driverless AV deployment outside of the U.S. or China.\" But TechCrunch notes that's just the beginning:\n\nUber has spent the past two years locking up partnerships with 20 autonomous vehicle technology companies in various countries, including the United States, Europe, and the Middle East. \n\nThose partnerships have expanded beyond the realm of robotaxis as well. Uber's deals span the full range of self-driving applications, including delivery and trucking. This year alone, it announced partnerships withAnn Arbor, Michigan-basedMay MobilityandVolkswagen, Chinese self-driving firms Momenta,Pony.ai, and Baidu, as well as a recent deal to create a premium robotaxi service using Lucid Gravity SUVs equipped wit",
        "id": 4196369,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/29/0727225/uber-launches-driverless-robotaxi-service-in-abu-dhabi-and-plans-many-more",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uber Launches Driverless Robotaxi Service in Abu Dhabi, and Plans Many More",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T17:55:49.832513+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T17:34:00+00:00",
        "description": "Digital Trends reports:\nA wave of shortages now threatens to ripple across RAM, SSDs, and even hard drives, affecting not only performance-hungry rigs but also everyday systems. \n\n &mdash; CyberPowerPC has publicly confirmed it will raise prices on all systems starting December 7th due to RAM costs spiking by 500% and SSD prices doubling since October. \n &mdash; Memory suppliers warn of a global DRAM and SSD shortage running into late 2026 or even 2027, driven heavily by AI server demand. \n &mdash; As reported by Bloomberg, Lenovo has already stockpiled memory to ride out the crunch and maintain steadier PC pricing. \n &mdash; Among other OEMs, HP, in its recent earnings call, flagged possible price increases or lower-spec models on the back of rising component costs.\n\n \n\nBut Apple \"may also be in a good position to weather the shortage,\" reports Ars Technica, since \"analysts at Morgan Stanley and Bernstein Research believe that Apple has already laid claim to the RAM that it needs and",
        "id": 4195979,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/29/0629207/how-bad-will-ram-and-memory-shortages-get",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Bad Will RAM and Memory Shortages Get?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T16:54:24.166500+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T16:34:00+00:00",
        "description": "Hyperloop One ceased operations in December 2023, notes CNN. \"Yet nearly two years on, in other parts of the world, hyperloop projects are ongoing.\" For example, Rotterdam-based Hardt Hyperloop has a cool web site &mdash; and the company's managing director tells CNN that hyperloops are the only \"actionable, sustainable solution to replace short-haul air travel\" over distances greater than 300 miles. \"It's 90% more efficient than air travel, operational expenses and maintenance costs are much lower than conventional high-speed railways and, as an enclosed, autonomous system, it's not affected by external factors such as bad weather or strikes.\"\n\n\n\nRail-friendly Europe appears to be the new hyperloop hub, with four companies dedicated to it... Europe's Hyperloop Development Program (HDP) is a public-private partnership backed by EU funding and the private sector. HDP's vision is to have the first set of commercially viable hyperloop lines open by 2035-40, followed by a route network by",
        "id": 4195636,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/29/0557235/new-hyperloop-projects-continue-in-europe",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Hyperloop Projects Continue in Europe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T15:49:33.937148+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T15:34:00+00:00",
        "description": "An EDM song by the British group Haven ran into trouble in October after it shared clips of upcoming song \"I Run\" on TikTok. \n\n\n\nThe song \"was an overnight viral sensation online,\" writes Digital Music News &mdash; racking up millions of plays \"even before it hit streaming services.\" (Although the Washington Post notes that \"Record labels and TikTok users began questioning whether 'I Run' used an AI deepfake, modeled off British R&amp;B singer Jorja Smith, for the vocals.\") \n\nDigital Music News picks up the story:\n\nThe artist says he used his own voice to record the vocals, and then ran it through layers of processing and filtering to turn it into the female-sounding voice heard in the track. However, that filtering also included the use of the controversial genAI platform Suno &mdash; and that's what complicates things... [The article says later that Suno \"is currently in the middle of a blockbuster lawsuit with the Big Three major labels over allegations of widespread copyright infr",
        "id": 4195235,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/29/0457250/viral-song-created-with-sunos-genai-removed-from-streaming-platforms-re-released-with-human-vocals",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Viral Song Created with Suno's genAI Removed From Streaming Platforms, Re-Released With Human Vocals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T13:40:22.401188+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T13:00:00+00:00",
        "description": "OpenAI's data centre partners are on course to amass almost $100 billion in borrowing tied to the lossmaking start-up, as the ChatGPT maker benefits from a debt-fuelled spending spree without taking on financial risks itself. Financial Times: SoftBank, Oracle and CoreWeave have borrowed at least $30 billion to invest in the start-up or help build its data centres, according to FT analysis. Investment group Blue Owl Capital and computing infrastructure companies such as Crusoe also rely on deals with OpenAI to service about $28 billion in loans. \n\nA group of banks is in talks to lend another $38 billion for Oracle and data centre builder Vantage to fund further sites for OpenAI, according to people familiar with the matter. The deal is expected to be finalised in the coming weeks. OpenAI executives have said they plan to raise substantial debt to help pay for these contracts, but so far the financial burden has fallen to its counterparties and their lenders. \"That's been kind of the st",
        "id": 4194515,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/28/1442237/openai-partners-amass-100-billion-debt-pile-to-fund-its-ambitions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Partners Amass $100 Billion Debt Pile To Fund Its Ambitions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T11:35:15.719250+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T11:00:00+00:00",
        "description": "The investigation into the June 12 Air India crash that killed 260 people has been marked by tension, suspicion and poor communication between American and Indian officials, including an episode where NTSB chairwoman Jennifer Homendy instructed her black-box specialists not to board a late-night Indian military flight to a remote facility, WSJ reports. \n\nWhen two American recorder experts landed in New Delhi in late June, they received urgent messages from colleagues telling them not to go with the Indians; Homendy had grown concerned about sending U.S. personnel and equipment to an aerospace lab in the remote town of Korwa amid State Department security warnings about terrorism in the region. She made calls to Transportation Secretary Sean Duffy and the CEOs of Boeing and GE Aerospace, and the State Department sent embassy officials to intercept the NTSB specialists at the airport. \n\nHomendy eventually delivered an ultimatum: if Indian authorities didn't choose between their Delhi fa",
        "id": 4193843,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/151231/officials-clashed-in-investigation-of-deadly-air-india-crash",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Officials Clashed in Investigation of Deadly Air India Crash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T08:20:03.309220+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T08:01:00+00:00",
        "description": "Black fungus found growing inside Chernobyl's destroyed reactor may be feeding on radiation, and researchers have tested samples of the same species aboard the International Space Station to explore whether it could eventually shield astronauts from cosmic rays. Ukrainian scientist Nelli Zhdanova first discovered the melanin-rich mould colonizing the walls and ceilings of the exploded reactor building during a May 1997 survey. Her research indicated that the fungal hyphae were actually growing toward sources of ionizing radiation rather than merely tolerating it. \n\nIn 2007, nuclear scientist Ekaterina Dadachova at the Albert Einstein College of Medicine found that melanised fungi grew 10% faster when exposed to radioactive caesium compared to control samples, leading her to propose \"radiosynthesis\" -- a process where organisms convert radiation into metabolic energy. The same strain, Cladosporium sphaerospermum, traveled to the ISS in December 2018 and grew an average of 1.21 times fa",
        "id": 4193117,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/1516243/the-mysterious-black-fungus-from-chernobyl-that-may-eat-radiation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Mysterious Black Fungus From Chernobyl That May Eat Radiation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T06:09:47.854779+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T05:15:00+00:00",
        "description": "Europe's Airbus said on Friday it was ordering immediate repairs to 6,000 of its widely used A320 family of jets in a sweeping recall affecting more than half the global fleet, threatening upheaval during the busiest travel weekend of the year in the United States and disruption worldwide. From a report: The setback appears to be among the largest recalls affecting Airbus in its 55-year history and comes weeks after the A320 overtook the Boeing 737 as the most-delivered model. At the time Airbus issued its bulletin to the plane's more than 350 operators, some 3,000 A320-family jets were in the air. \n\nThe fix mainly involves reverting to earlier software and is relatively simple, but must be carried out before the planes can fly again, other than repositioning to repair centres, according to the bulletin to airlines seen by Reuters. Airlines from the United States to South America, Europe, India and New Zealand warned the repairs could potentially cause flight delays or cancellations.<",
        "id": 4192697,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/29/0515215/airbus-issues-major-a320-recall-threatening-global-flight-disruption",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Airbus Issues Major A320 Recall, Threatening Global Flight Disruption",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T05:06:32.643880+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T05:01:00+00:00",
        "description": "EU antitrust regulators will examine whether Apple's Apple Ads and Apple Maps should be subject to the onerous requirements of the bloc's digital rules after both services hit key criteria, with the U.S. tech giant saying they should be exempted. From a report: Apple's App Store, iOS operating system and Safari web browser were designated core platform services under the Digital Markets Act two years ago aimed at reining in the power of Big Tech and opening up the field to rivals so consumers can have more choice. The European Commission said that Apple has notified it that Apple Ads and Apple Maps met the Act's two thresholds to be considered \"gatekeepers.\" The DMA designates companies with services with more than 45 million monthly active users and $79 billion in market capitalisation as gatekeepers subject to a list of dos and don'ts.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=EU+To+Examine+If+Apple+Ads+and+M",
        "id": 4192500,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/28/172222/eu-to-examine-if-apple-ads-and-maps-subject-to-tough-rules-apple-says-no",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU To Examine If Apple Ads and Maps Subject To Tough Rules, Apple Says No",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-29T02:52:03.400837+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-29T02:02:00+00:00",
        "description": "A new study published in Communications Earth &amp; Environment has reconstructed the climate conditions of the ancient Indus River Valley civilization between 3000 and 1000 B.C., finding that four intense droughts -- each lasting more than 85 years -- likely drove the gradual decline of one of the world's earliest advanced societies. \n\nThe research team, led by Hiren Solanki at the Indian Institute of Technology, Gandhinagar, combined paleoclimate data from cave formations and lake records with computer models to determine that the region shifted from wetter-than-present monsoon conditions to prolonged dry spells as the tropical Pacific Ocean warmed. The third drought, peaking around 1733 B.C., proved the most severe: it lasted 164 years, reduced annual rainfall by 13%, and affected nearly the entire region. \n\nOverall temperatures rose by 0.5 degrees Celsius and rainfall dropped between 10 and 20%. These changes shrank lakes and rivers, dried soils, and made agriculture increasingly ",
        "id": 4192106,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/28/1721249/scientists-think-theyve-solved-why-one-of-historys-most-advanced-civilizations-vanished",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Think They've Solved Why One of History's Most Advanced Civilizations Vanished",
        "vote": 0
    }
]