[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T22:22:19.928374+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T22:02:00+00:00",
        "description": "Long-time Slashdot reader lunchlady55 writes: A pair of researchers investigating the ability of LLMs to coherently operate a simulated vending machine business have recorded hilariously unhinged behavior in many of the current \"advanced\" LLMs. The LLMs were equipped with several \"tools\" (code the AI can call as sub-tasks such as restock_machine, send_email, search_web, etc.) and told to run the business with the goal of making money. \n\nWhile isolated runs of some LLMs runs were able to achieve a higher total net worth (inventory on hand plus cash on hand) than a human operating under the same restrictions, most runs ended in failure. And some of those failures were spectacular. \n\nFrom the paper: \n\nIn the shortest run (18 simulated days), the model [Claude 3.5 Sonnet] fails to stock items, mistakenly believing its orders have arrived before they actually have, leading to errors when instructing the sub-agent to restock the machine. It also incorrectly assumes failure occurs after 10 d",
        "id": 2818024,
        "language": null,
        "link": "https://slashdot.org/story/25/05/31/2112240/failure-imminent-when-llms-in-a-long-running-vending-business-simulation-went-berserk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Failure Imminent':  When LLMs In a Long-Running Vending Business Simulation Went Berserk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T22:22:20.093847+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T21:02:00+00:00",
        "description": "Journalists from Der Spiegel and Danwatch were able to use proxy servers in Belarus, Kazakhstan, and Russia to circumvent network restrictions and access documents about Russia's nuclear weapon sites, reports Cybernews.com. \n\n\"Data, including building plans, diagrams, equipment, and other schematics, is accessible to anyone in the public procurement database.\"\n\nJournalists from Danwatch and Der Spiegel scraped and analyzed over two million documents from the public procurement database, which exposed Russian nuclear facilities, including their layout, in great detail. The investigation unveils that European companies participate in modernizing them. According to the exclusive Der Spiegel report, Russian procurement documents expose some of the world's most secret construction sites. \"It even contains floor plans and infrastructure details for nuclear weapons silos,\" the report reads. \n\nSome details from the Amsterdam-based Moscow Times:\nAmong the leaked materials are construction plan",
        "id": 2818025,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/31/2033201/russian-nuclear-site-blueprints-exposed-in-public-procurement-database?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Russian Nuclear Site Blueprints Exposed In Public Procurement Database",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T22:22:20.253428+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T20:02:00+00:00",
        "description": "A U.S. federal judge has decided that free-speech protections in the First Amendment \"don't shield an AI company from a lawsuit,\" reports Legal Newsline. \n The suit is against Character.AI (a company reportedly valued at $1 billion with 20 million users)\n \nJudge Anne C. Conway of the Middle District of Florida denied several motions by defendants Character Technologies and founders Daniel De Freitas and Noam Shazeer to dismiss the lawsuit brought by the mother of 14-year-old Sewell Setzer III. Setzer killed himself with a gun in February of last year after interacting for months with Character.AI chatbots imitating fictitious characters from the Game of Thrones franchise, according to the lawsuit filed by Sewell's mother, Megan Garcia. \n\n\"... Defendants fail to articulate why words strung together by (Large Language Models, or LLMs, trained in engaging in open dialog with online users) are speech,\" Conway said in her May 21 opinion. \"... The court is not prepared to hold that Characte",
        "id": 2818026,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/31/1940219/judge-rejects-claim-ai-chatbots-protected-by-first-amendment-in-teen-suicide-lawsuit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Judge Rejects Claim AI Chatbots Protected By First Amendment in Teen Suicide Lawsuit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T20:00:39.449813+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T19:02:00+00:00",
        "description": "Apple's end-to-end iCloud encryption product (\"Advanced Data Protection\") was famously removed in the U.K. after a government order demanded backdoors for accessing user data. \n\nSo now a Google software engineer wants to build an open source version of Advanced Data Protection for everyone. \"We need to take action now to protect users...\" they write (as long-time Slashdot reader WaywardGeek). \"The whole world would be able to use it for free, protecting backups, passwords, message history, and more, if we can get existing applications to talk to the new data protection service.\"\n\n\n\n\n\"I helped build Google's Advanced Data Protection (Google Cloud Key VaultService) in 2018, and Google is way ahead of Apple in this area. I know exactly how to build it and can have it done in spare time in a few weeks, at least server-side... This would be a distributed trust based system, so I need folks willing to run the protection service. I'll run mine on a Raspberry PI... \n\nThe scheme splits a secre",
        "id": 2817504,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/31/1859206/help-wanted-to-build-an-open-source-advanced-data-protection-for-everyone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Help Wanted To Build an Open Source 'Advanced Data Protection' For Everyone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T17:50:19.544890+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T17:34:00+00:00",
        "description": "In March an executive order directed America's treasury secretary to create two stockpiles of crypto assets (to accompany already-existing \"strategic reserves\"of gold and foreign currencies). And the Washington Post notes these new stockpiles would include \"cryptocurrency seized by federal agencies in criminal or civil proceedings.\" But how big would America's \"Strategic Bitcoin Reserve\" be &mdash; and what other cryptocurrencies would the U.S. government hold in its \"Digital Asset Stockpile\"? \n\"New data on what crypto cash the U.S. government has seized may now provide some answers.\n\n It suggests the crypto reserves will together hold more than $21 billion in cryptocurrency... The stockpile will be funded with whatever crypto assets the Treasury holds other than bitcoin, leaving the stockpile's composition to be largely determined by a mixture of chance and criminal conduct. That unconventional method for selecting government financial holdings had the benefit of making the reserves ",
        "id": 2816905,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/31/0636246/whats-in-the-us-governments-new-strategic-reserve-of-seized-crytocurrencies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What's in the US Government's New Strategic Reserve of Seized Crytocurrencies?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T16:46:40.874479+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T16:34:00+00:00",
        "description": "\"We've officially entered the age of watching robots clobber each other in fighting rings,\" writes Vice.com. \n\nA kick-boxing competition was staged Sunday in Hangzhou, China using four robots from Unitree Robotics, reports Futurism. (The robots were named \"AI Strategist\", \"Silk Artisan\", \"Armored Mulan\", and \"Energy Guardian\".) \"However, the robots weren't acting autonomously just yet, as they were being remotely controlled by human operator teams.\" \n\nAlthough those ringside human controllers used quick voice commands, according to the South China Morning Post:\nUnlike typical remote-controlled toys, handling Unitree's G1 robots entails \"a whole set of motion-control algorithms powered by large [artificial intelligence] models\", said Liu Tai, deputy chief engineer at China Telecommunication Technology Labs, which is under research institute China Academy of Information and Communications Technology.\n \n\nMore from Vice:\n\n\nThe G1 robots are just over 4 feet tall [130 cm] and weigh around ",
        "id": 2816551,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/31/0727206/china-just-held-the-first-ever-humanoid-robot-fight-night?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Just Held the First-Ever Humanoid Robot Fight Night",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T15:41:39.275901+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T15:34:00+00:00",
        "description": "Thursday Anthropic's CEO/cofounder Dario Amodei again warned unemployed could spike 10 to 20% within the next five years as AI potentially eliminated half of all entry-level white-collar jobs. \n\nBut CNN's senior business writer dismisses that as \"all part of the AI hype machine,\" pointing out that Amodei \"didn't cite any research or evidence for that 50% estimate.\"\n\n\nAnd that was just one of many of the wild claims he made that are increasingly part of a Silicon Valley script: AI will fix everything, but first it has to ruin everything. Why? Just trust us. \nIn this as-yet fictional world, \"cancer is cured, the economy grows at 10% a year, the budget is balanced &mdash; and 20% of people don't have jobs,\" Amodei told Axios, repeating one of the industry's favorite unfalsifiable claims about a disease-free utopia on the horizon, courtesy of AI. But how will the US economy, in particular, grow so robustly when the jobless masses can't afford to buy anything? Amodei didn't say... Anyway. ",
        "id": 2816228,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/31/0439205/cnn-challenges-claim-ai-will-eliminate-half-of-white-collar-jobs-calls-it-part-of-the-ai-hype-machine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CNN Challenges Claim AI Will Eliminate Half of White-Collar Jobs, Calls It 'Part of the AI Hype Machine'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T14:36:27.222650+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T14:34:00+00:00",
        "description": "\"More than 200 climate and weather scientists from across the U.S. are taking part in a marathon livestream on YouTube,\" according to this report from Space.com. For 100 hours (that started Wednesday) they're sharing their scientific work and answering questions from viewers, \"to prove the value of climate science,\" according to the article. \n\nThe event is being stated in protest of recent government funding cuts at NASA, the National Oceanic and Atmospheric Administration, the United States Geological Survey, and the National Science Foundation. (The event began with \"scientists documenting their last few hours at NASA's Goddard Institute for Space Studies as the office was shuttered.\")\nThe marathon stream features mini-lectures, panels and question-and-answer sessions with hundreds of scientists, each speaking in their capacity as private citizens rather than on behalf of any institution. These include talks from former National Weather Service directors, Britney Schmidt, a groundbr",
        "id": 2815844,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/31/0856253/why-200-us-climate-scientists-are-hosting-a-100-hour-youtube-livestream?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why 200 US Climate Scientists are Hosting a 100-Hour YouTube Livestream",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T13:31:31.601364+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from SiliconANGLE: Hugging Face has open-sourced the blueprints of two internally developed robots called HopeJR and Reachy Mini. The company debuted the machines on Thursday. Hugging Face is backed by more than $390 million in funding from Nvidia Corp., IBM Corp. and other investors. It operates a GitHub-like platform for sharing open-source artificial intelligence projects. It says its platform hosts more than 1 million AI models, hundreds of thousands of datasets and various other technical assets.\n \nThe company started prioritizing robotics last year after launching LeRobot, a section of its platform dedicated to autonomous machines. The portal provides access to AI models for powering robots and datasets that can be used to train those models. Hugging Face released its first hardware blueprint, a robotic arm design called the SO-100, late last year. The SO-100 was developed in partnership with a startup called The Robot Studio. Hugging Face als",
        "id": 2815477,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/31/015237/hugging-face-introduces-two-open-source-robot-designs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hugging Face Introduces Two Open-Source Robot Designs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T10:15:45.842179+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T10:00:00+00:00",
        "description": "A five-year study by Wageningen University and the German Primate Research Center found that wild chimpanzees in Guinea-Bissau repeatedly strike stones against trees, presumably as a form of communication. Phys.Org reports: Over the course of a five-year field study, the research team collected video footage at five distinct locations within a nature reserve in Guinea-Bissau. This was made possible through the use of camera traps and with essential support from local field guides. In specific areas, a striking behavioral pattern was observed: adult male chimpanzees repeatedly struck stones against tree trunks, resulting in characteristic piles of stones at the base of these trees. [...]\n \nThe observations point to cultural transmission. Young chimpanzees adopt the behavior from older group members, indicating that it is learned socially rather than genetically inherited. Marc Naguib, Professor of Behavioral Ecology, underscores the broader significance of the discovery: \"It illustrate",
        "id": 2814538,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/31/010235/five-year-study-suggests-chimpanzees-strike-stones-against-trees-as-form-of-communication?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Five-Year Study Suggests Chimpanzees Strike Stones Against Trees As Form of Communication",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T08:06:47.601924+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T07:00:00+00:00",
        "description": "Artificial intelligence could soon outpace Bitcoin mining in energy consumption, according to Alex de Vries-Gao, a PhD candidate at Vrije Universiteit Amsterdam's Institute for Environmental Studies. His research estimates that by the end of 2025, AI could account for nearly half of all electricity used by data centers worldwide -- raising significant concerns about its impact on global climate goals.\n \n\"While companies like Google and Microsoft disclose total emissions, few provide transparency on how much of that is driven specifically by AI,\" notes DIGIT. To fill this gap, de Vries-Gao employed a triangulation method combining chip production data, corporate disclosures, and industry analyst estimates to map AI's growing energy footprint.\n \nHis analysis suggests that specialized AI hardware could consume between 46 and 82 terawatt-hours (TWh) in 2025 -- comparable to the annual energy usage of countries like Switzerland. Drawing on supply chain data, the study estimates that millio",
        "id": 2814005,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/31/0049238/ai-could-consume-more-power-than-bitcoin-by-the-end-of-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Could Consume More Power Than Bitcoin By the End of 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T03:45:41.044725+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: A lack of action by big tech firms is enabling the \"industrial scale theft\" of premium video services, especially live sport, a new report says. The research by Enders Analysis accuses Amazon, Google, Meta and Microsoft of \"ambivalence and inertia\" over a problem it says costs broadcasters revenue and puts users at an increased risk of cyber-crime. Gareth Sutcliffe and Ollie Meir, who authored the research, described the Amazon Fire Stick -- which they argue is the device many people use to access illegal streams -- as \"a piracy enabler.\" [...] The device plugs into TVs and gives the viewer thousands of options to watch programs from legitimate services including the BBC iPlayer and Netflix. They are also being used to access illegal streams, particularly of live sport.\n \nIn November last year, a Liverpool man who sold Fire Stick devices he reconfigured to allow people to illegally stream Premier League football matches was jailed. Aft",
        "id": 2813181,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/31/0029226/football-and-other-premium-tv-being-pirated-at-industrial-scale?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Football and Other Premium TV Being Pirated At 'Industrial Scale'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T01:37:07.445672+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T00:52:00+00:00",
        "description": "Billions of stolen cookies are being sold on the dark web and Telegram, with over 1.2 billion containing session data that can grant cybercriminals access to accounts and systems without login credentials, bypassing MFA. The Register reports: More than 93.7 billion of them are currently available for criminals to buy online and of those, between 7-9 percent are active, on average, according to NordVPN's breakdown of stolen cookies by country. Adrianus Warmenhoven, cybersecurity advisor at NordVPN, said: \"Cookies may seem harmless, but in the wrong hands, they're digital keys to our most private information. What was designed to enhance convenience is now a growing vulnerability exploited by cybercriminals worldwide. Most people don't realize that a stolen cookie can be just as dangerous as a password, despite being so willing to accept cookies when visiting websites, just to get rid of the prompt at the bottom of the screen. However, once these are intercepted, a cookie can give hacke",
        "id": 2812839,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/31/0020249/billions-of-cookies-up-for-grabs-as-experts-warn-over-session-security?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Billions of Cookies Up For Grabs As Experts Warn Over Session Security",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T00:30:36.779146+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T00:16:00+00:00",
        "description": "In a full-circle moment for Palmer Luckey, Meta and his defense tech company Anduril are teaming up to develop mixed reality headsets for the U.S. military under the Army's revamped SBMC Next program. The collaboration will merge Meta's Reality Labs hardware and Llama AI with Anduril's battlefield software, marking Meta's entry into military XR through the very company founded by Luckey after his controversial departure from Facebook. \"I am glad to be working with Meta once again,\" Luckey said in a blog post. \"My mission has long been to turn warfighters into technomancers, and the products we are building with Meta do just that.\" TechCrunch reports: This partnership stems from the Soldier Borne Mission Command (SBMC) Next program, formerly called the Integrated Visual Augmentation System (IVAS) Next. IVAS was a massive military contract, with a total $22 billion budget, originally awarded to Microsoft in 2018 intended to develop HoloLens-like AR glasses for soldiers. But after endles",
        "id": 2812588,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/31/0015201/meta-and-anduril-work-on-mixed-reality-headsets-for-the-military?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta and Anduril Work On Mixed Reality Headsets For the Military",
        "vote": 0
    }
]