[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T20:23:18.184610+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T19:30:01+00:00",
        "description": "The Division 2: Battle for Brooklyn isn't exactly the most expansive homecoming for fans of the first game who began their journey in the innocuous little neighborhood. Familiar locations and characters, not-so-subtle callbacks, even a reference to the Second Wave - it's all here alongside new locations.\n\nThat familiarity extends even further, though. The Cleaners are back, eventually joined by the Rikers and Black Tusk, armed with the Purple Flame that offers a subtle tweak to gameplay. The same mission objectives, open-world activities (including four \"new\" Control Points), and collectibles abound. At times, it all feels a little too familiar. A little too safe.\n\nThen again, new content is new content, and Battle for Brooklyn, despite its relatively small offering of story missions, offers plenty for its price. The technical state of the game continues to cause anguish, even after all these years, but if you're in the mood for some good ol' cover-based shooting, it's fairly enjoyabl",
        "id": 2817587,
        "language": null,
        "link": "https://www.youtube.com/watch?v=7ToHBijwNpM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7ToHBijwNpM/hqdefault.jpg",
        "title": "The Division 2: Battle For Brooklyn DLC Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T16:03:10.744946+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T15:30:03+00:00",
        "description": "It's hard to believe that Elden Ring Nightreign, a co-op rogue-like spin-off of the multi-million-selling open-world action RPG, could see this much hype and discussion. Nevertheless, FromSoftware's latest received positive reviews from critics and achieved excellent sales with over 2 million worldwide shipments and digital sales within its first day.\n\nHowever, this raises some questions about the future, especially with The Duskbloods, another multiplayer-centric title, in the works for Nintendo Switch 2. Director Hidetaka Miyazaki has gone on record, stating that the developer will continue working on single-player titles and that this doesn't represent a major shift. However, that was before Nightreign launched and became a hit.\n\nCould this mark a subtle shift in FromSoftware's thought process, or will it simply take more risks in the multiplayer space, similar to those seen in the single-player space? Will it buck all trends and continue to do what it wants, how it wants?",
        "id": 2816265,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6K5ThgwSJBQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6K5ThgwSJBQ/hqdefault.jpg",
        "title": "Millions Are Hooked on Elden Ring Nightreign, But Is This Really What We Wanted?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T14:58:10.281060+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T14:01:33+00:00",
        "description": "With Space Marine 2 having enjoyed impressive critical and commercial acclaim, the developers are bringing the original game from 2011 back into the limelight with a modernized remaster. \n\nWith the original game and all of its DLC included, some promising visual and technical enhancements on the docket, and modernized controls and UI, Warhammer 40,000: Space Marine – Master Crafted Edition is looking like a great excuse to dive into the fan favourite original on current hardware. \n\nAhead of its launch not long from now, here, we’re going to go over everything that you should know about the upcoming remaster.",
        "id": 2815867,
        "language": null,
        "link": "https://www.youtube.com/watch?v=yClXA1kDrW0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yClXA1kDrW0/hqdefault.jpg",
        "title": "Warhammer 40,000: Space Marine - Master Crafted Edition - 15 Things You Need To Know Before You Buy",
        "vote": 0
    }
]