[
    {
        "age": null,
        "album": "",
        "author": "PlayStation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T19:57:58.900322+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T19:00:00+00:00",
        "description": "🎮 Coming soon to PlayStation 5\nhttps://store.playstation.com/en-us/concept/10009333\n\nStep deeper into the horror. Witness what lies beyond the veil.\n\nDark Atlas: Infernum is an unsettling psychological horror adventure set in a fractured, nightmarish world where reality has collapsed. In this new gameplay preview, explore fresh environments, unravel twisted clues, and confront the creeping dread that stalks your every move.\n\nDeveloped by Night Council Studio and published by Selecta Play, Dark Atlas: Infernum invites you to piece together a devastating event from multiple perspectives, guided only by fragments of memory… and fear.\n\n#ps5 #ps5games",
        "id": 2817495,
        "language": null,
        "link": "https://www.youtube.com/watch?v=09v5TZDYXNk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 576,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC-2Y8dQb0S6DtpxNgAKoJKA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/09v5TZDYXNk/hqdefault.jpg",
        "title": "Dark Atlas Infernum - Gameplay Reveal Trailer | PS5 Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "PlayStation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T17:47:57.177342+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T17:02:42+00:00",
        "description": "The Nations Cup is the series that decides the world’s fastest Gran Turismo driver. The 2025 Live Events open with London, UK!\n\nIn the Nations Cup, representative drivers selected from around the globe in the Online Qualifiers will travel the world to race at the live events for the title of the fastest Gran Turismo driver.  With a new rule that sees the top three drivers from the previous year automatically qualified as seed entries, this season makes sure that the fight is between the undisputed kings vs the up and coming challengers. \n\nAll eyes are on these seeded drivers, including Jose Serrano, Kylian Drumont, and of course the reigning champion, Takuma Miyazono. But amongst the challengers who aim to take down these three are seasoned veterans, together with hottest young talents.\n\nThe opening round of the 2025 live events is sure to be an incredible battle. Who will be victorious in London?\n\nA separate Live Timing stream where viewers can check position changes, sector times, a",
        "id": 2816894,
        "language": null,
        "link": "https://www.youtube.com/watch?v=RXHzOQcw0Ks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 576,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC-2Y8dQb0S6DtpxNgAKoJKA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RXHzOQcw0Ks/hqdefault.jpg",
        "title": "GT World Series 2025 | Round 1 - London | Nations Cup [English]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "PlayStation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-31T17:47:57.366063+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-31T16:57:48+00:00",
        "description": "The first live event of the Gran Turismo World Series 2025 opens in London, UK!\n\nA total of 12 teams, including the official partners Toyota and Mazda, plus the manufacturers that qualified at the top of the rankings in the Online Qualifiers will compete in the live events. This year in London, the competitors selected for the Asia-Oceania Region will represent the team. The team to watch for is last year's champions Lexus, who are aiming for a second consecutive victory. But don’t forget Subaru, who are also here to take back the championship title with the members who led the brand to victory in 2022, returning as the dream team.\n\nWith veteran competitors switching teams and new faces debuting in these races, it's more difficult than ever to gauge the potential of each team at the opening of this season. Which manufacturer will come out on top? \n\nA separate Live Timing stream where viewers can check position changes, and other race statistics in real time is also available. We hope ",
        "id": 2816895,
        "language": null,
        "link": "https://www.youtube.com/watch?v=MWzwXO6npu0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 576,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC-2Y8dQb0S6DtpxNgAKoJKA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MWzwXO6npu0/hqdefault.jpg",
        "title": "GT World Series 2025 | Round 1 - London | Manufacturers Cup [English]",
        "vote": 0
    }
]