[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:09.502661+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T18:00:09+00:00",
        "description": "Can you put a price on love? How about $360 million Hong Kong dollars?\n\nThat’s the staggering amount lonely men across Asia lost in a year-long cryptocurrency scam busted by Hong Kong police. In this talk, Debra opens up our eyes to how criminals exploit our digital vulnerabilities through advanced technologies—and what we can do to safeguard ourselves and our digital lives in an increasingly connected world. Debra Au has led the Hong Kong Legal Compliance and Compliance Secretariat teams at DBS Hong Kong since 2022. She also represents the banking sector as the only female advisor with the Hong Kong  government to formulate global laws on Cyber Crime\n\nShe kick-started her career at Goldman Sachs, where, due to the 9/11 terrorist attack in the US, she specialised in compliance, anti-money laundering, and financial crime. Debra progressed through various sectors at Societe Generale before joining HSBC to lead their Financial Crime team in Hong Kong. \n\nElevated to Chief Compliance Offic",
        "id": 4092547,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7u3SyZPhco0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7u3SyZPhco0/hqdefault.jpg",
        "title": "How AI can protect you from the next crypto scam | Debra Au | TEDxTinHau Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:09.858442+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:53+00:00",
        "description": "Acclaimed Chilean film, theatre and television actress Antonia Zegers shares an intimate reflection on art, life and the magic of the present moment. Driven by curiosity, she pulls back the theatre curtain to catch a glimpse of the forbidden — a gesture that would define her path as an actress, exploring what happens beyond the stage.\n\nShe invites us to view theatre as a mirror of existence — a space where light and shadow, the visible and the hidden, coexist. Blending personal anecdotes with philosophical and quantum physics insights, she unveils art as an encounter — a phenomenon that only comes to life when experienced and shared.\n\nHer talk becomes a celebration of presence and human connection. Because, as Antonia reminds us, every performance — like every life — is unique, fleeting and unrepeatable. Antonia Zegers is one of the most renowned Chilean actresses of her generation. She has had an extensive career in film, television, and theater. She has become a prominent figure in ",
        "id": 4092548,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jqW8O_0SyEA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jqW8O_0SyEA/hqdefault.jpg",
        "title": "On the Other Side of the Curtain | Antonia Zegers | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:10.282416+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:51+00:00",
        "description": "Biologist and philosopher Ricardo Rozzi had a life-changing experience at the southern tip of South America, where fierce winds sweep the forests of Cape Horn. Trapped in a peat bog during a scientific expedition, he discovered a hidden world of mosses, lichens and tiny insects that showed him the beauty in small things.\nIn this poetic and profound talk, Rozzi shares how that near-death experience inspired his biocultural ethic of cohabitation — an invitation to view plants, animals and ecosystems not as resources, but as our fellow inhabitants of this planet.\nHe urges us to care for the invisible, to learn from nature and to remember that sharing our habitat, like sharing bread, is the first step to sustaining life in all its diversity. Ricardo Rozzi is a Chilean ecologist and philosopher, professor at the University of Magallanes and the University of North Texas. He directs the Cape Horn International Center (CHIC) and is vice president of the Center for Environmental Philosophy in",
        "id": 4092549,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WhGwVeGbEeA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WhGwVeGbEeA/hqdefault.jpg",
        "title": "Cohabiting: Ethics from the Small and Invisible | Ricardo Rozzi | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:10.655681+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:42+00:00",
        "description": "During his training as a doctor and surgeon, Cristián Arriagada never learnt how to talk about death. Yet it was death itself that taught him the most profound life lessons.\nIn this moving and candid talk, Cristián revisits the pivotal moments that shaped his transformation: the loss of his grandmother during his childhood, a stroke that forced him to pause, and his wife Javiera’s terminal illness. Each encounter with death led him to realise that living fully does not mean avoiding death, but walking alongside it.\nWith compassion and humanity, he invites us to change the question, to stop asking 'Why is this happening to me?' and to start seeing that 'Everything that happens — even death — happens for us.' He is a prominent plastic and reconstructive surgeon with experience in both the public and private healthcare sectors. He was vice president of the Chilean Society of Plastic Surgery and is the founder of MADE Esthetic.\nFocusing on medical innovation, he has dedicated his career t",
        "id": 4092550,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lBqtWBZQZkU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lBqtWBZQZkU/hqdefault.jpg",
        "title": "How Death Changed My Life | Cristián Arriagada | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:10.946830+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:40+00:00",
        "description": "Ángel Izurieta explores how humanity has always oscillated between fear and innovation. From the printing press to electricity and the internet, every technological revolution has been met with resistance and uncertainty. Today, with the rise of artificial intelligence, that same fear has returned — the fear of being replaced or losing control.\nThrough what he terms the 'Paradox of Transformation', Ángel reflects on our duality: we are the creators of progress, yet we often fear its consequences. He inspires us to move from anxiety to action and from being spectators to becoming architects of the future. Because when we change the question, we stop fearing tomorrow and start shaping it. With more than 25 years of experience in technology and innovation, Ángel Izurieta has led transformation projects in Chile and Latin America.\nHe has spearheaded the implementation of cutting-edge technologies, including artificial intelligence, blockchain, and robotic process automation (RPA), achievi",
        "id": 4092551,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IwVaUVG1OWk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IwVaUVG1OWk/hqdefault.jpg",
        "title": "What world do we choose to build with technology? | Ángel Izurieta | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:11.302560+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:32+00:00",
        "description": "In her talk, Meyling Tang invites us to view the sea not as a mere resource, but as a vibrant seascape where thousands of fishermen and small-scale aquaculturists nurture traditions, sustainability and culture.\n\nShe suggests practical steps such as shortening supply chains, educating consumers, incorporating oysters into everyday cuisine, training oyster sommeliers, and innovating with preserves, smoked seafood, and underwater cellars. Above all, she calls for the establishment of an Ibero-American network of women oyster farmers to honour pioneers such as Laurencia de Solminihac.\n\nShe is a vocal advocate for food sovereignty and coastal heritage. She works to make coastal communities visible, valued and resilient. Meyling Tang has found a bridge to transform realities in gastronomy. Through her work with over 40 artisanal fishing organizations, she promotes fair trade and responsible fishing practices, connecting local communities with kitchens and tables across the country. This tal",
        "id": 4092552,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s53LRx4mqoo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s53LRx4mqoo/hqdefault.jpg",
        "title": "Bring Back the Oyster Halls | Meyling Tang | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:11.602795+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:24+00:00",
        "description": "Mariana Bacci explica os impactos dos alimentos no planeta sob o olhar do Food Design. Um prato bonito é aquele que regenera. Food designer e jornalista, atuante em projetos de comunicação e inovação na área de alimentos, Mariana Bacci é diretora do SiNGULAR FOODS e curadora na Food Design Week na DW!SP (Semana de Design de São Paulo). This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092553,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qtGAjs24Leo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qtGAjs24Leo/hqdefault.jpg",
        "title": "O que você coloca no prato muda o mundo | Mariana Bacci | TEDxSãoJoséDosCampos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:11.919039+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:11+00:00",
        "description": "What do a childhood diary with a tiny lock and the passwords that protect our online secrets have in common? More than we realise. In this fascinating talk, physicist Paulina Assmann takes us from childhood memories to the frontiers of quantum physics and digital security. She reveals a striking truth: many of the 'locks' we trust to protect our data are as fragile as that childhood diary.\n\nWith clarity and passion, Assmann shows us how randomness — the ability for something to happen unpredictably — underpins modern digital security. Quantum physics now provides a source of pure randomness that can create the most secure digital locks ever built.\n\nBeyond technology, this talk invites us to view uncertainty as a creative and protective force. In a world where predictability breeds vulnerability, embracing randomness — in science and in life — may be the key to a freer, safer and more humane future. Paulina Assmann, a physicist with a PhD in astrophysics, is the CEO and co-founder of S",
        "id": 4092554,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=omD0c34-GS4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/omD0c34-GS4/hqdefault.jpg",
        "title": "The invisible lock of our digital freedom | Paulina Assmann | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:12.229336+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:01+00:00",
        "description": "A cancer-related amputation at the age of nine changed Julio Soto’s life forever. Decades later, it was that same story that led him to climb Aconcagua, the highest peak in the Americas, on one leg with the help of two crutches.\nIn this deeply personal talk, Julio shares his journey of resilience, blending his own experiences with insights from neuroscience. He reveals that resilience is not a gift or mere optimism, but a biological process that can be cultivated, whereby the brain’s chemistry transforms pain into purpose.\n'Mountain Without Limits' is an invitation to reconnect with what truly matters: our bodies, nature, and the simple act of being alive. Julio Soto is a cancer survivor and passionate mountaineer who has transformed extreme challenges into inspiration for others. In January 2025, he reached the summit of Aconcagua, proving that life offers second chances and that mountains, both real and metaphorical, are meant to be conquered. This talk was given at a TEDx event usi",
        "id": 4092555,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LSJR0l7O1_4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LSJR0l7O1_4/hqdefault.jpg",
        "title": "The Power of the Mountain | Julio Soto | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:12.475963+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:58:00+00:00",
        "description": "Hanging from a 134-metre-high rope in New Zealand, Susana Jiménez discovered a powerful metaphor for life: limits don’t disappear — they grow. The economist and former minister reflects on fear, trust and the courage to take the leap, both personally and collectively.\n\nDrawing on her experiences as an academic, public servant and the first woman to lead Chile’s main business confederation, she demonstrates how every leap, even the painful ones, creates opportunities for progress and shaping the future.\n\n'Dare to Jump' is an invitation to push boundaries with purpose — to make our country, and our lives, broader, fairer, and more humane. She is the director of several companies and the president of the Confederation of Production and Commerce (CPC), Chile's main business association. She is a commercial engineer with master's degrees in economics and humanities from the Pontifical Catholic University of Chile and the Universidad del Desarrollo, respectively. She has an extensive career",
        "id": 4092556,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=B07PIhJZokg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/B07PIhJZokg/hqdefault.jpg",
        "title": "Dare to Jump! | Susana Jimenez | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:12.729328+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:57:52+00:00",
        "description": "After enjoying a successful career in theatre and television, an actor realises that he has played many roles, but lived very little of his own life. In this heartfelt and sensory talk, he shares how leaving the stage led him back to what is essential: walking.\nBlending reflections on neuroscience and philosophy, he reveals that each step is an act of awareness, where body and mind align, thoughts flow and genuine connection emerges.\n'The Head Is in the Feet' encourages us to step away from the noise and reconnect with our bodies, with others and with ourselves. Sometimes, to find meaning — or another human being — all it takes is a walk. Filmmaker, director, and actor. The stage taught him to listen, look with empathy, and find meaning in questions. Today, he studies nature with scientists, artists, and thinkers, exploring life, death, technology, aging, and love through cameras, art, and culture. This talk was given at a TEDx event using the TED conference format but independently o",
        "id": 4092557,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xKJvUkmsO8g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xKJvUkmsO8g/hqdefault.jpg",
        "title": "The Head Is in the Feet | Felipe Braun | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:13.064733+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:57:43+00:00",
        "description": "In Chile, more than 65,000 people are deprived of their freedom. \n\nThrough the simple act of making a dobladita, a humble Chilean bread, Javiera Lecaros invites us to reconsider social reintegration. \n\nWith empathy and honesty, Javiera reminds us that true reintegration begins not with policies, but with people willing to share their time, understanding and humanity. Javiera Lecaros is the executive director of the Kalen Foundation, an NGO that promotes social impact initiatives focused on the well-being, education, and job placement of incarcerated individuals in Chile. She has worked to build bridges between the public, private, and community sectors by promoting projects that generate opportunities and transform realities in a sustainable way. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092558,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GHlrj4ygLuM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GHlrj4ygLuM/hqdefault.jpg",
        "title": "Bread, Reintegration and Social Justice | Javiera Lecaros | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:13.301253+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:57:41+00:00",
        "description": "What if magic wasn't just a trick, but a different way of viewing life? In this inspiring talk, magician and illusionist Jean Paul Olhaberry invites us to rediscover the power of wonder. Drawing on his own life story — from the fascinated child who saw a coin appear behind his ear, to the artist who dares to challenge the impossible — he offers profound insights into how magic can inspire us to embrace curiosity, presence and courage in our lives. Jean Paul Olhaberry is an illusionist and escape artist who dedicates his life to creating magical experiences that challenge reality and spark the imagination. His art combines the knowledge of ancient magical traditions with the innovation and creativity of contemporary illusionism, bringing to life unique performances filled with mystery and wonder. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092559,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bGC69HdDSnA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bGC69HdDSnA/hqdefault.jpg",
        "title": "The Attempt: The Key to the Impossible | Jean Paul Olhaberry | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:13.454949+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:56:27+00:00",
        "description": "In this TEDx talk, “What Serial Fixers Are Really Avoiding in Relationships,” the speaker explores the deeper emotional patterns behind the impulse to soothe, rescue, and solve for others. As a psychotherapist, parent, and long-time emotional anchor for friends, colleagues, and family, she once believed her constant helpfulness was a sign of compassion and strength. But beneath the surface, she began to notice something more hidden—and more human.\n\nDrawing from personal experience and professional insight, she reveals how serial fixing often masks an avoidance of uncomfortable emotions: our own and the emotions of those we care about. What looks like kindness is sometimes a subtle attempt to control, to create peace, or to maintain relevance, all while neglecting personal boundaries and internal needs.\n\nIn this talk, she shares how recognizing these patterns helped her reconnect to herself, reclaim her energy, and stop confusing over-functioning with love. She uncovers the emotional c",
        "id": 4092560,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qVBjI4tNv3s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qVBjI4tNv3s/hqdefault.jpg",
        "title": "What serial fixers are really avoiding in relationships | Leah Marone | TEDxMallard Creek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:37:13.686168+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:56:03+00:00",
        "description": "In a time of mental health crisis, the ability to truly listen offers a simple but profound way to support one another. By creating opportunities for genuine conversation, we can move beyond superficial responses and enable more meaningful exchanges about our mental health and wellbeing. Carly Walker is a Bachelor of Science Candidate at Georgia College, where she is studying psychology. She will graduate in May 2026. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092561,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nyYRcSLTblQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nyYRcSLTblQ/hqdefault.jpg",
        "title": "Sometimes, listening is enough | Carly Walker | TEDxGeorgiaCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:42.495369+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:32:12+00:00",
        "description": "Robert Górnik tłumaczy, dlaczego nie jest to hormon szczęścia, a cząsteczka antycypacji, i jak ta różnica jest wykorzystywana do manipulowania naszą uwagą i wyborami. To nie przypadek, że trudniej Ci się skupić – to sprytnie wykorzystany mechanizm nagrody. Odkryj, dlaczego szybkie nagrody (jak social media, reklamy, fastood, seriale) popychają Cię w kierunku uzależnień i prokrastynacji, podczas gdy świadome działania wymagające wysiłku prowadzą do sukcesu oraz co ma z tym wspólnego tempo uwalniania dopaminy. Zrozum, jak nie dać się wsadzić na dopaminowy roller coaster, by odzyskać pełną kontrolę nad koncentracją i realizacją długofalowych celów. Robert Górnik to przedsiębiorca, autor i współautor książek oraz wykładowca z niemal 20-letnim stażem. W wykładach i podczas warsztatów pokazuje jakie mechanizmy stoją za naszymi\nzachowaniami. Jest przekonany, że ich zrozumienie jest niezbędne, by rozwijać siebie, swoje firmy i zespoły, a co najważniejsze – unikać pułapek i manipulacji. This t",
        "id": 4092001,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OgO07UWChH8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OgO07UWChH8/hqdefault.jpg",
        "title": "Dopamina. Wszyscy jesteśmy od niej uzależnieni. | Robert Górnik | TEDxLublin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:42.644370+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:31:49+00:00",
        "description": "To nie będzie wystąpienie jak pozostałe z serii „TED”. Nie musisz oglądać całego filmu. Możesz przewinąć do 9 minuty, żeby usłyszeć jedno zdanie, które może odmienić Twoje życie. Natomiast nie poznasz historii człowieka, który nie poddał się w najtrudniejszych momentach jego życia. Moje zmieniło się raz na zawsze, kiedy zrozumiałem, że jestem absolutnie wystarczający, a porównywanie się z innymi jest największym złodziejem. Życie jest jak puzzle. Nie ułożysz ich w chwilę. Czasami rozsypią się po podłodze, a czasami brakuje jednego elementu, który „dopełni” Twoją układankę. Ważne, byś dałx się przekonać, że puzzle, którymi dysponujesz, są wyjątkowe i wystarczające do ułożenia własnej opowieści zwanej życiem. Czasami z puzzlowego chaosu potrafią zrodzić się wspaniałe rzeczy. TEDxLublin „Puzzle” to miejsce, w którym wyjątkowe historie układają się w logiczną i wyjątkową całość. \n#przemiana #puzzle #historia #storytime Jestem synem lekarzy, choć nigdy nie poszedłem w ich ślady. Od dziecka",
        "id": 4092002,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kxLs4cTu8pg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kxLs4cTu8pg/hqdefault.jpg",
        "title": "Największy złodziej naszych czasów | Tomasz Bill | TEDxLublin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:42.775785+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:31:40+00:00",
        "description": "Kiedy życie zmienia kierunek, a miłość prowadzi Cię w zupełnie nowe miejsce – zaczyna się\nhistoria, której nie da się przewidzieć. Magdalena Radomska-Trzaska opowiada poruszającą, pełną emocji historię o samotności na emigracji, potrzebie przynależności i o tym, jak jedna rozmowa potrafi odmienić całe\nżycie. W swoim wystąpieniu pokazuje, że samotność nie jest porażką, lecz zaproszeniem –\nkompasem prowadzącym do ludzi, z którymi naprawdę możemy zbudować wartościowe\n\nrelacje. Łączy osobiste doświadczenie z badaniami Komisji Europejskiej, by udowodnić, że\nw epoce cyfrowej wciąż najbardziej potrzebujemy prawdziwej bliskości. To intymna, szczera i pełna humoru opowieść o miłości, stracie i odnajdywaniu siebie na nowo – o tym, że nawet jeśli czujesz się jak żubr ukryty w lesie, zawsze możesz wyjść do ludzi i znaleźć swoje miejsce na ziemi. Magdalena Radomska-Trzaska – mówca motywacyjny, coach, trener mentalny i wykładowca. Od ponad dziewięciu lat pomaga kobietom przechodzić przez zmianę, wz",
        "id": 4092003,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jA4mrUEtWdc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jA4mrUEtWdc/hqdefault.jpg",
        "title": "Dlaczego mój ukochany wyprowadzał żubra na spacer? | Magdalena Radomska-Trzaska | TEDxLublin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:42.952445+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:31:22+00:00",
        "description": "In his talk Unpredictable Responses, architect Reza Daneshmir delves into the dynamic relationship between design intention and the surprising ways people and cities react to architectural spaces. He argues that the most meaningful architecture often emerges not from rigid control but from embracing uncertainty and allowing environments to evolve through real human behavior. By sharing examples of projects where unexpected interactions led to richer spatial experiences, he highlights the value of flexibility, experimentation, and openness in contemporary practice. His message invites the audience to view unpredictability not as a flaw but as a source of creativity, vitality, and deeper architectural insight. Founder of Fluid Motion Architects This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092004,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cX9B7YMiDMU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cX9B7YMiDMU/hqdefault.jpg",
        "title": "Unpredictable Responses | Reza Daneshmir | TEDxAlef Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:43.149238+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:31:19+00:00",
        "description": "This talk challenges the idea that the mind lives solely in the brain, arguing instead for an embodied view in which thought arises from our active engagement with the world. By tracing the history of psychology from introspection to behaviorism to modern neuroscience, it reveals how fragmented our understanding of mind and body has become. The talk invites audiences to imagine a more integrated perspective, one that reconnects mental life with movement, environment, and the whole human experience. Dr. Kyle J. Jaquess graduated from the University of Maryland, College Park, with a doctorate in Kinesiology, specializing in cognitive-motor neuroscience.  This was accomplished after earning a bachelor’s degree in psychology, with a minor in philosophy, from the University of California, Riverside, and a master’s degree in experimental psychology from California State University, San Bernardino.  Kyle joined Juniata College in the Fall of 2020 after a one-and-a-half-year post-doctoral exp",
        "id": 4092005,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zpzXPLZ26VU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zpzXPLZ26VU/hqdefault.jpg",
        "title": "I think, therefore I am… but what is thought? | Kyle Jaquess | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:43.290262+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:31:11+00:00",
        "description": "This talk explores how the body communicates through electrical signals, microbes, molecules, and the environment, revealing a multilayered picture of human health. By showcasing emerging technologies that sense, interpret, and respond to these signals in real time, it demonstrates how closed-loop, precision care can transform diagnosis and prevention. Audiences will walk away understanding how listening to the body’s data can rewrite the future of medicine. Talia Haller is a Future of Health speaker, AI strategy leader, and Johns Hopkins-trained bioinformatician reshaping medicine. She’s led AI initiatives for NIH’s All of Us program and advises organizations across the healthcare ecosystem. As former Head of Research at a wearables and diagnostics venture firm and current future of health strategy consultant, she applies AI, biomarker science, and precision medicine to create personalized, integrated care. With a master’s in bioinformatics from Johns Hopkins and a dual degree in fin",
        "id": 4092006,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=r11zMw_fpHM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/r11zMw_fpHM/hqdefault.jpg",
        "title": "Your body has a lot to say. Are you listening? | Talia Haller | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:43.402904+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:31:03+00:00",
        "description": "In her talk on embodiment in architecture, Shadi Azizi explores how the human body is not just a user of space but a fundamental reference point for designing it. She explains that architecture becomes meaningful when it engages all the senses—movement, touch, scale, and perception—rather than relying solely on visual aesthetics. By examining how people physically and emotionally inhabit spaces, she highlights the importance of designing environments that respond to bodily experience and human presence. Her message invites architects to create spaces that feel intuitive, inclusive, and deeply connected to the way the body understands the world. Co-Founder of Negin Shahr Ayandeh\nFounder of Iran Researcher Architects This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092007,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WGuatcsAAnQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WGuatcsAAnQ/hqdefault.jpg",
        "title": "On Embodiment in Architecture | Shadi Azizi | TEDxAlef Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:43.509618+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:30:55+00:00",
        "description": "This talk reveals how ancient, fiber rich diets can restore the “forgotten” microbes that support both gut and brain health. Using cutting edge microbiome sequencing and personal data tracking, it shows how small dietary changes can shift the gut ecosystem in powerful ways. Audiences will learn how feeding their microbes can transform their overall well being from the inside out. Dr. Regina Lamendella is a Professor of Biology at Juniata College and an expert in molecular microbial ecology and bioinformatics. Her research focuses on how microbial communities impact human and environmental health, spanning topics from the gut microbiome to bioremediation. She leads Juniata’s Master’s Program in Bioinformatics and has received NIH and NSF funding. A dedicated mentor, she has guided over 150 undergraduate researchers, with 70+ co-authoring peer-reviewed publications. In 2022, she received the CUR Excellence in Mentoring Award. Her lab uses next-generation sequencing, metagenomics, and ma",
        "id": 4092008,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=baM0SKt6DuQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/baM0SKt6DuQ/hqdefault.jpg",
        "title": "Feeding the Forgotten | Regina Lamendella | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:43.645817+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:30:47+00:00",
        "description": "Czy cisza może być mocą? Czy świat dźwięków zawsze jest pełniejszy?\nDominika Kopańska - słabosłysząca samorzeczniczka, naukowczyni, dziennikarka i\naktywistka, zaprasza nas do swojego świata - świata pomiędzy ciszą a hałasem. Opowiada\no życiu „na granicy”, o codzienności pełnej bodźców, o przebodźcowaniu, o momentach\nzawieszenia między rozumieniem a niezrozumieniem. Pokazuje, jak to, co kiedyś było\npowodem wstydu, może stać się źródłem siły i tożsamości.\nJej opowieść to nie tylko historia o słyszeniu i niesłyszeniu, ale przede wszystkim o\nuważności, empatii i o tym, jak nauczyć się naprawdę słyszeć siebie nawzajem.\nW swoim wystąpieniu Dominika łączy osobiste doświadczenie z refleksją naukową i\nspołeczną. Opowiada o liminalności, czyli byciu „na progu” oraz o tym, jak różnorodność\nmoże stać się mostem, a nie granicą. Dominika Kopańska - naukowczyni, dziennikarka i działaczka społeczna. Jako osoba słabosłysząca działa na rzecz budowania mostów między społecznościami g/Głuchych, słabosłys",
        "id": 4092009,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RF94GiGyOXA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RF94GiGyOXA/hqdefault.jpg",
        "title": "Moc w głuchocie, granice w hałasie | Dominika Kopańska | TEDxLublin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:43.845615+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:29:35+00:00",
        "description": "This talk shows how even the smallest, most niche business idea can make a real impact, using one young entrepreneur’s journey from homemade pet food batches to a six figure company as proof. It explores how today’s market rewards creativity, specificity, and passion more than ever before. Audiences will walk away knowing that their ideas are not too small, too strange, or too unlikely to succeed. Em is a senior at Juniata College with a POE in Biology and a Secondary Emphasis in Spanish. They are the owner and founder of Robin's Gourmet Food LLC, a small business focused on providing high quality food mixes to domestic rodents like hamsters and gerbils. After noticing a serious lack of quality in rodent foods in the United States, Em decided to start making their own homemade mixes. After a few years of practice, they began selling their mixes on Etsy, where their brand took off shortly after. Robin’s Gourmet Food is now one of the leading homemade rodent food brands on the market, g",
        "id": 4092010,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gdhi4iI_faM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gdhi4iI_faM/hqdefault.jpg",
        "title": "No, your small business idea isn’t dumb. | Em Perago | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:44.007795+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:29:17+00:00",
        "description": "In his talk on aligning phenomenology with the challenge of responsiveness in architecture, Sam Givrad explores how understanding human perception and lived experience can guide more meaningful approaches to restoring and designing spaces. He explains that phenomenology helps uncover the emotional, sensory, and cultural layers that give architecture its depth, while responsiveness demands that buildings adapt intelligently to contemporary needs. By bridging these two perspectives, he shows how restoration can become a thoughtful dialogue between memory and modernity. His message encourages architects to design and preserve spaces that are not only functional, but also deeply resonant with the ways people feel, move, and experience place. Graduate in Restoration of Historical Monuments This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092011,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hZ_4aAOpFbM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hZ_4aAOpFbM/hqdefault.jpg",
        "title": "Phenomenology with the Challenge of Responsiveness in Architecture | Sam Givrad | TEDxAlef Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:44.130544+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:29:15+00:00",
        "description": "In an age where AI can summarize entire books in seconds, this talk reminds us that reading is more than information processing. It explores how the act of reading shapes attention, imagination, and the very habits of mind that make us human. By revisiting reading as a lifelong practice rather than a task, the talk reveals why this ancient skill remains one of our most powerful tools for understanding the world. Robb Conrad Lauzon is an Assistant Professor of Communication at Juniata College, where he studies the ways we create, store, and transmit ideas. His work bridges rhetoric, media ecology, and the ancient art of memory to examine how technologies—from public memorials to social media—shape the stories we tell about ourselves and our communities. Robb draws on classical memory techniques to reinterpret modern environments, offering audiences a fresh lens to derive meaning from the world that surrounds them. Passionate about helping others unlock deeper meaning in everyday life, ",
        "id": 4092012,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=654qg_SXews",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/654qg_SXews/hqdefault.jpg",
        "title": "Homo Lectio—The Reading Human | Robb Lauzon | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:44.270882+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:29:02+00:00",
        "description": "This talk takes audiences on a journey through the major technological innovations that have shaped how popular music has been recorded and shared from 1876 to the present. Using historical artifacts, demonstrations, and media examples, it brings to life the evolution of sound from wax cylinders to digital streaming. Attendees will leave with a richer understanding of how each innovation transformed the way we listen, create, and connect through music. James Latten, professor of music (percussionist/conductor), joined the Juniata faculty in 1997 as an adjunct percussion instructor, and assumed the full-time role as Director of Instrumental Music and Director of the College Wind Symphony in 2002. In addition, he directs the \"Percussion at Juniata\" program and instructs academic music courses including a team-taught Musical Acoustics course in the Physics department. Originally from Wellsville, New York, Latten holds a Ph.D. in Music Education (2003) from Penn State University, a Master",
        "id": 4092013,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ibz2VM7mppU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ibz2VM7mppU/hqdefault.jpg",
        "title": "Tech Innovations in Popular Music | James Latten | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:44.374944+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:28:59+00:00",
        "description": "This talk explores the process and purpose of human composting, showing how it offers a meaningful, sustainable, and deeply human alternative to traditional burial practices. By tracing how deathcare has evolved across history, it reveals what these changes say about our values, our culture, and the way we understand life itself. It invites audiences to see human composting not as a novelty, but as a real and thoughtful option for the future. Alexander Ross is a first-generation college student from West Virginia pursuing a B.A. in Death, Horror, and Narrative Storytelling. As a transgender student and creative, he explores how storytelling can depict mortality, fear, and trauma. His academic work is informed by his experiences working with aging populations, witnessing the emotional and cultural aspects of death firsthand. Alexander is also a dedicated advocate for queer rights and has served as an officer of Prism, Juniata College’s LGBTQ+ club, for the past three years. Passionate ",
        "id": 4092014,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=L3_lwNSriFM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/L3_lwNSriFM/hqdefault.jpg",
        "title": "To Die and Do it Well - Human Composting | Alexander Ross | TEDxJuniataCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:34:44.477148+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:28:52+00:00",
        "description": "In his talk Responsive Architecture, architect Reza Habibzadeh explores how buildings can move beyond static forms to become dynamic systems that truly engage with their users and environment. He emphasizes that responsive architecture is rooted in listening—listening to climate, context, culture, and the evolving needs of people. Through examples of adaptable spaces and human-centered design strategies, he illustrates how architecture can react intelligently to change, enhancing both functionality and well-being. His message encourages designers and communities to see buildings not as fixed objects, but as living frameworks capable of learning, adjusting, and meaningfully responding. Reza Habibzadeh Design Studio This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4092015,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yTEbYwa8GRM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yTEbYwa8GRM/hqdefault.jpg",
        "title": "Responsive Architecture | Reza Habibzadeh | TEDxAlef Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:40.662167+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:24:35+00:00",
        "description": "Octavio Galvis-Villegas explora el oficio del escritor fantasma, un rol que lo ha llevado a vivir entre las voces de otros mientras silenciaba la suya. Por medio de experiencias personales, anécdotas conmovedoras y referencias culturales, Octavio revela cómo escribir para otros lo ayudó a enfrentar su mayor miedo: compartir su propia historia. En su charla nos invita a reconocer el valor de narrar nuestras vidas, como un acto de expresión personal y un legado para futuras generaciones. Un testimonio sobre la importancia de superar el síndrome del impostor, honrar las voces que confiaron en él y, finalmente, encontrar la suya como autor. Octavio Galvis-Villegas es comunicador, guionista y escritor fantasma, nacido en Manizales y radicado en Los Ángeles, California. Escribe contenido para artistas y ejecutivos de la industria musical latina en EE.UU. y colabora con agencias de relaciones públicas y de comunicación política en Colombia y California. Copresenta los pódcast Urbi et Orbi y ",
        "id": 4091389,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=m-iZ6KSwy9E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/m-iZ6KSwy9E/hqdefault.jpg",
        "title": "\"Aprendizajes de un escritor fantasma\" | Octavio Galvis | TEDxMedellin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:40.991051+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:24:17+00:00",
        "description": "A sociedade contemporânea é marcada pela pressa e pelo imediatismo. Nesse cenário, o controle das emoções se tornou um dos maiores desafios individuais e coletivos. Matheus nos convida a refletir sobre os nossos sentimentos e traz provocações importantes a respeito da saúde mental e do autocontrole na adolescência. Aluno da 2ª série do Ensino Médio do Colégio Ábaco - Unidade São Bernardo This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091390,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6gg2oMoJPW4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6gg2oMoJPW4/hqdefault.jpg",
        "title": "Inteligência emocional na sociedade contemporânea | Matheus Sousa | TEDxColégio Ábaco Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:41.208665+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:24:04+00:00",
        "description": "Striving to grow in your unique skills and abilities to be the best at what you do.  Alabi, Oluwafolahan David is a passionate artist whose love for painting blossomed from a young age. Growing up in the vibrant city of Port Harcourt, Nigeria, Fola found inspiration in the bustling streets, rich culture, and lush natural surroundings that defined his hometown. Art was never just a hobby, it was a calling. \nPainting became a way for Fola to explore emotions and communicate stories that words couldn’t express. His works often blend realism with imaginative elements, creating pieces that feel both personal and universally relatable.Driven by a desire to inspire others, Fola’s art seeks to evoke emotion, provoke thought, and uplift. Whether through serene landscapes or dynamic portraits, every piece holds a message of hope, resilience, or introspection.\nNow, as Fola continues to grow as an artist, his journey is fuelled by the same passion that started it all—an unyielding love for art an",
        "id": 4091391,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mIFmPtJhkaY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mIFmPtJhkaY/hqdefault.jpg",
        "title": "The Unique Approach | Oluwafolahan Alabi | TEDxBellsTech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:41.490232+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:23:56+00:00",
        "description": "Accepting your uniqueness and honing it to build a life full of accomplishments and fulfilment David Nsudoh Nsudoh is a cybersecurity consultant and technology specialist who has developed security roadmaps for over 35 companies across industries like oil and gas, healthcare, finance, and government. He began his career in automation at a startup and later worked with the Akwa Ibom State Government on tech solutions for public sector efficiency. Since 2023, he has focused on security consulting, improving information security across Nigeria. A graduate of the College of Engineering, David was President of the Bells University Students’ Association (2021) and serves on youth development committees shaping Nigeria’s future. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091392,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OxOA6V8UzlY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OxOA6V8UzlY/hqdefault.jpg",
        "title": "Walking your Unique Path | David Nsudoh | TEDxBellsTech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:41.702472+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:19:40+00:00",
        "description": "Con lucidità e curiosità, Andrea Boscaro ci accompagna dentro la rivoluzione silenziosa dell’IA: da strumento di supporto a presenza sempre più intima nelle nostre vite.\nUn invito a comprendere, più che temere, questa tecnologia — perché solo conoscendola possiamo usarla per evolvere. Andrea Boscaro è un esperto di marketing digitale e trasformazione online. Fondatore di The Vortex, società di consulenza che accompagna aziende, associazioni e professionisti nell’utilizzo strategico del web, è autore di numerosi libri dedicati al digitale e collabora con importanti realtà formative italiane. Con un approccio pratico e divulgativo, aiuta imprese e persone a comprendere le opportunità e le sfide della rete, trasformando la tecnologia in uno strumento di crescita e innovazione. Convinto che la cultura digitale sia una delle nuove radici del futuro, lavora per diffondere competenze che rendano tutti più consapevoli e protagonisti del cambiamento. This talk was given at a TEDx event using t",
        "id": 4091393,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hRfyYxdlak8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hRfyYxdlak8/hqdefault.jpg",
        "title": "Intelligenza Artificiale: da assistente a confidente | Andrea Boscaro | TEDxGela",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:41.835075+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:19:22+00:00",
        "description": "Josh Jett has spent 20+ years teaching science, long enough to see education change in ways he never expected. In this TEDx talk, he shares the moment a student asked him how school today compares to when that student’s dad was in his class and how that question pushed him to rethink everything from technology to testing. Josh talks about the rise of constant assessments, the impact on students, emphasizing why hands-on curiosity still matters more than any exam, and how he is implementing that philosophy in his classroom. This is my 21st year teaching science at Santa Fe High School. I currently serve in the Science Department Chair, and have taught Biology I, AP Environmental Science, AP Biology and Anatomy over the course of my career. No other subject has the potential to spark the imagination or stimulate one's intellectual curiosity like the sciences. I feel fortunate to teach a field of study with such inherent opportunities to both develop the content knowledge and challenge t",
        "id": 4091394,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7Cq9mgxQVBs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7Cq9mgxQVBs/hqdefault.jpg",
        "title": "Science Education: Past, Present, Future. | Josh Jett | TEDxGainesville High School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:41.984512+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:18:33+00:00",
        "description": "Reza Pourmand is a senior at Winston Churchill High School. He enjoys partaking in medical research and addressing the divide between medical resources and poverty, competing as a taekwondo athlete, and volunteering at his local fire department. In his free time he likes to read, hang out with friends, and walk around his neighborhood.  Reza Pourmand is a senior at Winston Churchill High School. He enjoys partaking in medical research and addressing the divide between medical resources and poverty, competing as a taekwondo athlete, and volunteering at his local fire department. In his free time he likes to read, hang out with friends, and walk around his neighborhood. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091395,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ydDFgH_oeqY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ydDFgH_oeqY/hqdefault.jpg",
        "title": "Don’t Exist, Live | Reza Pourmand | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.100742+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:18:25+00:00",
        "description": "Troy is a junior at Winston Churchill High School. He enjoys being outdoors, often hiking, biking, and going on campouts, carrying his camera to capture memories any moment he can get. He’s just gotten into public speaking and hopes that he can inspire others through his words. Troy is a junior at Winston Churchill High School. He enjoys being outdoors, often hiking, biking, and going on campouts, carrying his camera to capture memories any moment he can get. He’s just gotten into public speaking, and hopes that he can inspire others through his words. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091396,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=onKc6nJ6H-c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/onKc6nJ6H-c/hqdefault.jpg",
        "title": "Documenting my Teens | Troy Chou | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.244194+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:18:22+00:00",
        "description": "Liza Bogdanovskaya is a high school junior and co-founder of Inspire Art, a nonprofit bringing non-clinical art therapy to hospitals, senior homes, and community centers. Her work blends science, service, and storytelling, fueled by a curiosity about the brain-body connection. Outside of speaking, she holds a TEDx license at her school and is currently working with her team to organize their second annual event. Liza Bogdanovskaya is a high school junior and co-founder of Inspire Art, a nonprofit bringing non-clinical art therapy to hospitals, senior homes, and community centers. Her work blends science, service, and storytelling, fueled by a curiosity about the brain-body connection. Outside of speaking, she holds a TEDx license at her school and is currently working with her team to organize their second annual event. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091397,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QKGBh4KcTt4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QKGBh4KcTt4/hqdefault.jpg",
        "title": "The Neuroscience of Feeling Seen — Why It Matters for Healing | Liza Bogdanovskaya | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.349134+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:18:14+00:00",
        "description": "Parsa Shakeri is a junior at Winston Churchill. He has moved half a dozen times between 4 states and has traveled to 17 different countries. These experiences have given him a unique perspective on how different places shape the way we live and think. Outside of school, Parsa enjoys reading books, traveling, and hiking. Parsa Shakeri is a junior at Winston Churchill. He has moved half a dozen times between 4 states and has traveled to 17 different countries. These experiences have given him a unique perspective on how different places shape the way we live and think. Outside of school, Parsa enjoys reading books, traveling, and hiking. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091398,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZLGDhRV6ifk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZLGDhRV6ifk/hqdefault.jpg",
        "title": "What’s Around You? How Environments Shape Who We Become | Parsa Shakeri | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.457972+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:18:05+00:00",
        "description": "Sarrah Fahmy is a 14-year-old freshman at Winston Churchill High School with a strong interest in entrepreneurship, leadership, and biomedical engineering. She is passionate about learning and spreading awareness on the intersection of science and technology, especially in areas that can drive real-world change. In her free time, she enjoys reading, writing, baking, listening to music, and drawing. Her goal is to make a meaningful and lasting impact on the world in the fields of biomedical engineering and artificial intelligence. Sarrah Fahmy is a 14-year-old freshman at Winston Churchill High School with a strong interest in entrepreneurship, leadership, and biomedical engineering. She is passionate about learning and spreading awareness on the intersection of science and technology, especially in areas that can drive real-world change. In her free time, she enjoys reading, writing, baking, listening to music, and drawing. Her goal is to make a meaningful and lasting impact on the wo",
        "id": 4091399,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=extVP0L-9mI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/extVP0L-9mI/hqdefault.jpg",
        "title": "Engineered for Addiction: Why We Can’t Look Away  | Sarrah Fahmy | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.562971+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:18:02+00:00",
        "description": "After moving from Greece to the United States in elementary school, Alex learned the importance of balancing priorities and staying connected with family across distances. This experience shaped his perspective on presence, choices, and meaningful living. Alongside academics, he has dedicated time to volunteering, supporting his community, and caring for dogs, which taught him valuable lessons about patience and purpose. In his free time, he enjoys playing football, fitness, and reflecting on how small daily decisions can create a more intentional life. He seeks to use his experiences to help others recognize the value of time and foster more meaningful, connected communities . Alex Grigoriadis is currently a student at Winston Churchill High School, with a passion for understanding how people spend their time and what truly matters in life. After moving from Greece to the United States in elementary school, he learned the importance of balancing priorities and staying connected with ",
        "id": 4091400,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_Mkn2ISRP-Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_Mkn2ISRP-Q/hqdefault.jpg",
        "title": "Your Time Is Limited. Spend It Wisely | Alex Grigoriadis | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.667389+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:17:54+00:00",
        "description": "Anya Nagpal is a senior at Winston Churchill High School with a strong passion for technology. Outside the classroom, she enjoys practicing yoga and recently earned her training certification, combining her interest in wellness with personal growth. Anya Nagpal is a senior at Winston Churchill High School with a strong passion for technology. Outside the classroom, she enjoys practicing yoga and recently earned her training certification, combining her interest in wellness with personal growth. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091401,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KQB6XNDQ4Ks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KQB6XNDQ4Ks/hqdefault.jpg",
        "title": "Step Into the Future: The Influence of Bullet Trains | Anya Nagpal | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.767307+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:17:40+00:00",
        "description": "Mason is currently a junior in high school. He has a passion for wrestling and academics, creating a unique perspective on learning through discipline and intelligence. He hopes to encourage teenagers to discover their interests so they can achieve success in their careers.  Mason Hu is a junior at Winston Churchill High School and a dedicated member of the wrestling team. Beyond the mat, he is constantly striving to challenge himself and grow both as an athlete and a student. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091402,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=q_1_RNv78Fc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/q_1_RNv78Fc/hqdefault.jpg",
        "title": "Infinite Paths to Success | Mason Hu | TEDxYouth@WCHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:33:42.884318+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:17:37+00:00",
        "description": "Aleena Fasihuzzaman is a 14 year old student at Churchill high school, passionate about making changes in the world. She has a love for activism and hopes to inspire others to do the same. \n\n Aleena Fasihuzzaman is a 14-year-old student at Winston Churchill High School who is passionate about creating positive change in the world. She has a strong love for activism and hopes to inspire others to get involved and make a difference. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4091403,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=sHdb5ik6-fU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sHdb5ik6-fU/hqdefault.jpg",
        "title": "Survivor Stories: The Realities of the Troubled Teen Industry | Aleena Fasihuzzaman | TEDxYouth@WCHS",
        "vote": 0
    }
]