[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T19:44:07.925076+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T19:01:05+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, we explore how stylization is all about creating a distinctive visual style that expresses your project's atmosphere and uniqueness while still feeling like a real environment. \n\nThis talk is about pushing the limits of stylization in Unreal Engine without compromising aesthetics or art direction, helping to realize your vision while retaining control of your project's look. \n\nThe session covers look development and the latest animation features to help creators think outside the realistic box to get the best results from Unreal Engine. The focus is on technical direction for tools in Unreal Engine to generate stylized looks and animation, such as material development and iteration, and the use of Sequencer.\n\nLearn more about animation in Unreal Engine here: unrealengine.com/uses/animation\n\n#Animation, #Sequencer, #UnrealEngine, #UE5, #UnrealFestOrlando",
        "id": 4093163,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vmaxhbu4YJQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vmaxhbu4YJQ/hqdefault.jpg",
        "title": "25 Ways To Stylize a Project in Unreal Engine | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:41:59.626659+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:00:11+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Principal World Designer Yves Poureau seeks to answer the question “is procedural level generation providing value to players?”\n\nThe talk defines the specific contexts where the answer can be \"Yes,\" examining three key applications: scaling of content production, enabling replayability, and supporting user-generated content. \n\nThe session goes on to provide a six-step workflow guiding you from prototyping to fine-tuning, with practical tips to leverage this technology in your projects.\n\nThrough the lens of Unreal Engine's Procedural Content Generation Framework (PCG), the session demonstrates how this approach enables complex 3D procedural generation for any production, from micro-detail placement to macro-level structure. \n\nThe workflow requires no programming background, making it immediately actionable whether you're a creative director evaluating PCG's potential, a level designer adapting your workflow, a programmer building to",
        "id": 4092046,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7dn6UOrOgyg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7dn6UOrOgyg/hqdefault.jpg",
        "title": "Do You Need PCG? A Guide to Level Up Your Workflow | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T15:40:32.019101+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T15:01:38+00:00",
        "description": "The AI boom is fueled by two things: computing power and data. Real-world data can be costly and time-consuming to collect, creating a bottleneck in the process. Synthetic data can alleviate this bottleneck by providing scalable diverse datasets with perfect annotations and labels. \n\nUnreal Engine, using only native tools and features, can produce synthetic visual data for virtually any use case. Synthetic data is currently being used for computer vision applications at companies like Boeing, Tesla, Microsoft, and Apple to train models for a fraction of the cost of manually collecting it. Synthetic data also allows for edge cases that would be too costly or dangerous to enact in the real world. \n\nTo aid in this endeavor, Boeing created custom tools in Unreal Engine using Editor Utility Widgets, enabling data scientists with very little knowledge of Unreal Engine to customize and generate their own data sets.\n\nIn this session recorded at Unreal Fest Orlando 2025, Taylor Loper of The Bo",
        "id": 4090908,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pJfHiVo8GUg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pJfHiVo8GUg/hqdefault.jpg",
        "title": "Generating Synthetic Data Using Unreal Engine | Unreal Fest Orlando 2025",
        "vote": 0
    }
]