[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T23:17:29.330997+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T22:40:00+00:00",
        "description": "NetChoice is suing Virginia to block a new law that limits kids under 16 to one hour of daily social media use unless parents approve more time, arguing the rule violates the First Amendment and introduces serious privacy risks through mandatory age-verification. The Verge reports: In addition to restricting access to legal speech, NetChoice alleges that Virginia's incoming law (SB 854) will require platforms to verify user ages in ways that would pose privacy and security risks. The law requires platforms to use \"commercially reasonable methods,\" which it says include a screen that prompts the user to enter a birth date. However, NetChoice argues that Virginia could go beyond this requirement, citing a post from Governor Youngkin on X, stating \"platforms must verify age,\" potentially referring to stricter methods, like having users submit a government ID or other personal information.\n \nNetChoice, which is backed by tech giants like Meta, Google, Amazon, Reddit, and Discord, alleges ",
        "id": 4094783,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/17/215259/netchoice-sues-virginia-to-block-its-one-hour-social-media-limit-for-kids",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NetChoice Sues Virginia To Block Its One-Hour Social Media Limit For Kids",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T22:17:07.945992+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Amazon Web Services, Microsoft's Azure, and Alphabet's Google Cloud risk being dragged into the scope of the European Union's crackdown on Big Tech as antitrust watchdogs prepare to study the platforms' market power. The European Commission wants to decide if any of the trio should face a raft of new restrictions under the bloc's Digital Markets Act (source paywalled; alternative source), according to people familiar with the matter who spoke on condition of anonymity. The plan for a market probe follows several major outages in the cloud industry that wrought havoc across global services, highlighting the risks of relying on a mere handful of players.\n \nTo date, the world's largest cloud providers have avoided the DMA because a large part of their business comes via enterprise contracts, making it difficult to count the number of individual users, one of the EU's main benchmarks for earmarking Silicon Valley services for extra overs",
        "id": 4094380,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/17/2056254/tech-giants-cloud-power-probed-as-eu-weighs-inclusion-in-dma",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Giants' Cloud Power Probed As EU Weighs Inclusion In DMA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T22:17:08.083712+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T21:20:00+00:00",
        "description": "An anonymous reader shares a report: When Nigel Morris tells you he's worried about the economy, you listen. As industry observers know, Morris co-founded Capital One and pioneered lending to subprime borrowers, building an empire on understanding exactly how much financial stress the average American can handle. Now, as an early investor in Klarna and other buy-now-pay-later companies like Aplazo in Mexico, he's watching something that makes him deeply uncomfortable. \n\n\"To see that people are using [BNPL services] to buy something as basic and fundamental as groceries,\" Morris told me on stage at Web Summit in Lisbon this week, \"I think is a pretty clear indication that a lot of people are struggling.\" The statistics back up his unease. Buy-now-pay-later services have exploded to 91.5 million users in the United States, according to the financial services firm Empower, with 25% using the services to finance their groceries as of earlier this year, according to survey data released in",
        "id": 4094381,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/17/1851247/buy-now-pay-later-is-expanding-fast-and-that-should-worry-everyone",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Buy Now, Pay Later' is Expanding Fast, and That Should Worry Everyone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T21:08:47.650273+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T20:41:00+00:00",
        "description": "An anonymous reader shares a report: Harvard is ramping up its holdings in cryptocurrency. The nation's oldest university reported a $443 million investment in BlackRock's iShares Bitcoin Trust in the third quarter. The school now holds 6.8 million shares of the exchange-traded fund, up from 1.9 million in the second quarter. \n\nThe digital currency amounts to a little less than 1% of the school's $57 billion endowment. Other schools are bullish on crypto as well. Brown University reported holding $13 million of the BlackRock bitcoin ETF in the second quarter and Emory University reported holding $20 million of Grayscale's Bitcoin Mini Trust ETF as of March.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Harvard+Has+Almost+Half+a+Billion+Dollars+in+Crypto%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F17%2F1834233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.",
        "id": 4093918,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/17/1834233/harvard-has-almost-half-a-billion-dollars-in-crypto",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Harvard Has Almost Half a Billion Dollars in Crypto",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T20:08:11.758639+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T20:01:00+00:00",
        "description": "Abstract of a paper on NBER: This paper documents video consumption among school-aged children in the U.S. and explores its impact on human capital development. Video watching is common across all segments of society, yet surprisingly little is known about its developmental consequences. With a bunching identification strategy, we find that an additional hour of daily video consumption has a negative impact on children's noncognitive skills, with harmful effects on both internalizing behaviors (e.g., depression) and externalizing behaviors (e.g., social difficulties). We find a positive effect on math skills, though the effect on an aggregate measure of cognitive skills is smaller and not statistically significant. These findings are robust and largely stable across most demographics and different ways of measuring skills and video watching. We find evidence that for Hispanic children, video watching has positive effects on both cognitive and noncognitive skills -- potentially reflect",
        "id": 4093431,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/17/1810213/is-video-watching-bad-for-kids-the-effect-of-video-watching-on-childrens-skills",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Video Watching Bad for Kids? The Effect of Video Watching on Children's Skills",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T20:08:12.002947+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T19:21:00+00:00",
        "description": "Authorities in Iran have sprayed clouds with chemicals to induce rain, in an attempt to combat the country's worst drought in decades. From a report: Known as cloud-seeding, the process was conducted over the Urmia lake basin on Saturday, Iran's official news agency Irna reported. Urmia is Iran's largest lake, but has largely dried out leaving a vast salt bed. Further operations will be carried out in east and west Azerbaijan, the agency said. \n\nRainfall is at record lows and reservoirs are nearly empty. Last week President Masoud Pezeshkian warned that if there is not enough rainfall soon, Tehran's water supply could be rationed and people may be evacuated from the capital. Cloud seeding involves injecting chemical salts including silver or potassium iodide into clouds via aircraft or through generators on the ground. Water vapour can then condense more easily and turn into rain. The technique has been around for decades, and the UAE has used it in recent years to help address water ",
        "id": 4093432,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/17/1749243/iran-begins-cloud-seeding-to-induce-rain-amid-historic-drought",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iran Begins Cloud Seeding To Induce Rain Amid Historic Drought",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T19:07:41.105048+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T18:40:00+00:00",
        "description": "An anonymous reader shares a report: The use of AI in the latest Call of Duty has prompted a US lawmaker to call for regulations to prevent artificial intelligence from taking jobs away from human workers. Rep. Ro Khanna (D-Calif.), who represents a large swathe of Silicon Valley, took aim at Call of Duty: Black Ops 7 after buyers noticed the popular shooter contains a significant amount of AI-generated icons, posters, and achievements. Gamers are criticizing it as filled with \"AI slop.\" \n\nOn Friday, Khanna tweeted: \"We need regulations that prevent companies from using AI to eliminate jobs to extract greater profits.\" He added, \"Artists at these companies need to have a say in how AI is deployed. They should share in the profits. And there should be a tax on mass displacement.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Use+in+'Call+of+Duty%3A+Black+Ops+7'+Draws+Fire+From+US+Lawmaker%3A+https%3A%2F%2Fgames.s",
        "id": 4093008,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/17/1743203/ai-use-in-call-of-duty-black-ops-7-draws-fire-from-us-lawmaker",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Use in 'Call of Duty: Black Ops 7' Draws Fire From US Lawmaker",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:07:04.458661+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T18:01:00+00:00",
        "description": "Strauss Zelnick, CEO of Take-Two Interactive, which operates publishing labels including GTA-maker Rockstar Games and 2K, said on Monday that although gaming consoles are not going away, the industry is moving toward PCs in the next decade. From a report: \"I think it's moving towards PC and business is moving towards open rather than closed,\" Zelnick told CNBC's \"Squawk Box.\" \n\n\"But if you define console as the property, not the system, then the notion of a very rich game that you engage in for many hours that you play on a big screen -- that's never going away.\" Zelnick said the current split between console and mobile is about even in the market, but mobile is growing more rapidly than consoles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Take-Two+CEO+Says+Consoles+Aren't+Going+Away%2C+But+Gaming+is+Moving+Toward+PCs%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F11%2F17%2F1648254%2F%3Futm_source%3Dtwitter%",
        "id": 4092371,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/17/1648254/take-two-ceo-says-consoles-arent-going-away-but-gaming-is-moving-toward-pcs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Take-Two CEO Says Consoles Aren't Going Away, But Gaming is Moving Toward PCs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T18:07:04.594170+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T17:21:00+00:00",
        "description": "The UK government has been warned that its plan to ban operators of critical national infrastructure from paying ransoms to hackers is unlikely to stop cyber attacks and could result in essential services collapsing. From a report: The proposal, announced by the Home Office in July, is designed to deter cyber criminals by making it clear any attempt to blackmail regulated companies such as hospitals, airports and telecoms groups will not succeed. If enacted, the UK would be the first country to implement such a ban. \n\nBut companies and cyber groups have told government officials that making paying ransoms illegal would remove a valuable tool in negotiations where highly sensitive data or essential services could be compromised, according to two people familiar with the matter. \"An outright ban on payments sounds tough on crime, but in reality it could turn a solvable crisis into a catastrophic one,\" said Greg Palmer, a partner at law firm Linklaters.<p><div class=\"share_submission\" st",
        "id": 4092372,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/17/1631207/uk-cyber-ransom-ban-risks-collapse-of-essential-services",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Cyber Ransom Ban Risks Collapse of Essential Services",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:06:34.389172+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:41:00+00:00",
        "description": "Global internet freedom declined for a 15th consecutive year, according to Freedom House's annual report. Semafor: \"Always grim reading,\" this year's is particularly sobering, Tech Policy Press noted, with the lowest-ever portion of users living in countries categorized as \"free.\" Conditions declined in 27 of the 72 countries assessed, with those in Kenya -- where anti-corruption protests were quelled, in part, by a seven-hour internet shutdown -- deteriorating the most. China and Myanmar tied for least-free, and the US' ranking dropped, while Iceland retained its top spot for the freest digital environment. Bangladesh improved the most. The most consistent trend observed over 15 years, Freedom House noted, is the growing digital influence of state actors: \"Online spaces are more manipulated than ever.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Global+Web+Freedoms+Tumble%3A+https%3A%2F%2Ftech.slashdot.org%2Fsto",
        "id": 4091817,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/17/1620236/global-web-freedoms-tumble",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Global Web Freedoms Tumble",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T17:06:34.592824+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T16:04:00+00:00",
        "description": "Hotel cancellation policies have transformed over the past seven years. Travelers once could cancel reservations up until the day before check-in without penalty. That flexibility has largely vanished. \n\nThe shift began around 2018 when third-party travel-booking sites deployed \"cancel-rebook\" strategies, the Atlantic writes. These platforms would monitor hotel rates after securing initial reservations. When prices dropped, the sites automatically canceled existing bookings and rebooked customers at lower rates. Hotels lost already-booked revenue whenever they reduced prices to fill empty rooms. \n\nHotels responded by introducing tiered pricing structures. Travelers now encounter prepaid non-refundable rates at the lowest price point, mid-range rates with two- or three-day cancellation deadlines, and higher rates for same-day cancellation flexibility. The cancel-rebook sites could still swap reservations until deadlines arrived, but the damage to hotels diminished. \n\nChristopher Anders",
        "id": 4091818,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/17/1541210/why-hotel-room-cancellations-disappeared",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Hotel-Room Cancellations Disappeared",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T16:05:19.728277+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T15:20:00+00:00",
        "description": "Anthropic CEO Dario Amodei says he's uneasy about how much power a handful of tech leaders -- including himself -- have over the future of artificial intelligence. From a report: \"I think I'm deeply uncomfortable with these decisions being made by a few companies, by a few people,\" Amodei told Anderson Cooper in a \"60 Minutes\" episode that aired Sunday. \"Like who elected you and Sam Altman?\" asked Anderson. \"No one. Honestly, no one,\" Amodei replied.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+CEO+Says+He's+'Deeply+Uncomfortable'+With+Unelected+Tech+Elites+Shaping+AI%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F17%2F1518202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F17%2F1518202%2Fanthropic-ceo-says-hes-deeply-unc",
        "id": 4091232,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/17/1518202/anthropic-ceo-says-hes-deeply-uncomfortable-with-unelected-tech-elites-shaping-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic CEO Says He's 'Deeply Uncomfortable' With Unelected Tech Elites Shaping AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T15:04:46.805042+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T14:40:00+00:00",
        "description": "An anonymous reader shares a report: Elementary-school students would have to learn how to write in cursive, under a bill set to be vetted by a House committee next week. Sen. Erin Grall, R-Vero Beach, filed a similar proposal (SB 444) on Monday. The House Student Academic Success Subcommittee is set to review the measure (HB 127) on Nov. 18. \n\nSponsored by Rep. Toby Overdorf, R-Palm City, the bill would require cursive instruction in second through fifth grades. The proposal, filed for consideration for the legislative session that begins Jan. 13, also would require students to demonstrate proficiency in cursive by the end of fifth grade.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Florida+Bill+Would+Require+Cursive+Instruction+in+Elementary+Schools%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F17%2F1434243%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_la",
        "id": 4090681,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/17/1434243/florida-bill-would-require-cursive-instruction-in-elementary-schools",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Florida Bill Would Require Cursive Instruction in Elementary Schools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T15:04:47.084742+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T14:00:00+00:00",
        "description": "Jeff Bezos has founded an AI startup called Project Prometheus and will serve as its co-chief executive. This is his first formal operational role since stepping down as chief executive of Amazon in July 2021. The company has raised $6.2 billion in funding, The New York Times reports, partly from Bezos. The funding makes Project Prometheus one of the most well-financed early-stage startups in the world. \n\nBezos's co-founder and co-chief executive is Vik Bajaj, a physicist and chemist who worked closely with Google co-founder Sergey Brin at Google X. Dr. Bajaj was among the founders of Verily in 2015 and co-founded Foresite Labs in 2018. He recently left that position to focus on Project Prometheus. The company is focusing on AI for engineering and manufacturing in computers, aerospace, and automobiles. The startup has already hired nearly 100 employees, the report said. Researchers from OpenAI, DeepMind, and Meta are among the hires. Project Prometheus is building AI systems that lear",
        "id": 4090682,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/17/1340210/bezos-returns-to-ceo-role-with-ai-startup-project-prometheus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bezos Returns To CEO Role With AI Startup Project Prometheus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T13:01:20.346104+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T12:34:00+00:00",
        "description": "Linux kernel maintainers \"are grappling with how to integrate AI-generated contributions without compromising the project's integrity,\" reports WebProNews:\n\n\n\nThe latest push comes from a proposal by Sasha Levin, a prominent kernel developer at NVIDIA, who has outlined guidelines for tool-generated submissions. Posted to the kernel mailing list, these guidelines aim to standardize how AI-assisted patches are handled. According to Phoronix, the v3 iteration of the proposal [posted by Intel engineer Dave Hansen] emphasizes transparency and accountability, requiring developers to disclose AI involvement in their contributions. This move reflects broader industry concerns about the quality and copyright implications of machine-generated code. \n\nLinus Torvalds, the creator of Linux, has weighed in on the debate, advocating for treating AI tools no differently than traditional coding aids. As reported by heise online, Torvalds sees no need for special copyright treatment for AI contribution",
        "id": 4089689,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/17/0444234/how-should-the-linux-kernel-handle-ai-generated-contributions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Should the Linux Kernel Handle AI-Generated Contributions?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T08:57:48.450417+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T08:35:00+00:00",
        "description": "655\"Just a little more than a month after reaching an all-time high, Bitcoin has erased the more than 30% gain registered since the start of the year...\" reports Bloomberg:\n\nThe dominant cryptocurrency fell below US$93,714 on Sunday, pushing the price beneath the closing level reached at the end of last year, when financial markets were rallying following President Donald Trump's election victory. Bitcoin soared to a record US$126,251 on Oct 6, only to begin tumbling four days later after unexpected comments on tariffs by Trump sent markets into a tailspin worldwide. \"The general market is risk-off,\" said Matthew Hougan, the San Francisco-based chief investment officer for Bitwise Asset Management. \"Crypto was the canary in the coal mine for that, it was the first to flinch.\" \n\n\nOver the past month, many of the biggest buyers &mdash; from exchange-traded fund allocators to corporate treasuries &mdash; have quietly stepped back, depriving the market of the flow-driven support that help",
        "id": 4088130,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/17/024220/bitcoin-erases-years-gain-as-crypto-bear-market-deepens",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bitcoin Erases Year's Gain as Crypto Bear Market Deepens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T05:54:21.572398+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T05:50:00+00:00",
        "description": "\"To be clear, the current economics of space-based data centers don't make sense,\" writes the Wall Street Journal. \n\n\"But they could in the future, perhaps as soon as a decade or so from now, according to an analysis by Phil Metzger, a research professor at the University of Central Florida and formerly of the National Aeronautics and Space Administration.\"\n\n\"Space enthusiasts (comme moi) have long sought a business case to enable human migration beyond our home world,\" he posted on X amid the new hype. \"I think AI servers in space is the first real business case that will lead to many more....\" \n\nThe argument essentially boils down to the belief that AI's needs are eventually going to grow so great that we need to move to outer space. There the sun's power can be more efficiently harvested. In space, the sun's rays can be direct and constant for solar panels to collect &mdash; no clouds, no rainstorms, no nighttime. Demands for cooling could also be cut because of the vacuum of space",
        "id": 4087340,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/17/0527202/more-tech-moguls-want-to-build-data-centers-in-outer-space",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Tech Moguls Want to Build Data Centers in Outer Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T03:53:12.725905+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T03:40:00+00:00",
        "description": "\"Windows is evolving into an agentic OS,\" Microsoft's president of Windows Pavan Davuluri posted on X.com, \"connecting devices, cloud, and AI to unlock intelligent productivity and secure work anywhere.\" \n\nBut former Uber software engineer and engineering manager Gergely Orosz was unimpressed. \"Can't see any reason for software engineers to choose Windows with this weird direction they are doubling down on. So odd because Microsoft has building dev tools in their DNA... their OS doesn't look like anything a builder who wants OS control could choose. Mac or Linux it is for devs.\" \n\n Davuluri \"has since disabled replies on his original post...\" notes the blog Windows Central, \"which some people viewed as an attempt to shut out negative feedback.\" But he also replied to that comment...\n\n\n\nDavuluri says \"we care deeply about developers. We know we have work to do on the experience, both on the everyday usability, from inconsistent dialogs to power user experiences. When we meet as a team,",
        "id": 4086855,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/17/0337227/microsoft-executives-discuss-how-ai-will-change-windows-programming----and-society",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Executives Discuss How AI Will Change Windows, Programming -- and Society",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T02:52:40.335154+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T02:06:00+00:00",
        "description": "\"Three Chinese astronauts returned from their nation's space station Friday,\" reports the Associated Press, \"after more than a week's delay because the return capsule they had planned to use was damaged, likely from being hit by space debris.\"\n\nThe team left their Shenzhou-20 spacecraft in orbit and came back using the recently arrived Shenzhou-21, which had ferried a three-person replacement crew to the station, China's Manned Space Agency said.\nThe original return plan was scrapped because a window in the Shenzhou-20 capsule had tiny cracks, most likely caused by impact from space debris, the space agency said Friday... Their return was delayed for nine days, and their 204-day stay in space was the longest for any astronaut at China's space station... \n\n\nChina developed the Tiangong space station after the country was excluded from the International Space Station over U.S. national security concerns. China's space program is controlled by its military.\n\n<p><div class=\"share_submissi",
        "id": 4086619,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/17/0135228/chinese-astronauts-return-from-their-space-station-after-delay-blamed-on-space-debris-damage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Astronauts Return From Their Space Station After Delay Blamed on Space Debris Damage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-17T01:51:49.332087+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-17T01:06:00+00:00",
        "description": "Android's security team published a blog post this week about their experience using Rust. Its title? \"Move fast and fix things.\"\n\n\n\nLast year, we wrote about why a memory safety strategy that focuses on vulnerability prevention in new code quickly yields durable and compounding gains. This year we look at how this approach isn't just fixing things, but helping us move faster. \n\nThe 2025 data continues to validate the approach, with memory safety vulnerabilities falling below 20% of total vulnerabilities for the first time. We adopted Rust for its security and are seeing a 1000x reduction in memory safety vulnerability density compared to Android's C and C++ code. But the biggest surprise was Rust's impact on software delivery. With Rust changes having a 4x lower rollback rate and spending 25% less time in code review, the safer path is now also the faster one... Data shows that Rust code requires fewer revisions. This trend has been consistent since 2023. Rust changes of a similar si",
        "id": 4086400,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/17/012246/rust-in-android-more-memory-safety-fewer-revisions-fewer-rollbacks-shorter-reviews",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rust in Android: More Memory Safety, Fewer Revisions, Fewer Rollbacks, Shorter Reviews",
        "vote": 0
    }
]