[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-07T21:07:35.510736+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-07T20:30:00+00:00",
        "description": "Surviving in 1900s is a tall task, especially when the mafia roam free, and while Mafia: The Old Country isn't real life, it can be just as challenging. You could knock the difficulty down, but there are several other things to keep in mind to gain an edge and ensure that ol' Enzo lives to fight another day.\n\nThe first is adjusting to combat, especially when using more antiquated weapons. San Celeste is known for its gorgeous vineyards, but ammo isn't as plentiful, so taking a stealthy approach and disposing of your foes, one by one, is encouraged. Instinct Mode reveals their positions behind walls and should be abused accordingly, but choosing the right knife is also integral. From throwing knives and one-hit kills to higher durability, there are plenty of options to choose from.\n\nLeveraging your environment is also key, especially when common objects can be thrown to distract enemies. Of course, you'll also want to venture outside of the story via Explore Mode and check out whatever",
        "id": 3278238,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=3AQ-G3_Q8KI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3AQ-G3_Q8KI/hqdefault.jpg",
        "title": "Mafia: The Old Country - 10 Things It DOESN'T TELL YOU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-07T12:27:35.558982+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-07T12:00:43+00:00",
        "description": "Mafia: The Old Country does a lot of things right, but it doesn’t offer much in terms of replay value. Once you finish the game, you can still explore the world or replay individual chapters, maybe even buy a few more cars or horses, but there’s no New Game Plus mode or meaningful post game content. For its price, this is a decent offering, though players expecting more depth or long term engagement might walk away slightly disappointed.\n\nTo conclude, Mafia: The Old Country carries forward the resurgence of focused, single-player experiences at a lower price point, offering a compact yet memorable adventure. If you enjoy games built around strong storytelling and tight design that respects your time, this one will be right up your alley.",
        "id": 3273883,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=KGYcc_iuoFo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KGYcc_iuoFo/hqdefault.jpg",
        "title": "Mafia: The Old Country Review - The Final Verdict",
        "vote": 0
    }
]