[
    {
        "age": null,
        "album": "",
        "author": "/u/IamJAX",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-11T22:19:58.555293+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-11T21:58:04+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: Someone keeps getting into my Gmail and Google Sheets even after password reset, logging out all devices, and enabling 2FA. Only trusted devices show up, but data is still being deleted and emails are being sent. How do I secure the account?</p> <p>Hey folks,</p> <p>I need some advice. Someone has been getting into our Gmail account and Google Sheets. They’re deleting important data in Sheets and also sending emails from our Gmail ID.</p> <p>Here’s what we’ve already done: • Changed the account password. • Logged out of all devices. • Enabled 2FA (it was already on). • Logged back in only on trusted devices.</p> <p>Even after all that, the account still shows signs of unauthorized access. Google’s activity log and account behavior prove someone else is sneaking in, but the device list only shows our known devices.</p> <p>So my questions: 1. How can someone still get in even after password reset + 2FA? 2. Is this some kind of session hijacking o",
        "id": 3552607,
        "language": "en",
        "link": "https://www.reddit.com/r/hackers/comments/1nelv6k/how_to_stop_someone_from_accessing_my_gmail",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 536,
        "source_url": "https://www.reddit.com/r/hackers/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How to stop someone from accessing my Gmail & Google Sheets even with 2FA?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Aliveahahafuck1",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-11T21:09:37.549794+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-11T20:53:33+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I know this is a long shot, and this is genuinely a last desperate attempt at a Hail Mary. I figure there might be some kind of backdoor coding loophole or whatever that I just don&#39;t know about. (I know that this is very likely a stretch, but I&#39;ve driven myself halfway to insanity trying to crack this issue.)</p> <p>For context: </p> <p>The account belongs to a business that I now work for. The issue is, during the acquisition, our name was changed. In the midst of all the chaos of the rebrand, the social media pages never got the updates they needed, including linked emails. All this is to say, I have inherited an account that I can not access, and neither I nor anyone else has a clue what the email or password might be. </p> <p>It would be preferable not to lose all the data and the following that we have already built up, as the analytics and whatnot will make my life a lot easier. Additionally, getting the account taken down will also be a",
        "id": 3552139,
        "language": "en",
        "link": "https://www.reddit.com/r/hackers/comments/1nekau9/is_there_a_way_to_find_the_password_that_was_used",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 536,
        "source_url": "https://www.reddit.com/r/hackers/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is there a way to find the password that was used to create an account that is not yours?",
        "vote": 0
    }
]