[
    {
        "age": null,
        "album": "",
        "author": "MiniWarGaming",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-11T19:21:08.864992+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-11T18:00:42+00:00",
        "description": "Two decades of dust have not dulled the Thousand Sons’ thirst for forbidden relics. In today’s relic-snatching classic, Luka brings a 4th edition-flavored host of Rubric Marines, scarab-clad terminators, and enough screamers to make the Warp feel crowded, all led by a sorcerer who seems very sure this “relic” is worth the trouble. Opposing them is Andrew the Battlechicken, commanding the Witch Hunters in a defend-the-shrine scenario straight out of the codex - complete with flamers, faith points, and penitents who take “aggressive negotiation” very literally.\n\nAs the Saint’s remains lie entombed within the shrine, bolter shells and holy fire collide in the ruins. Screamers dive-bomb the faithful, psychic bolts streak through the smoke, and the Canoness proves she is not here for background NPC duty. It’s a fight for the heart of the battlefield, the honor of the Imperium, and possibly the most impractical demonic paperweight in the galaxy. \n\nMembers to watch the Post Game show, go her",
        "id": 3551285,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=g4RkrNiF3f4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 768,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC2mQ7x6K74NBfmxBoMwZCnw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/g4RkrNiF3f4/hqdefault.jpg",
        "title": "Defend the Shrine! - Thousand Sons vs Witch Hunters Warhammer 40k 4th Edition Battle Report Ep 24",
        "vote": 0
    }
]