[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T16:01:17.728068+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T15:30:28+00:00",
        "description": "For all the success that Battlefield 6 has had – this many millions estimated to have been sold, that many concurrent players on Steam – there's one aspect that's stuck out like a sore thumb for some players. If you and many others have outright ignored, lost in the bliss that is multiplayer (even with its idiosyncrasies and flaws), then it's probably for the best. The campaign, the series's first since Battlefield 5 in 2018, isn't very good according to some players.\n\nIt's ironic, in a way. Battlefield 2042 received extensive criticism for dropping any semblance of a story mode and still charging $70 for it. Along comes Battlefield 6, the biggest title in the franchise yet, and it's receiving flak for what's essentially a dull campaign. Boiling down the argument into “damned if you do, damned if you don't” is easy enough, but the point still stands: Whether Electronic Arts includes it or not, the campaign should be fun. So is it? As the saying goes, your mileage will vary.",
        "id": 3802490,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=nUTRZRzpN3k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nUTRZRzpN3k/hqdefault.jpg",
        "title": "Is Battlefield 6's Campaign Mode Better Than You Think?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T14:03:11.196514+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T13:30:03+00:00",
        "description": "What is an open-world game if not a massive virtual landscape laden with stories, secrets, and extensive ground to cover? Much more, as it turns out, with the genre producing some of the finest games ever made. \n\nWhether you're interested in memorable narratives, incredible immersion, massive environments to mess around in or all of the above, the open world genre is more than worth looking into. \n\nBut which titles should you prioritize? Check out our picks for the 30 best open-world games of all time as of 2025.",
        "id": 3800472,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=0giTsF8oEyM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0giTsF8oEyM/hqdefault.jpg",
        "title": "30 BEST Open World Games of All Time You Absolutely NEED TO EXPERIENCE [2025 Edition]",
        "vote": 0
    }
]