[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T22:50:30.164186+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T22:40:00+00:00",
        "description": "Google's viral Nano Banana AI image editor is being woven into Search, NotebookLM, and Photos. Engadget reports: Perhaps the most notable integration here is with NotebookLM. Nano Banana is being used to drastically change up Video Overviews, offering up six new styles like watercolor and anime. It also now generates contextual illustrations based on sources and there's a new option for micro-videos called Briefs. For the uninitiated, Video Overviews is a neat little tool available to NotebookLM users that automatically generates explainer videos from documents. It can even whip up a narrated slideshow with visuals. The AI-heavy update starts rolling out to Pro users this week and to all users in \"the upcoming weeks.\"\n \nSearch integration offers new ways to make and edit images while using the official Google app. The company says folks can use a chat prompt to, say, ask the bot to create a stylized version of a pre-existing image. Additionally, photos can be snapped directly from the",
        "id": 3805644,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/2130203/googles-nano-banana-ai-image-editing-is-coming-to-search-notebooklm-and-photos",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Nano Banana AI-Image Editing Is Coming to Search, NotebookLM and Photos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T22:50:30.364295+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T22:00:00+00:00",
        "description": "\"Dutch authorities have temporarily nationalized Nexperia, owned by Chinese company Wingtech, over fears of critical product unavailability,\" writes longtime Slashdot reader evil_aaronm. Reuters reports: The Hague invoked never-before-used powers under a Dutch law known as the \"Availability of Goods Act.\" The decision led to a 10% fall in Wingtech's shares in Shanghai on Monday. The Dutch government will not take ownership of Nexperia, but it will now have the power to reverse or block management decisions it considers harmful. The company's regular production is continuing. [...] Wingtech called the Dutch government's intervention in Nexperia, once part of Dutch electronics group Philips, \"excessive interference driven by geopolitical bias.\" Wingtech also alleged that non-Chinese Nexperia executives had tried to forcibly alter the company's equity structure through legal proceedings in a \"cloaked power grab\" on the company.\n \nA copy of an Amsterdam commercial court ruling dated Octob",
        "id": 3805645,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/13/2121258/dutch-government-takes-control-of-china-owned-chipmaker-nexperia",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dutch Government Takes Control of China-Owned Chipmaker Nexperia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T21:31:21.431068+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T21:20:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Owners of some Jeep Wrangler 4xe hybrids have been left stranded after installing an over-the-air software update this weekend. The automaker pushed out a telematics update for the Uconnect infotainment system that evidently wasn't ready, resulting in cars losing power while driving and then becoming stranded. Stranded Jeep owners have been detailing their experiences in forum and Reddit posts, as well as on YouTube. The buggy update doesn't appear to brick the car immediately. Instead, the failure appears to occur while driving -- a far more serious problem. For some, this happened close to home and at low speed, but others claim to have experienced a powertrain failure at highway speeds.\n \nJeep pulled the update after reports of problems, but the software had already downloaded to many owners' cars by then. A member of Stellantis' social engagement team told 4xe owners at a Jeep forum to ignore the update pop-up if they haven't ",
        "id": 3805116,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/2115229/software-update-bricks-some-jeep-4xe-hybrids-over-the-weekend",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Software Update Bricks Some Jeep 4xe Hybrids Over the Weekend",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T20:10:04.694590+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T19:33:00+00:00",
        "description": "Car manufacturers decided they would rather cheat to prioritise \"customer convenience\" and sell cars than comply with the law on deadly pollutants, the first day of the largest group action trial in English legal history has been told. From a report: More than a decade after the original \"dieselgate\" scandal broke, lawyers representing 1.6 million diesel car owners in the UK argue that manufacturers deliberately installed software to rig emissions tests. They allege the \"prohibited defeat devices\" could detect when the cars were under test conditions and ensure that harmful NOx emissions were kept within legal limits, duping regulators and drivers. \n\nShould the claim be upheld, estimated damages could exceed $8 billion. The three-month hearing that opened at London's high court on Monday will focus on vehicles sold by five manufacturers -- Mercedes, Ford, Renault, Nissan and Peugeot/Citroen -- from 2009. In \"real world\" conditions, when driven on the road, lawyers argue, the cars prod",
        "id": 3804611,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/1933213/carmakers-chose-to-cheat-to-sell-cars-rather-than-comply-with-emissions-law-dieselgate-trial-told",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Carmakers Chose To Cheat To Sell Cars Rather Than Comply With Emissions Law, 'Dieselgate' Trial Told",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T18:55:29.309804+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T18:13:00+00:00",
        "description": "BrianFagioli writes: TP-Link has officially achieved the first successful Wi-Fi 8 connection using a prototype device built through an industry collaboration. The company confirmed that both the beacon and data throughput worked, marking a real-world validation of next-generation wireless tech. It's an early glimpse of what the next leap in speed and reliability could look like, even as the Wi-Fi 8 standard itself remains under development. The Verge adds: Like its predecessor, Wi-Fi 8 will utilize 2.4GHz, 5GHz, and 6GHz bands with a theoretical maximum channel bandwidth of 320MHz and peak data rate of 23Gbps, but aims to improve real-world performance and connection reliability. The goal is to provide better performance in environments with low signal, or under high network loads, where an increasing number of devices are sharing the same connection.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=TP-Link+Makes+Hist",
        "id": 3804022,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/13/1813236/tp-link-makes-history-with-first-successful-wi-fi-8-connection",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TP-Link Makes History With First Successful Wi-Fi 8 Connection",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T17:36:37.769581+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T17:22:00+00:00",
        "description": "Chinese companies now produce most of the world's freely available AI models. DeepSeek leads Hugging Face in popularity. Chinese firms like Alibaba receive higher ratings than OpenAI and Meta on LMArena. The site uses blind tests to measure user preferences. Chinese developers ship open models more frequently than American rivals. \n\nIrene Solaiman is chief policy officer at Hugging Face. She said Chinese companies build their user base by shipping frequently and quickly. American companies like OpenAI and Google keep their best models proprietary. Meta once led in open AI models. Mark Zuckerberg argued last year that the world would benefit if AI companies shared their technology freely. He pledged Meta would release its AI openly. The company has since become more cautious. Zuckerberg wrote in a new essay that Meta might need to keep the best models for itself.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+I",
        "id": 3803432,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/13/1719227/china-is-shipping-more-open-ai-models-than-us-rivals-as-tech-competition-shifts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Is Shipping More Open AI Models Than US Rivals as Tech Competition Shifts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T17:36:37.841750+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T16:40:00+00:00",
        "description": "California Governor Gavin Newsom signed three bills on Monday that establish the nation's most comprehensive framework for regulating how technology companies interact with minors. AB 56 requires social media platforms to display health warnings to users under 18. A child must view a skippable ten-second warning upon logging on each day. An unskippable thirty-second warning must appear if a child spends more than three hours on a platform. That warning repeats after each additional hour. The warnings must state that social media \"can have a profound risk of harm to the mental health and well-being of children and adolescents.\" Minnesota passed a similar law in July. \n\nSB 243 makes California the first state to regulate AI companion chatbots. The law takes effect January 1, 2026. Companies must implement age verification and disclose that interactions are artificially generated. Chatbots cannot represent themselves as healthcare professionals. Companies must offer break reminders to mi",
        "id": 3803433,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/13/1617250/three-new-california-laws-target-tech-companies-interactions-with-children",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Three New California Laws Target Tech Companies' Interactions with Children",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T16:17:04.504495+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T16:01:00+00:00",
        "description": "Philadelphia culture has become inescapable in certain corners of the internet. People who spend substantial time online report developing knowledge of the city's cultural touchstones and forming opinions about its regional debates despite minimal or no physical presence there, according to a new report. The phenomenon has prompted a theory: prolonged exposure to these digital spaces can make someone spiritually and culturally Philadelphian regardless of geography. \n\nSeveral factors explain Philadelphia's outsized online presence. The city is large but retains a small-town sensibility. Its residents wake earlier than West Coast users and can set the daily online agenda. Philadelphia sports teams have performed well for twenty-five years. The internet rewards visual absurdity and energetic presentation. Gritty functions as both hockey mascot and anti-fascist meme. The city's working-class union identity and reliably anti-Trump stance align with leftist online communities. The alternati",
        "id": 3802578,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/1421258/does-the-internet-have-a-philly-accent-why-too-much-time-online-can-make-you-culturally-philadelphian",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Does the Internet Have a Philly Accent? Why Too Much Time Online Can Make You 'Culturally Philadelphian.'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T16:17:04.764271+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T15:22:00+00:00",
        "description": "Climate change has pushed warm-water coral reefs past a point of no return, marking the first time a major climate tipping point has been crossed, according to a report released on Sunday by an international team in advance of the United Nations Climate Change Conference COP30 in Brazil this November. From a report: Tipping points include global ice loss, Amazon rainforest loss, and the possible collapse of vital ocean currents. Once crossed, they will trigger self-perpetuating and irreversible changes that will lead to new and unpredictable climate conditions. But the new report also emphasizes progress on positive tipping points, such as the rapid rollout of green technologies. \n\n\"We can now say that we have passed the first major climate tipping point,\" said Steve Smith, the Tipping Points Research Impact Fellow at the Global Systems Institute and Green Futures Solutions at the University of Exeter, during a media briefing on Tuesday. \"But on the plus side,\" he added, \"we've also p",
        "id": 3802579,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/13/1340224/earths-climate-has-passed-its-first-irreversible-tipping-point-and-entered-a-new-reality",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Earth's Climate Has Passed Its First Irreversible Tipping Point and Entered a 'New Reality'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T16:17:04.916071+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T14:41:00+00:00",
        "description": "An anonymous reader shares a report: Last week, sounding like a digital media consultant, Pope Leo XIV urged reporters to avoid \"the degrading practice of so-called clickbait.\" He was addressing global news agencies at a gathering in Vatican City about the risks of a post-truth world, with a speech that also doubled as a severe societal warning about the dangers of AI. \n\n\"Artificial intelligence is changing the way we receive information and communicate, but who directs it and for what purposes?\" the pontiff said, according to Reuters. \"We must be vigilant in order to ensure that technology does not replace human beings.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Pope+Urges+Vigilance+About+Who+Controls+AI%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F13%2F1316200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http:",
        "id": 3802580,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/13/1316200/the-pope-urges-vigilance-about-who-controls-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Pope Urges Vigilance About Who Controls AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T14:42:28.143214+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T14:00:00+00:00",
        "description": "OpenAI and Broadcom are working together to develop and deploy 10 gigawatts of custom AI chips and computing systems over the next four years, a high-profile partnership aimed at satisfying some of the startup's immense computing needs. From a report: OpenAI plans to design its own graphics processing units, or GPUs, which will allow it to integrate what it has learned from developing powerful artificial-intelligence models into the hardware that underpins future systems. As part of the agreement announced Monday, the chips will be co-developed by OpenAI and Broadcom and deployed by the chip company starting in the second half of next year. The new agreement will be worth multiple billions of dollars, people familiar with the matter said. \n\nBroadcom specializes in designing custom AI chips that are specifically tailored to certain artificial-intelligence applications. It began working with OpenAI on creating a custom chip 18 months ago, and the companies broadened their partnership to",
        "id": 3800595,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/13/1334226/openai-broadcom-forge-multibillion-dollar-chip-development-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI, Broadcom Forge Multibillion-Dollar Chip-Development Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T14:42:28.341060+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T11:34:00+00:00",
        "description": "Enthusiasm for Sora 2 \"wasn't shared in Hollywood,\" reports the Los Angeles Times, \"where the new AI tools have created a swift backlash\" that \"appears to be only just the beginning of a bruising legal fight that could shape the future of AI use in the entertainment business.\"\n\n\n[OpenAI] executives went on a charm offensive last year. They reached out to key players in the entertainment industry &mdash; including Walt Disney Co. &mdash; about potential areas for collaboration and trying to assuage concerns about its technology. This year, the San Francisco-based AI startup took a more assertive approach. Before unveiling Sora 2 to the general public, OpenAI executives had conversations with some studios and talent agencies, putting them on notice that they need to explicitly declare which pieces of intellectual property &mdash; including licensed characters &mdash; were being opted-out of having their likeness depicted on the AI platform, according to two sources familiar with the mat",
        "id": 3800596,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/13/0456233/hollywood-demands-copyright-guardrails-from-sora-2---while-users-complain-thats-less-fun",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hollywood Demands Copyright Guardrails from Sora 2 - While Users Complain That's Less Fun",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T08:22:03.058448+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T07:34:00+00:00",
        "description": "\"It's not just you: Flatpak flat-out doesn't work in the new Ubuntu 25.10 release,\" writes the blog OMG Ubuntu:\n\n\nWhile Flatpak itself can be installed using apt, trying to install Flatpaks with Flatpak from the command-line throws a \"could not unmount revokefs-fuse filesystem\" error, followed by \"Child process exited with code 1\". For those who've installed the Ubuntu 'Questing Quokka' and wanted to kit it out with their favourite software from Flathub, it's a frustrating road bump. \n\n\nAppArmor, the tool that enforces Ubuntu's security policies for apps, is causing the issue. According to the bug report on Launchpad, the AppArmor profile for fusermount3 lacks the privileges it needs to work properly in Ubuntu 25.10. Fusermount3 is a tool Flatpak relies on to mount and unmount filesystems... This is a bug and it is being worked on. Although there's no timeframe for a fix, it is marked as critical, so will be prioritised. \n\n\nThe bug was reported in early September, but not fixed in tim",
        "id": 3799708,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/13/067256/flatpak-doesnt-work-in-ubuntu-2510-but-a-fix-is-coming",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Flatpak Doesn't Work in Ubuntu 25.10, But a Fix is Coming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T06:54:05.475443+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T04:34:00+00:00",
        "description": "An anonymous reader shared this excerpt from a Los Angeles Times newsletter:\n\n\nOne of the most consequential moments in California's drive to beat back climate change will take place next month. The state will stop receiving electricity from the Intermountain Power Plant in Central Utah, meaning our reliance on coal as a source of power will essentially be over... \n\n[T]he U.S. got nearly half its electricity from coal-fired plants as recently as 2007. By 2023, that figure had dropped to just 16.2%. California drove an even more dramatic shift, getting just 2.2% of its electricity from coal in 2024 &mdash; nearly all of it from the Intermountain plant. Operators plan to cut off that final burst of ions next month. \n\"And with improved technology to store power, the change has been made without the power shortages that dogged the state up until 2020...\"5<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=California+Will+St",
        "id": 3799038,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/13/032224/california-will-stop-using-coal-as-a-power-source-next-month",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Will Stop Using Coal as a Power Source Next Month",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T06:54:05.548642+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T02:40:00+00:00",
        "description": "ScienceDaily reports:\n\nOur everyday GPS struggles in \"urban canyons,\" where skyscrapers bounce satellite signals, confusing even advanced navigation systems. Norwegian University of Science and Technology (NTNU) scientists created SmartNav, combining satellite corrections, wave analysis, and Google's 3D building data for remarkable precision. Their method achieved accuracy within 10 centimeters during testing [90% of the time]. The breakthrough could make reliable urban navigation accessible and affordable worldwide... \n\n\n\"Cities are brutal for satellite navigation,\" explained Ardeshir Mohamadi. Mohamadi, a doctoral fellow at NTNU, is researching how to make affordable GPS receivers (like those found in smartphones and fitness watches) much more precise without depending on expensive external correction services.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Why+GPS+Fails+In+Cities.+And+What+Researchers+Think+Coul",
        "id": 3799039,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/13/029238/why-gps-fails-in-cities-and-what-researchers-think-could-fix-it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why GPS Fails In Cities. And What Researchers Think Could Fix It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-13T06:54:05.622980+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-13T01:40:00+00:00",
        "description": "It's the largest nuclear power plant in Europe. But \"Ukraine's foreign minister accused Russia on Sunday of deliberately severing the external power line to the Russian-held Zaporizhzhia nuclear power station,\" reports Reuters, \"in order to link the plant to Moscow's power grid.\"\n\nUkrainian Foreign Minister Andrii Sybiha said Moscow was attempting to test a reconnection to Russia's grid. Ukraine has long feared that Moscow would try to redirect the plant's output to its grid. But Russian officials have denied any intention of trying to restart the plant, seized by Moscow's forces in the early weeks of the February 2022 invasion of Ukraine. \n\nThe plant produces no electricity at the moment, but has been without an external electricity source for nearly three weeks. Officials have relied on emergency diesel generators to secure the power needed to keep the fuel cool inside the facility and guard against a meltdown. \"Russia intentionally broke the plant's connection with the Ukrainian gr",
        "id": 3799040,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/0138207/russia-accused-of-severing-ukrainian-nuclear-power-plants-link-as-energy-remains-a-key-battleground",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Accused of Severing Ukrainian Nuclear Power Plant's Link, as Energy Remains a 'Key Battleground'",
        "vote": 0
    }
]