[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T21:34:44.446296+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T20:00:07+00:00",
        "description": "id Software started DOOM with some of the hardest lines ever written in a video game, and nothing had happened yet. To further set the stage for what was to come, the 2016 soft reboot/sequel didn't have any pre-release reviews. No one knew what to expect, and given the reputation of Bethesda Softworks, at least when it came to such embargos, there was skepticism.\n\nIt all came crashing down with that first Glory Kill. That first satisfying crunch. Immediately, it was apparent that DOOM was something special and, above all else, back.\n\nAs noted in Part 1, The journey had been long for the Doom Marine. When we last left off, he had returned to Hell to take down the Resurrector, wreaking havoc on all demons before finally emerging victorious. After everything that happened – the invasions of Earth, the constant transgressions of demonic forces – the Doom Marine reaffirmed his plan to stay in Hell and make the lives of its many nefarious denizens that much more painful.\n\nLink to Part 1: ht",
        "id": 2624890,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5-o__XA6Bs8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5-o__XA6Bs8/hqdefault.jpg",
        "title": "What Happened In DOOM 2016? - Full Story (Part 2) - Before You Play DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T16:14:17.232836+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T15:01:07+00:00",
        "description": "Rockstar Games' Grand Theft Auto 6 has been delayed to next year, stretching out the wait even more for long-time fans, but a new trailer, images and details are finally available. We can see Leonida in all its glory with various stunning locations, but we've also learned more about the narrative and characters.\n\nAs stunning as the cutscenes look, it's interesting how many gameplay elements were showcased through the various images. Fishing finally arrives, and players can also venture underwater in Leonida Keys. Mount Kalaga offers plenty of room for dirt biking and ATV activities, and minigolf, last seen in Grand Theft Auto 4, finally returns.\n\nIt's a lot to take in and likely only scratches the surface of what Grand Theft Auto 6 has to offer. Let's dive into several other features you can expect to see when it launches on May 26th, 2026, for Xbox Series X/S and PS5.",
        "id": 2622277,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cinM6HQ-A1E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cinM6HQ-A1E/hqdefault.jpg",
        "title": "GTA 6 - 15 GAMEPLAY FEATURES That Are Almost Certainly Happening",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T10:07:11.075037+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T10:01:01+00:00",
        "description": "From a sudden delay and the potential void of no new trailer until months later to screenshots, story details, characters, and yes, Trailer 2 out of the blue – the past few days have been a rollercoaster for Grand Theft Auto 6 fans. \n\nRockstar Games hasn't revealed proper, extensive gameplay, but the latest trailer finally shines a light on what's happening in its next big sequel. Jason's name is finally confirmed, as his backstory and Lucia's are finally detailed. \n\nA score going wrong is the backdrop for their escapades across the fictitious Leonida, as they encounter many other characters and locales beyond the Vice City we know and love.",
        "id": 2619119,
        "language": null,
        "link": "https://www.youtube.com/watch?v=XPOCSXFQrfM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XPOCSXFQrfM/hqdefault.jpg",
        "title": "Why Grand Theft Auto 6 Could Be The MOST IMMERSIVE Game In The Series",
        "vote": 0
    }
]