[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T23:25:11.132946+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T23:00:00+00:00",
        "description": "Netflix has officially launched a new AI-powered search feature that uses OpenAI's ChatGPT to deliver a conversational content discovery experience, allowing users to describe what they're looking for in natural language. The streaming giant is also getting into short videos with a new vertical feed set to rival Instagram Reels and TikTok. TechCrunch reports: Users can enter their preferences using natural phrases like \"I want something funny and upbeat\" or even more detailed requests, such as \"I want something scary, but not too scary, and maybe a little bit funny, but not haha funny.\" The feature is set to roll out this week to iOS users as an opt-in beta. Some subscribers in Australia and New Zealand have already had access to it, as reported by Bloomberg last month. [...] Additionally, at the tech and product event, the company mentioned plans to use generative AI to update title cards in subscribers' preferred languages. Other features revealed on Wednesday include a short-form v",
        "id": 2625525,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/07/197232/netflix-debuts-gen-ai-powered-search-tool-tests-vertical-videos-for-mobile?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Netflix Debuts Gen AI-Powered Search Tool, Tests Vertical Videos For Mobile",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T23:25:11.246418+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T22:20:00+00:00",
        "description": "Phoronix's Michael Larabel reports: Last July it was announced Holly Million was stepping down as the GNOME Foundation's Exeuctive Director after less than a year at the helm. Richard Littauer took over as interim Executive Director while this week a new GNOME Foundation Executive Director was hired.\n \nGNOME's new Executive Director is Steven Deobald. Steven Deobald is a Canadian free software advocate and has been a GNOME user since 2002. As the GNOME Foundation Executive Director, Steven wants to focus on transparency and to better ensure financial stability of the GNOME Foundation. You can read Deobald's welcoming statements on blogs.gnome.org.\n \nFurther reading: Is It Time For a Change In GNOME Leadership?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+GNOME+Executive+Director+Named%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F05%2F07%2F200259%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"",
        "id": 2625526,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/07/200259/new-gnome-executive-director-named?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New GNOME Executive Director Named",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T22:20:08.173865+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T21:40:00+00:00",
        "description": "An anonymous reader quotes a report from CNBC: There's a new warehouse robot at Amazon that has a sense of touch, allowing it to handle a job previously only done by humans. Amazon unveiled the robot, called Vulcan, Wednesday at an event in Germany. CNBC got an exclusive first look at Vulcan in April, as it stowed items into tall, yellow bins at a warehouse in Spokane, Washington. An up-close look at the \"hand\" of the robot reveals how it can feel the items it touches using an AI-powered sensor to determine the precise pressure and torque each object needs. This innovative gripper helps give Vulcan the ability to manipulate 75% of the 1 million unique items in inventory at the Spokane warehouse. Amazon has used other robotic arms inside its warehouses since 2021, but those rely on cameras for detection and suction for grasp, limiting what types of objects they can handle.\n \nVulcan can also operate 20 hours a day, according to Aaron Parness, who heads up the Amazon Robotics team that d",
        "id": 2625169,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/07/1930242/amazon-says-new-warehouse-robot-can-feel-items-but-wont-replace-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Says New Warehouse Robot Can 'Feel' Items, But Won't Replace Workers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T21:15:24.589149+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T21:00:00+00:00",
        "description": "Harman International, a Samsung subsidiary, announced it is acquiring Masimo's consumer audio division for $350 million in cash. \"The deal is expected to finalized by the end of 2025, though it's still subject to regulatory approvals,\" notes Engadget. From the report: Samsung purchased Harman International back in 2017 for $8 billion, though it allowed the company to operate as an independent subsidiary. Harman's brands include JBL, Harman Kardon, AKG, Mark Levinson, Arcam and Revel. If and when the acquisition pushes through, Masimo's audio brands under Sound United will be added to the list, including Bowers &amp; Wilkins, Denon, Marantz and Polk Audio. [...]\n \nAs noted by The Verge, Samsung published a press release, where it briefly talked about the history of the brands it's acquiring. It mentioned some of Bowers &amp; Wilkins' most iconic products, such as the Nautilus loudspeaker (pictured above) and its Zeppelin wireless speaker, as well as Denon's history as an early adopter ",
        "id": 2624437,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/07/1915252/samsung-acquires-masimos-audio-business-for-350-million?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung Acquires Masimo's Audio Business For $350 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T21:15:24.702348+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T20:20:00+00:00",
        "description": "According to Bloomberg, the Trump administration plans to revise a set of chip trade restrictions called the \"AI diffusion\" rule, which were scheduled to take effect on May 15. CNBC reports: The rule, which was proposed in the last days of the Biden administration, organizes countries into three different tiers, all of which have different restrictions on whether advanced AI chips like those made by Nvidia, AMD, and Intel can be shipped to the country without a license.\n \nChipmakers including Nvidia and AMD have been against the rule. AMD CEO Lisa Su told CNBC on Wednesday that the U.S. should strike a balance between restricting access to chips for national security and providing access, which will boost the American chip industry. Nvidia CEO Jensen Huang said earlier this week that being locked out of the Chinese AI market would be a \"tremendous loss.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Will+Resc",
        "id": 2624438,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/07/2018224/trump-will-rescind-biden-era-ai-chip-export-curbs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Will Rescind Biden-Era AI Chip Export Curbs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T21:15:24.820474+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T19:40:00+00:00",
        "description": "Eddy Cue, Apple's senior vice president of services, gave an ominous warning today that the iPhone could go the way of the iPod 10 years from now. From a report: Cue's remarks came during the Google Search antitrust remedies trial today while discussing how AI has the potential to reshape the tech industry and open the door to new entrants. Incumbents have a hard time ... we're not an oil company, we're not toothpaste -- these are things that are going to last forever ... you may not need an iPhone 10 years from now. \n\nCue went on to say that the best thing Apple did was kill the iPod, a move he said was bold. \"Why would you kill the golden goose,\" he added. That may seem like a silly thing for Apple to say, given that more than half of its revenue is iPhone sales. But Cue calls AI a \"huge technological shift,\" and suggests that such shifts can humble companies that once seemed unassailable.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://t",
        "id": 2624439,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/07/1856254/apples-eddy-cue-you-may-not-need-an-iphone-10-years-from-now?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple's Eddy Cue: 'You May Not Need an iPhone 10 Years From Now'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T19:10:54.957571+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T19:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Broadcom has been sending cease-and-desist letters to owners of VMware perpetual licenses with expired support contracts, Ars Technica has confirmed. Following its November 2023 acquisition of VMware, Broadcom ended VMware perpetual license sales. Users with perpetual licenses can still use the software they bought, but they are unable to renew support services unless they had a pre-existing contract enabling them to do so. The controversial move aims to push VMware users to buy subscriptions to VMware products bundled such that associated costs have increased by 300 percent or, in some cases, more. Some customers have opted to continue using VMware unsupported, often as they research alternatives, such as VMware rivals or devirtualization.\n \nOver the past weeks, some users running VMware unsupported have reported receiving cease-and-desist letters from Broadcom informing them that their contract with VMware and, thus, their right",
        "id": 2623793,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/07/1856255/vmware-perpetual-license-holders-receive-cease-and-desist-letters-from-broadcom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VMware Perpetual License Holders Receive Cease-And-Desist Letters From Broadcom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T19:10:55.078508+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T18:10:00+00:00",
        "description": "The curl open source project is fighting against a flood of AI-generated false security reports. Daniel Stenberg, curl's original author and lead developer, declared on LinkedIn that they are \"effectively being DDoSed\" by these submissions. \n\n\"We still have not seen a single valid security report done with AI help,\" Stenberg wrote. This week alone, four AI-generated vulnerability reports arrived seeking reputation or bounties, ArsTechnica writes. One particularly frustrating May 4 report claiming \"stream dependency cycles in the HTTP/3 protocol stack\" pushed Stenberg \"over the limit.\" The submission referenced non-existent functions and failed to apply to current versions. \n\nSome AI reports are comically obvious. One accidentally included its prompt instruction: \"and make it sound alarming.\" Stenberg has asked HackerOne, which manages vulnerability reporting, for \"more tools to strike down this behavior.\" He plans to ban reporters whose submissions are deemed \"AI slop.\"<p><div class=\"",
        "id": 2623794,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/07/1750249/curl-battles-wave-of-ai-generated-false-vulnerability-reports?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Curl Battles Wave of AI-Generated False Vulnerability Reports",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T18:06:08.615171+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T17:33:00+00:00",
        "description": "Data storage firm Seagate is working to develop a 100-terabyte hard drive by 2030, touting blistering demand from data centers for the 70-year-old technology in the artificial intelligence boom. From a report: BS Teh, Seagate's chief commercial officer, told CNBC that the company is aiming to launch such a drive -- which would have about three times the capacity of the firm's top-of-the-line hard drives -- by 2030. The largest hard disk drive Seagate currently produces is the 36-terabyte Exos M model, which it launched in January. \n\n\"You may be thinking, 'Who would need it?'\" Teh said, referring to the idea of a 100-terabyte hard drive. \"Well, plenty.\" He added: \"I think there's definitely strong demand. This is a key enabler for the industry to be able to deliver the storage capacity that the market needs, because there's no other technology that's able to produce this capacity of storage technology to meet the growth that the market needs.\"<p><div class=\"share_submission\" style=\"pos",
        "id": 2623199,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/07/1734205/seagate-working-to-develop-a-100tb-hard-drive-by-2030?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Seagate Working To Develop a 100TB Hard Drive By 2030",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T16:59:28.348664+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T16:45:00+00:00",
        "description": "Apple is \"actively looking at\" revamping the Safari web browser on its devices to focus on AI-powered search engines, a seismic shift for the industry hastened by the potential end of a longtime partnership with Google. From a report: Eddy Cue, Apple's senior vice president of services, made the disclosure Wednesday during his testimony in the US Justice Department's lawsuit against Alphabet. The heart of the dispute is the two companies' estimated $20 billion-a-year deal that makes Google the default offering for queries in Apple's browser. The case could force the tech giants to unwind the pact, upending how the iPhone and other devices have long operated. \n\nCue noted that searches on Safari dipped for the first time last month, which he attributed to people using AI. Cue said he believes that AI search providers, including OpenAI, Perplexity and Anthropic, will eventually replace standard search engines like Alphabet's Google. He said he believes Apple will bring those options to S",
        "id": 2622638,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/07/1645257/apple-working-to-move-to-ai-search-in-browser-amid-google-fallout?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Working To Move To AI Search in Browser Amid Google Fallout",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T16:59:28.468943+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T16:04:00+00:00",
        "description": "The Drug Enforcement Administration has quietly ended its body camera program barely four years after it began, ProPublica reports, citing an internal email. From the report: On April 2, DEA headquarters emailed employees announcing that the program had been terminated effective the day before. The DEA has not publicly announced the policy change, but by early April, links to pages about body camera policies on the DEA's website were broken. \n\nThe email said the agency made the change to be \"consistent\" with a Trump executive order rescinding the 2022 requirement that all federal law enforcement agents use body cameras. But at least two other federal law enforcement agencies within the Justice Department -- the U.S. Marshals Service and the Bureau of Alcohol, Tobacco, Firearms and Explosives -- are still requiring body cameras, according to their spokespeople.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DEA+Ends+",
        "id": 2622640,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/07/1525236/dea-ends-body-camera-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DEA Ends Body Camera Program",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T15:55:20.831481+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T15:22:00+00:00",
        "description": "Instagram co-founder Kevin Systrom says AI companies are trying too hard to \"juice engagement\" by pestering their users with follow-up questions, instead of providing actually useful insights. From a report: Systrom said the tactics represent \"a force that's hurting us,\" comparing them to those used by social media companies to expand aggressively. \n\n\"You can see some of these companies going down the rabbit hole that all the consumer companies have gone down in trying to juice engagement,\" he said at StartupGrind this week. \"Every time I ask a question, at the end it asks another little question to see if it can get yet another question out of me.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Chatbots+Are+'Juicing+Engagement'+Instead+of+Being+Useful%2C+Instagram+Co-founder+Warns%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F07%2F1515211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.",
        "id": 2621947,
        "language": null,
        "link": "https://slashdot.org/story/25/05/07/1515211/ai-chatbots-are-juicing-engagement-instead-of-being-useful-instagram-co-founder-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Chatbots Are 'Juicing Engagement' Instead of Being Useful, Instagram Co-founder Warns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T15:55:20.945172+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T14:45:00+00:00",
        "description": "Waymo's autonomous vehicles operating on Uber's platform in Austin are completing more trips per day than over 99% of human drivers in the market, according to Uber's Q1 2025 earnings report [PDF] released Wednesday. The fleet of approximately 100 autonomous Waymo vehicles, launched exclusively on Uber in March, has \"exceeded expectations,\" CEO Dara Khosrowshahi stated in the report. \n\nHe cited the performance to \"Waymo's safety record and rider experience coupled with Uber's scale and reliability.\" Uber has rapidly expanded its autonomous vehicle operations, reaching an annual run-rate of 1.5 million mobility and delivery AV trips across its network. The company plans to scale to hundreds of vehicles in Austin in the coming months, while preparing for a launch in Atlanta by early summer. Khosrowshahi said that autonomous vehicle technology represents \"the single greatest opportunity ahead for Uber.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=",
        "id": 2621948,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/07/1445228/uber-says-waymo-autonomous-vehicles-outperforming-99-of-human-drivers-in-austin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Uber Says Waymo Autonomous Vehicles Outperforming 99% of Human Drivers in Austin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T14:49:22.577950+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T14:03:00+00:00",
        "description": "IBM CEO Arvind Krishna said the tech giant has used AI, and specifically AI agents, to replace the work of a couple hundred human resources workers. As a result, it has hired more programmers and salespeople, he said. From a report: Krishna's comments on Monday come as businesses sort through the workforce impacts of AI and AI agents, the independent bots that can autonomously perform tasks like analyze spreadsheets, conduct research and draft emails. \n\nWhile there haven't yet been widespread layoffs or downsizing as a result of AI across the economy, some business leaders have said they are holding down head count as they investigate the use of the technology. \n\nMeanwhile, the information-technology workforce has continued to shrink as AI weighs on hiring and some workers leave the field. For IBM, which this week hosts its annual Think conference in Boston, AI adoption has led it to boost hiring in some functions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"",
        "id": 2621131,
        "language": null,
        "link": "https://slashdot.org/story/25/05/07/143250/ibm-ceo-says-ai-has-replaced-hundreds-of-workers-but-created-new-programming-sales-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IBM CEO Says AI Has Replaced Hundreds of Workers But Created New Programming, Sales Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T13:15:20.491721+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: The U.S. Federal Trade Commission (FTC) on Monday released new documentation detailing its new \"Rule on Unfair or Deceptive Fees.\" The rule, set to take effect on May 12, prohibits hidden fees for live events, hotels, and short-term rentals. It also bans practices such as \"bait-and-switch pricing\" and any actions that conceal or misrepresent total prices and fees.\n \nIn a newly published FAQ, the FTC offers a guide for these types of businesses, providing detailed information about pricing transparency. The rule will impact businesses, including live-event ticket sellers and short-term lodging providers, like hotels, motels, Airbnb, or VRBO. Third-party platforms, resellers, and travel agents are also covered by the new regulation. (Airbnb already updated its service in advance of this new regulation to show users the total cost of their stay upfront.) [...]\n \nAlso included in the FTC's new FAQ are the types of fees that can be exclu",
        "id": 2620395,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/07/0043243/ftc-bans-hidden-fees-for-live-events-and-short-term-rentals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FTC Bans Hidden Fees For Live Events and Short-Term Rentals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T13:15:20.607090+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T12:00:00+00:00",
        "description": "Researchers have discovered a mutation in the SIK3 gene that enables some people to function normally on just three to six hours of sleep. The finding, published this week in PNAS, adds to a growing list of genetic variants linked to naturally short sleepers. \n\nWhen University of California, San Francisco scientists introduced the mutation to mice, the animals required 31 minutes less sleep daily. The modified enzyme showed highest activity in brain synapses, suggesting it might support brain homeostasis -- the resetting process thought to occur during sleep. \n\n\"These people, all these functions our bodies are doing while we are sleeping, they can just perform at a higher level than we can,\" said Ying-Hui Fu, the study's co-author. This marks the fifth mutation across four genes identified in naturally short sleepers. Fu's team hopes these discoveries could eventually lead to treatments for sleep disorders by revealing how sleep regulation functions in humans.<p><div class=\"share_subm",
        "id": 2620396,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/06/234231/scientists-identify-new-mutation-that-enables-three-hour-sleepers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Identify New Mutation That Enables Three-Hour Sleepers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T10:46:33.227124+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T10:00:00+00:00",
        "description": "The Department of Defense is revamping its \"outdated\" software procurement systems through a new Software Fast Track initiative. The SWFT program aims to reform how software is acquired, tested, and authorized with security as the primary focus. \"Widespread use of open source software, with contributions from developers worldwide, presents a significant and ongoing challenge,\" DoD CIO Katie Arrington wrote in the initiative memo. \n\nThe DoD currently \"lacks visibility into the origins and security of software code,\" hampering security assurance efforts. The initiative will establish verification procedures for software products and expedite authorization processes. Multiple requests for information are running until late May seeking industry input, including how to leverage AI for software authorization and define effective supply chain risk management requirements. \n\nThe push comes amid recent DoD security incidents, from malware campaigns targeting procurement systems to sensitive in",
        "id": 2619291,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/06/230252/pentagon-targets-open-source-security-risks-in-software-procurement-overhaul?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pentagon Targets Open Source Security Risks in Software Procurement Overhaul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T07:31:32.231504+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T07:00:00+00:00",
        "description": "Stratolaunch successfully flew its uncrewed Talon-A2 prototype to hypersonic speeds twice -- once in December and again in March. \"We've now demonstrated hypersonic speed, added the complexity of a full runway landing with prompt payload recovery and proven reusability,\" Stratolaunch President and CEO Zachary Krevor said in a statement on Monday. \"Both flights were great achievements for our country, our company and our partners.\" Space.com reports: Microsoft co-founder Paul Allen established Stratolaunch in 2011, with the goal of air-launching satellites from a giant carrier plane called Roc, which has a wingspan of 385 feet (117 meters). That vision changed after Allen's 2018 death, however; the company is now using Roc as a platform to test hypersonic technology.\n \nHypersonic vehicles are highly maneuverable craft capable of flying at least five times the speed of sound. Their combination of speed and agility make them much more difficult to track and intercept than traditional bal",
        "id": 2618225,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/06/2146219/stratolaunchs-talon-a2-prototype-goes-hypersonic-after-dropping-from-worlds-largest-airplane?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Stratolaunch's Talon-A2 Prototype Goes Hypersonic After Dropping From World's Largest Airplane",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T04:17:35.337363+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Spyware maker NSO Group will have to pay more than $167 million in damages to WhatsApp for a 2019 hacking campaign against more than 1,400 users. On Tuesday, after a five-year legal battle, a jury ruled that NSO Group must pay $167,256,000 in punitive damages and around $444,719 in compensatory damages. This is a huge legal win for WhatsApp, which had asked for more than $400,000 in compensatory damages, based on the time its employees had to dedicate to remediate the attacks, investigate them, and push fixes to patch the vulnerability abused by NSO Group, as well as unspecified punitive damages.\n \nThe trial, as well as the whole lawsuit, prompted a series of revelations, such as the location of the victims of the 2019 spyware campaign, as well as the names of some of NSO Group's customers. The ruling marks the end -- pending a potential appeal -- of a legal battle that started in more than five years ago, when WhatsApp filed a laws",
        "id": 2617363,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/06/2136240/nso-group-must-pay-more-than-167-million-in-damages-to-whatsapp-for-spyware-campaign?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NSO Group Must Pay More Than $167 Million In Damages To WhatsApp For Spyware Campaign",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T02:06:31.450635+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T01:25:00+00:00",
        "description": "Rep. Kat Cammack (R-FL) introduced the App Store Freedom Act [PDF] on Tuesday, legislation that would compel \"large app store operators\" with over 100 million US users to permit third-party app stores and allow them to be set as defaults. The bill directly challenges Apple's walled garden approach and Google's Play Store dominance by requiring both companies to allow developers to use alternative payment systems, bypassing the platforms' commission structures. \n\nIt would also mandate equal access to development tools and interfaces without discrimination, while giving users the ability to remove pre-installed apps. Violations would trigger FTC enforcement with penalties up to $1 million per infraction. The legislation mirrors recent European Union regulations that have already forced Apple to permit third-party app stores and allow users to change default apps.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Bill",
        "id": 2616932,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/06/2252259/new-bill-would-force-apple-google-to-open-app-store-ecosystems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Bill Would Force Apple, Google To Open App Store Ecosystems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T01:02:30.058613+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T00:45:00+00:00",
        "description": "Amazon's Zoox said it has issued a software recall for 270 of its robotaxis after a crash in Las Vegas last month. CNBC reports: The recall surrounds a defect with the vehicle's automated driving system that could cause it to inaccurately predict the movement of another car, increasing \"the risk of a crash,\" according to a report submitted to the National Highway Traffic Safety Administration on May 1. Zoox submitted the recall after an April 8 incident in Las Vegas in which an unoccupied Zoox robotaxi collided with a passenger vehicle, the NHTSA report states. There were no injuries in the crash and only minor damage occurred to both vehicles.\n \n\"After analysis and rigorous testing, Zoox identified the root cause,\" the company said in a blog post. \"We issued a software update that was implemented across all Zoox vehicles. All Zoox vehicles on the road today, including our purpose-built robotaxi and test fleet, have the updated software.\" Zoox paused all driverless vehicle operations ",
        "id": 2616671,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/06/2141257/amazons-zoox-robotaxi-unit-issues-software-recall-after-recent-las-vegas-crash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon's Zoox Robotaxi Unit Issues Software Recall After Recent Las Vegas Crash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T01:02:30.174585+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T00:02:00+00:00",
        "description": "According to the Washington Post (paywalled), the Trump administration plans to eliminate the Energy Star program -- a long-standing EPA initiative that has saved Americans over $500 billion in energy costs since 1992. \"The organization states that the average American saves about $450 per year on energy bills by choosing appliances that have been Energy Star-certified,\" adds Engadget. From the report: The EPA hasn't said when this would go into effect and when consumers would stop seeing Energy Star certifications on home appliances. It's technically illegal for a presidential administration to end this program without Congress, but the same goes for many of Trump's pronouncements and executive orders. \"Eliminating the Energy Star program would directly contradict this administration's promise to reduce household energy costs,\" Paula Glover, president of the nonprofit coalition Alliance to Save Energy, told CNN. \"For just $32 million a year, Energy Star helps American families save o",
        "id": 2616672,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/06/2111247/trump-admin-plans-to-shut-down-the-energy-star-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Admin Plans To Shut Down the Energy Star Program",
        "vote": 0
    }
]