[
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-07T18:05:48.941197+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-07T17:00:04+00:00",
        "description": "Movie magic doesn’t end when the credits roll—and no one knows that better than Angela Vesagas, Vice President of Creative Content at Focus Features. In this episode of Seen on the Screen, Jacqueline Coley talks with Angela about her path from selling tickets at Universal Studios Hollywood to crafting award-nominated campaigns for films like Downton Abbey and Nosferatu.\n\nAngela shares how her early passion for storytelling — from rewinding Moulin Rouge on DVD to cosplaying Scott Pilgrim characters — fueled a career defined by creativity, innovation, and a fan’s eye for what makes a movie unforgettable. Hear how she helped pioneer Focus's original digital series, why she believes storytelling around movies matters just as much as the stories themselves, and what it’s like to build a creative home for film lovers everywhere.\n\nFollow and listen to Seen on the Screen with Jacqueline Coley wherever you listen to podcasts 🎧\n \n· Apple Podcasts: https://podcasts.apple.com/us/podcast/seen-on-t",
        "id": 2623184,
        "language": null,
        "link": "https://www.youtube.com/watch?v=2Lx7FGcDMis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2Lx7FGcDMis/hqdefault.jpg",
        "title": "Behind the Scenes at Focus Features with Angela Vesagas | Seen on the Screen with Jacqueline Coley",
        "vote": 0
    }
]