[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-11T16:30:00+00:00",
        "description": "When considering the best racing games of the past several years, Forza and Gran Turismo come to mind. While both their latest titles continue receiving updates, the number of new entries is significantly lower, the newest Codemasters F1 notwithstanding.\n\nWith that in mind, early access has proven ideal for scouring the potential next big thing. Kunos Simulazioni is no stranger to the same with the Assetto Corsa series. Both were built on extensive feedback from players and went through their share of changes before fully launching on consoles and PC.\n\nIts latest and arguably most ambitious effort, Assetto Corsa EVO, is now available. After a rough launch where a good chunk of the content wasn't available thanks to the lack of online, early access players can finally experience Driving Academy, Special Events, and the Dealership. While it's still a long way from launch, the gameplay shows great potential.",
        "id": 2091659,
        "language": null,
        "link": "https://www.youtube.com/watch?v=0T6FVGrfMjw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0T6FVGrfMjw/hqdefault.jpg",
        "title": "Assetto Corsa EVO Early Access Review - Filled With Potential",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-11T13:30:07+00:00",
        "description": "Ah, Souls-likes. They seemed excessive enough when FromSoftware pumped out the Dark Souls trilogy and Bloodborne, but nowadays, it's almost impossible to escape the genre. This isn't necessarily bad, especially with so many noteworthy titles on the horizon. \n\nThere's Elden Ring: Nightreign, From's first foray into a co-op multiplayer-focused experience where players battle the Night Lord over multiple runs. The First Berserker: Khazan could take the anime Souls-like subgenre to new heights. Meanwhile, NEOWIZ's Lies of P will get a sequel in the coming years. New IPs like Daba: Land of Water Scar, Ballad of Antara, and Wuchang: Fallen Feathers also look promising.\n\nOf course, there are the relative unknowns like Project M, Mistfall Hunter, Witches of the New World, The Relic: First Guardian, and more. Check out all the new Souls-like titles to look forward to in 2025 and beyond.",
        "id": 2089906,
        "language": null,
        "link": "https://www.youtube.com/watch?v=76LPRWOhyOE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/76LPRWOhyOE/hqdefault.jpg",
        "title": "15 NEW Soulslike Games of 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-11T09:30:10+00:00",
        "description": "While live service has been a harsh lesson to these publishers (and many others – see Sony), it's not the be-all, end-all. Many of their issues are also centred around not knowing what kind of experience they want to deliver. Granted, they're at the whims of higher-ups – let's not forget all the twists and turns BioWare underwent before The Veilguard even came close to materializing. At the end of the day, making a single-player game isn't enough, and fans will see through any nonsense presented before them.\n\nIt's yet another reason why Kingdom Come: Deliverance 2 has succeeded. Despite its gameplay idiosyncrasies, it's all in the service of an epic role-playing experience where your decisions matter. Not everything is resolved perfectly due to technical issues or because that's how the story-telling plans out, but the experience feels real and significant – it matters, even if you're looking to have dumb fun. Perhaps that's something big-name publishers should focus on more over the",
        "id": 2088134,
        "language": null,
        "link": "https://www.youtube.com/watch?v=U3WffmJIncI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U3WffmJIncI/hqdefault.jpg",
        "title": "What Ubisoft And WB Games NEED TO LEARN From Kingdom Come: Deliverance 2",
        "vote": 0
    }
]