[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T14:50:56.825737+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T14:00:55+00:00",
        "description": "The release of Star Wars Battlefront II was marred by controversy. EA’s decision to prioritize predatory loot box practices prompted international governments to better scrutinize the video games industry as a whole, as loot boxes – for which items vital for upgrading may or may not be inside – were deemed a form of gambling. \n\nHiding the game’s cast of iconic heroes behind paywalls or ultra-long hours of grind was another progression decision deemed unjustifiable for Battlefront II’s burgeoning player base. Thankfully, EA listened to fans. They removed the pay to win tactics and kept microtransactions to cosmetic items only. \n\nIt took a while to get there, but Star Wars Battlefront II was eventually fixed, becoming the most satisfying of online mass-arena based shooters too.",
        "id": 2596155,
        "language": null,
        "link": "https://www.youtube.com/watch?v=eWy463ZBIg0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eWy463ZBIg0/hqdefault.jpg",
        "title": "EIGHT YEARS Later, Is Star Wars Battlefront 2 Fixed?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T10:30:56.985564+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T10:00:34+00:00",
        "description": "Blades of Fire is an action-adventure in the mould of FromSoftware. This isn’t just another Soulslike to add to the growing pile though, as there are points of differentiation elevating Blades of Fire from mere copycat. \n\nThis video will discuss two of the game’s principal features: the relatively novel mechanic of forging your own weaponry from myriad of different materials, customizations, and options, and the unique combat system which governs weapon usefulness whilst encouraging specific body part targeting. \n\nWill Blades of Fire end the year as one of its biggest games? It’s a tall order, however there is enough promise here to ensure the game at least finds a dedicated audience.",
        "id": 2594877,
        "language": null,
        "link": "https://www.youtube.com/watch?v=JYxEZTnKjB4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JYxEZTnKjB4/hqdefault.jpg",
        "title": "Why Blades of Fire Could Be One of The BIGGEST GAMES OF THE YEAR",
        "vote": 0
    }
]