[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T22:44:21.462785+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T22:44:21+00:00",
        "description": "A Dartmouth College associate professor of Japanese literature and culture became a narrative consultant for Ubisoft's game Assassin's Creed Shadow (which launched in March). Sachi Schmidt-Hori's job \"involved researching historical customs and reviewing scripts, not creating characters,\" writes the Associated Press. \n\nBut when a trailer was released in May of 2024, some reacted to a game character named Yasuke who was a Black African samurai, according to the article, \"with gamers criticizing his inclusion as 'wokeness' run amok\". And they directed the blame at Schmidt-Hori:\n\nGamers quickly zeroed in Schmidt-Hori, attacking her in online forums, posting bogus reviews of her scholarly work and flooding her inbox with profanity. Many drew attention to her academic research into gender and sexuality. Some tracked down her husband's name and ridiculed him, too. [One Reddit user described Schmidt-Hori as a \"sexual degenerate who hate humanity because no man want her,\" while another called",
        "id": 2598613,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/04/2134209/harassed-by-assasins-creed-gamers-a-professor-fought-back-with-kindness?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Harassed by Assasin's Creed Gamers, A Professor Fought Back With Kindness'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T21:39:13.380586+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T21:39:13+00:00",
        "description": "\"When Disneyland turns 70 this July, Main Street's Opera House will play host to the return of Walt Disney, who will sit down with audiences to tell his story in robot form,\" writes Gizmodo. \n\nBut they point out Walt's granddaughter Johanna Miller wrote a Facebook post opposing the idea in November. (\"They are Dehumanizing him. People are not replaceable...\")\n\nThe idea of a Robotic Grampa to give the public a feeling of who the living man was just makes no sense. It would be an imposter... You could never get the casual ness of his talking interacting with the camera his excitement to show and tell people about what is new at the park. \n\nYou can not add life to one. Empty of a soul or essence of the man. Knowing that he did not want this. Having your predecessors tell you that this was out of bounds.... So so Sad and disappointed. \n\n\nThe Facebook post claims that the son of a Disney engineer even remembers Walt saying that he never wanted to be an animatronic himself. And \"Members of ",
        "id": 2598313,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/04/2040204/disneyland-imagineers-defend-new-show-recreating-walt-disney-as-a-robot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Disneyland Imagineers Defend New Show  Recreating Walt Disney as a Robot",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T20:33:19.993714+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T20:33:19+00:00",
        "description": "With its Start menu-style application launcher and its bottom-of-the-screen taskbar, KDE Plasma is a \"nice\" and \"traditional\" desktop environment that's \"also highly customizable,\" notes It's FOSS News. \n\nBut there's a change coming...\n\n\nIn contrast to other desktop environments, KDE offers a long-term support release (LTS) of Plasma, where bug fixes and security updates are provided for an extended period, with no new major changes being introduced. However, that is no longer the case now. Shared by Nate Graham, a prominent contributor within the KDE community, KDE has decided to stop working on LTS releases of Plasma, shifting its focus on extending support for the bug-fix and feature releases instead. \nThe reasoning behind this move is multi-faceted, with factors such as inconsistent expectations from the community, developers' reluctance to work on older versions, and the lack of consistency in LTS support for Frameworks and Gear apps... I believe this move will provide Plasma use",
        "id": 2597987,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/04/1911207/kde-plasma-lts-releases-are-dead?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'KDE Plasma LTS Releases Are Dead'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T18:24:29.926162+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T18:24:29+00:00",
        "description": "\"Our future won't be handed to us,\" says the young narrator in a new ad from the nonprofit Code.org. \"We will build it.\" \n\n\"But how can we when the education we need is still just an elective?\" says another young voice... \n\nThe ad goes on to tout the power \"to create with computer science and AI &mdash; the skills transforming every industry...\" and ends by saying \"This isn't radical. It's what education is supposed to do. Make computer science and AI a graduation requirement.\" \n\nThere's also a hard-hitting new web site, which urges people to sign a letter of support (already signed by executives from top tech companies including Microsoft, Dropbox, AMD, Meta, Blue Origin, and Palantir &mdash; and by Steve Ballmer, who is listed as the chairman of the L.A. Clippers basketball team). \n\nLong-time Slashdot reader theodp says the letter ran in the New York Times, while this campaign will officially kick off Monday...\n\n\nCode.org teased the new Unlock8 campaign last month on social media as",
        "id": 2597376,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/04/1815242/tech-leaders-launch-campaign-to-make-cs-and-ai-a-graduation-requirement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tech Leaders Launch Campaign To Make CS and AI a Graduation Requirement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T17:19:25.972164+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T17:19:25+00:00",
        "description": "Thursday the Free Software Foundation announced plans for a celebratory hackathon in November to improve free/libre software \"in honor of its fortieth anniversary. \n\n\nThe FSF has been campaigning for software freedom for over forty years. As part of its celebrations, the organization is inviting the wider free software community (both projects and individual contributors) to participate in a global, online hackathon to help improve important libre software projects. \n\nAll free software projects, regardless of affiliation or (free) license, are invited to participate. As of now, the advanced GNU/Linux distribution and package manager GNU Guix, the boot software distribution GNU Boot, the media publishing system MediaGoblin, and the Free Software Directory, the FSF's catalog of useful free software, have announced that they will submit a project. Interested contributors are encouraged to review the hackathon guidelines, which the FSF has made available online... \n\nHackathon contribution",
        "id": 2596980,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/03/0620253/fsf-announces-free-software-hackathon-honoring-its-40th-anniversary?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FSF Announces Free Software Hackathon Honoring Its 40th Anniversary",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T16:14:30.794780+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T16:14:30+00:00",
        "description": "Dr. Paul Offit, an expert on infectious disease and immunology, told the Guardian that \"We're living in a post-herd-immunity world. I think the measles outbreak proves that. Measles &mdash; because it is the most contagious of the vaccine-preventable diseases, the most contagious human disease really &mdash; it is the first to come back.\"\n\n\n\nThree large outbreaks in Canada, Mexico and the US now account for the overwhelming majority of roughly 2,300 measles cases across the World Health Organization's six-country Americas region, according to the health authority's update this week. Risk of measles is considered high in the Americas, and has grown 11-fold compared with 2024. Only slightly behind, data released earlier this week from the European Centre for Disease Prevention and Control (ECDC) and WHO also noted that measles cases across Europe were up tenfold in 2024 compared to 2023. That data also indicated that the 2024 measles cases in Europe followed a seasonal pattern, which wa",
        "id": 2596653,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/04/0934243/we-may-be-in-a-post-herd-immunity-world-says-immunology-expert?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "We May Be In a 'Post-Herd Immunity World', says Immunology Expert",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T15:08:38.650465+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T15:08:38+00:00",
        "description": "Slashdot reader Mirnotoriety shared this report from the Register:\n\nA proof-of-concept program has been released to demonstrate a so-called monitoring \"blind spot\" in how some Linux antivirus and other endpoint protection tools use the kernel's io_uring interface. \n\nThat interface allows applications to make IO requests without using traditional system calls [to enhance performance by enabling asynchronous I/O operations between user space and the Linux kernel through shared ring buffers]. That's a problem for security tools that rely on syscall monitoring to detect threats... [which] may miss changes that are instead going through the io_uring queues. \n\n\nTo demonstrate this, security shop ARMO built a proof-of-concept named Curing that lives entirely through io_uring. Because it avoids system calls, the program apparently went undetected by tools including Falco, Tetragon, and Microsoft Defender in their default configurations. ARMO claimed this is a \"major blind spot\" in the Linux s",
        "id": 2596275,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/05/04/0455245/security-researchers-create-proof-of-concept-program-that-evades-linux-syscall-watching-antivirus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Security Researchers Create Proof-of-Concept Program that Evades Linux Syscall-Watching Antivirus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T11:52:26.217076+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T11:52:26+00:00",
        "description": "An anonymous reader shared this report from The Verge:\n\n\nFirefox could be put out of business should a court implement all the [U.S.] Justice Department's proposals to restrict Google's search monopoly, an executive for the browser owner Mozilla testified Friday. \"It's very frightening,\" Mozilla CFO Eric Muhlheim said. \n\n\nThe Department of Justice wants to bar Google from paying to be the default search engine in third-party browsers including Firefox, among a long list of other proposals including a forced sale of Google's own Chrome browser and requiring it to syndicate search results to rivals. The court has already ruled that Google has an illegal monopoly in search, partly thanks to exclusionary deals that make it the default engine on browsers and phones, depriving rivals of places to distribute their search engines and scale up. But while Firefox &mdash; whose CFO is testifying as Google presents its defense &mdash; competes directly with Chrome, it warns that losing the lucrat",
        "id": 2595300,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/04/0754238/firefox-could-be-doomed-without-google-search-deal-executive-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefox Could Be Doomed Without Google Search Deal, Executive Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T08:37:25.024713+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T08:37:24+00:00",
        "description": "\"It is the fastest, most efficient transistor ever,\" proclaims an announcment from Peking University. \"And most important of all, there's no trace of silicon involved,\" adds ZME Science.\nFrom the South China Morning Post:\nA team of researchers at Peking University claims to have shattered chip performance limits and proven that China can use new materials to \"change lanes\" in the semiconductor race by circumventing silicon-based roadblocks entirely. \nThe researchers, led by physical chemistry professor Peng Hailin, said their self-engineered 2D transistor could operate 40 per cent faster than Intel and TSMC's cutting-edge 3-nanometre silicon chips, while consuming 10 per cent less energy.... \"While this path is born out of necessity due to current sanctions, it also forces researchers to find solutions from fresh perspectives,\" [Hailin] added. \n\n\"Peking's major innovation comes from the two-dimensional nature of their transistors, facilitated by using an element other than silicon,\" w",
        "id": 2594495,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/04/036210/did-peking-u-just-make-the-worlds-fastest-transistor---without-using-silicon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Did Peking U. Just Make the World's Fastest Transistor - Without Using Silicon?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T05:22:21.164613+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T05:22:21+00:00",
        "description": "In 2016, an online \"swarm intelligence\" platform stunned horse-racing fans by making a correct prediction for the Kentucky Derby &mdash; naming all four top finishers in order. (But the next year its predictions weren't even close, with TechRepublic suggesting 2016's race just had an unusual cluster of obvious picks.) \n\nSince then it's become almost a tradition &mdash; asking AI to predict the winning horses each year, then see how close it came. So before today's race, a horse named \"Journalism\" was given the best odds of winning by professional bookmakers &mdash; but could AI make a better prediction? USA Today reports:\n\nThe USA TODAY Network asked Microsoft Copilot AI to simulate the order of finish for the 2025 Kentucky Derby field based on the latest, odds, predictions and race factors on Thursday, May 1. Journalism came out on top in its projection. The AI-generated response cited Journalism's favorable post position (No. 8), which has produced the second-most Kentucky Derby win",
        "id": 2593907,
        "language": null,
        "link": "https://slashdot.org/story/25/05/04/0341234/how-badly-did-chatgpt-and-copilot-fail-to-predict-the-winners-of-the-kentucky-derby?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Badly Did ChatGPT and Copilot Fail to Predict the Winners of the Kentucky Derby?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-04T02:07:18.887072+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-04T02:07:18+00:00",
        "description": "There's 9,000 satellites circling the earth, the Guardian points out, with projections over over 60,000 by 2040. \nBut \"A new study shows that the emissions from expired satellites, as they fall to Earth and burn up, will be significant in future years, with implications for ozone hole recovery and climate.\"\nMost old satellites are disposed of by reducing their altitude and letting them burn up as they fall, releasing pollution into Earth's atmosphere such as aerosolised aluminium. To understand the impact of these growing emissions from expired satellites, researchers simulated the effects associated with an annual release of 10,000 tonnes of aluminium oxide by 2040 (the amount estimated to be released from disposal of 3,000 satellites a year, assuming a fleet of 60,000 satellites). \n\nThe results, which are published in Journal of Geophysical Research Atmospheres, show that the re-entry material will accumulate at high latitudes and could result in temperature anomalies of up to 1.5C ",
        "id": 2593432,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/03/1934218/dying-satellites-can-drive-climate-change-and-ozone-depletion-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dying Satellites Can Drive Climate Change and Ozone Depletion, Study Finds",
        "vote": 0
    }
]