[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T23:49:53.767476+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T23:49:53+00:00",
        "description": "Alamo Drafthouse will not implement Meta's new Movie Mate technology during the April 30 nationwide rerelease of Blumhouse's \"M3GAN,\" Variety reports. The specialty theater chain confirmed it will maintain its strict no-phones policy despite Universal's promotion of the second-screen experience, with staff instructed to remove patrons attempting to access the feature during screenings. \n\nMovie Mate represents Meta's first integration of its interactive movie technology, which operates via Instagram direct messaging. Users message the film's official account to activate a chatbot delivering \"sneak peeks, exclusive recorded messages from directors and talent\" synchronized with the screening. The \"M3GAN\" event serves as Meta's technological debut ahead of potential wider theatrical implementation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Alamo+Drafthouse+Rejects+Meta's+Second-Screen+Technology%3A+https%3A%2F%2Fte",
        "id": 2566472,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/15/2022238/alamo-drafthouse-rejects-metas-second-screen-technology?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alamo Drafthouse Rejects Meta's Second-Screen Technology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T23:49:53.660853+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T23:49:53+00:00",
        "description": "An anonymous reader quotes a report from SecurityWeek: Insurance firm Lemonade is notifying roughly 190,000 individuals that their driver's license numbers were likely exposed due to a technical glitch. Copies of the notification letter that were submitted to regulators in several states show that the incident involved an online application that enables individuals to obtain car insurance quotes and purchase policies. According to the company, a vulnerability in the car insurance quote flow resulted in the exposure of certain driver's license numbers for identifiable individuals. The vulnerability has been addressed, Lemonade says.\n \nBetween April 2023 and September 2024, the platform transmitted the information unencrypted, which the company says allowed driver's license numbers to be accessed without authorization. \"We have no evidence to suggest that your driver's license number has been misused but we are providing this notice as a precaution to inform potentially affected individ",
        "id": 2566471,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/15/2025249/insurance-firm-lemonade-says-api-glitch-exposed-some-drivers-license-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Insurance Firm Lemonade Says API Glitch Exposed Some Driver's License Numbers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T22:45:21.729669+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T22:45:21+00:00",
        "description": "China's outing of alleged US National Security Agency hackers marks a major escalation in the ongoing tit-for-tat between Chinese and American intelligence agencies, according to analysts. From a report: Chinese authorities Tuesday said three NSA employees hacked the Asian Winter Games held this year in Harbin, accusing them of targeting systems that held vast amounts of personal information on people involved in the event. The hacks \"severely endangered the security of China's critical information infrastructure, national defense, finance, society, production, as well as citizens' personal information,\" Chinese foreign ministry spokesman Lin Jian told reporters. \n\nWhile the US has repeatedly published names of alleged Chinese hackers and filed criminal charges against them, China has historically refrained from making similar accusations against American spies. Rafe Pilling, director of threat intelligence at the cyber firm Sophos' Secureworks unit, said the development may signal a ",
        "id": 2566137,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/15/2012216/china-outs-us-hackers-for-attack-a-new-frontier-in-spy-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Outs US Hackers for Attack, a New Frontier in Spy Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T21:40:58.773712+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T21:40:58+00:00",
        "description": "A Canadian math prodigy is accused of stealing over $65 million through complex exploits on decentralized finance platforms and is currently a fugitive from U.S. authorities. Despite facing criminal charges for fraud and money laundering, he has evaded capture by moving internationally, embracing the controversial \"Code is Law\" philosophy, and maintaining that his actions were legal under the platforms' open-source rules. The Globe and Mail reports: Andean Medjedovic was 18 years old when he made a decision that would irrevocably alter the course of his life. In the fall of 2021, shortly after completing a master's degree at the University of Waterloo, the math prodigy and cryptocurrency trader from Hamilton had conducted a complex series of transactions designed to exploit a vulnerability in the code of a decentralized finance platform. The maneuver had allegedly allowed him to siphon approximately $16.5-million in digital tokens out of two liquidity pools operated by the platform, I",
        "id": 2565779,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/15/2017230/canadian-math-prodigy-allegedly-stole-65-million-in-crypto?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Canadian Math Prodigy Allegedly Stole $65 Million In Crypto",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T20:35:07.035412+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T20:35:06+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Figma has sent a cease-and-desist letter to popular no-code AI startup Lovable, Figma confirmed to TechCrunch. The letter tells Lovable to stop using the term \"Dev Mode\" for a new product feature. Figma, which also has a feature called Dev Mode, successfully trademarked that term last year, according to the U.S. Patent and Trademark office. What's wild is that \"dev mode\" is a common term used in many products that cater to software programmers. It's like an edit mode. Software products from giant companies like Apple's iOS, Google's Chrome, Microsoft's Xbox have features formally called \"developer mode\" that then get nicknamed \"dev mode\" in reference materials.\n \nEven \"dev mode\" itself is commonly used. For instance Atlassian used it in products that pre-date Figma's copyright by years. And it's a common feature name in countless open source software projects. Figma tells TechCrunch that its trademark refers only to the shortcut \"De",
        "id": 2565280,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/15/203233/figma-sent-a-cease-and-desist-letter-to-lovable-over-the-term-dev-mode?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Figma Sent a Cease-and-Desist Letter To Lovable Over the Term 'Dev Mode'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T20:35:07.143692+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T20:35:06+00:00",
        "description": "Uber cofounder Travis Kalanick thinks AI is about to shake up consulting -- and for \"traditional\" professionals, not in a good way. From a report: The former Uber CEO said consultants who mostly follow instructions or do repetitive tasks are at risk of being replaced by AI. \"If you're a traditional consultant and you're just doing the thing, you're executing the thing, you're probably in some big trouble,\" he said. He joked about what that future of consultancy might look like: \"Push a button. Get a consultant.\" \n\nHowever, Kalanick said the professionals who would come out ahead would be the ones who build tools rather than just use them. \"If you are the consultant that puts the things together that replaces the consultant, maybe you got some stuff,\" he said. \"You're going to profitable companies with competitive moats, making that moat bigger,\" he explained. \"Making their profit bigger is probably pretty interesting from a financial point of view.\"<p><div class=\"share_submission\" sty",
        "id": 2565281,
        "language": null,
        "link": "https://slashdot.org/story/25/04/15/1918257/uber-cofounder-kalanick-says-ai-means-some-consultants-are-in-big-trouble?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Uber Cofounder Kalanick Says AI Means Some Consultants Are in 'Big Trouble'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T19:30:12.607903+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T19:30:12+00:00",
        "description": "An anonymous reader shares a report: None of the frontier AI research labs have presented any evidence that they are on the brink of achieving artificial general intelligence, no matter how they define that goal, but Google is already planning for a \"Post-AGI\" world by hiring a scientist for its DeepMind AI lab to research the \"profound impact\" that technology will have on society. \n\n\"Spearhead research projects exploring the influence of AGI on domains such as economics, law, health/wellbeing, AGI to ASI [artificial superintelligence], machine consciousness, and education,\" Google says in the first item on a list of key responsibilities for the job. Artificial superintelligence refers to a hypothetical form of AI that is smarter than the smartest human in all domains. This is self explanatory, but just to be clear, when Google refers to \"machine consciousness\" it's referring to the science fiction idea of a sentient machine. \n\nOpenAI CEO Sam Altman, DeepMind CEO Demis Hassabis, Elon ",
        "id": 2564542,
        "language": null,
        "link": "https://slashdot.org/story/25/04/15/182244/google-deepmind-is-hiring-a-post-agi-research-scientist?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google DeepMind Is Hiring a 'Post-AGI' Research Scientist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T19:30:12.947118+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T19:30:12+00:00",
        "description": "An anonymous reader shares a report: OpenAI is working on its own X-like social network, according to multiple sources familiar with the matter. While the project is still in early stages, we're told there's an internal prototype focused on ChatGPT's image generation that has a social feed. CEO Sam Altman has been privately asking outsiders for feedback about the project, our sources say. It's unclear if OpenAI's plan is to release the social network as a separate app or integrate it into ChatGPT, which became the most downloaded app globally last month. \n\nLaunching a social network in or around ChatGPT would likely increase Altman's already-bitter rivalry with Elon Musk. In February, after Musk made an unsolicited offer to purchase OpenAI for $97.4 billion, Altman responded: \"no thank you but we will buy twitter for $9.74 billion if you want.\" Entering the social media market also puts OpenAI on more of a collision course with Meta, which we're told is planning to add a social feed t",
        "id": 2564543,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/15/1648226/openai-is-building-a-social-network?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI is Building a Social Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T19:30:12.506780+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T19:30:12+00:00",
        "description": "You should still learn to code, says GitHub's CEO. And you should start as soon as possible. From a report: \"I strongly believe that every kid, every child, should learn coding,\" Thomas Dohmke said in a recent podcast interview with EO. \"We should actually teach them coding in school, in the same way that we teach them physics and geography and literacy and math and what-not.\" Coding, he added, is one such fundamental skill -- and the only reason it's not part of the curriculum is because it took \"us too long to actually realize that.\" \n\nDohmke, who's been a programmer since the 90s, said he's never seen \"anything more exciting\" than the current moment in engineering -- the advent of AI, he believes, has made the field that much easier to break into, and is poised to make software more ubiquitous than ever. \"It's so much easier to get into software development. You can just write a prompt into Copilot or ChatGPT or similar tools, and it will likely write you a basic webpage, or a smal",
        "id": 2564541,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/15/1853254/you-should-still-learn-to-code-says-github-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "You Should Still Learn To Code, Says GitHub CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T16:57:36.466201+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T16:57:36+00:00",
        "description": "An anonymous reader shares a report: A silent update rolling out to virtually all Android devices will make your phone more secure, and all you have to do is not touch it for a few days. The new feature implements auto-restart of a locked device, which will keep your personal data more secure. It's coming as part of a Google Play Services update, though, so there's nothing you can do to speed along the process. \n\nGoogle is preparing to release a new update to Play Services (v25.14), which brings a raft of tweaks and improvements to myriad system features. First spotted by 9to5Google, the update was officially released on April 14, but as with all Play Services updates, it could take a week or more to reach all devices. When 25.14 arrives, Android devices will see a few minor improvements, including prettier settings screens, improved connection with cars and watches, and content previews when using Quick Share.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slas",
        "id": 2563404,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/15/1636208/android-phones-will-soon-reboot-themselves-after-sitting-unused-for-3-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Android Phones Will Soon Reboot Themselves After Sitting Unused For 3 Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T16:57:37.589938+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T16:57:36+00:00",
        "description": "Meta CEO Mark Zuckerberg considered resetting all Facebook users' friend connections to boost the platform's declining relevance, according to internal emails revealed Monday in a landmark FTC antitrust trial. In a 2022 message to executives, Zuckerberg proposed \"wiping everyone's graphs and having them start again,\" referring to users' friend networks. Facebook head Tom Alison questioned the idea's viability, citing Instagram's reliance on friend connections. Zuckerberg later testified that the plan was never implemented and that Facebook has \"evolved\" from its original purpose. \n\nThe FTC argues Meta violated competition laws by acquiring Instagram ($1B) and WhatsApp ($19B) as part of a \"buy or bury\" strategy outlined in Zuckerberg's 2008 email stating, \"It is better to buy than compete.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zuckerberg+Had+a+'Crazy+Idea'+in+2022+For+Facebook+-+Purge+All+Users'+Friends%3A+",
        "id": 2563406,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/15/1536244/zuckerberg-had-a-crazy-idea-in-2022-for-facebook---purge-all-users-friends?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Zuckerberg Had a 'Crazy Idea' in 2022 For Facebook - Purge All Users' Friends",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:50:18.545422+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T15:50:17+00:00",
        "description": "Longtime Slashdot reader AmiMoJo shares the news that China has halted all rare earth exports globally -- including to the U.S., Japan, and Germany. Fortune reports: After Trump unveiled his \"Liberation Day\" tariffs on April 2, China retaliated on April 4 with its own duties as well as export controls on several rare earth minerals and magnets made from them. So far, those export controls have translated to a halt across the board, cutting off the U.S. and other countries, according to the New York Times. That's because any exports of the minerals and magnets now require special licenses, but Beijing has yet to fully establish a system for issuing them, the report said.\n \nIn the meantime, shipments of rare earths have been halted at many ports, with customs officials blocking exports to any country, including to the U.S. as well as Japan and Germany, sources told the&#194;Times. China's Ministry of Commerce issued export restrictions alongside the General Administration of Customs, pr",
        "id": 2562139,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/15/0144259/china-halts-rare-earth-exports-globally?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Halts Rare Earth Exports Globally",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:50:18.658872+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T15:50:17+00:00",
        "description": "A new study projects that CT scans conducted in 2023 may result in around 103,000 future cancer cases in the U.S. due to low-dose ionizing radiation. \"[I]t would put CT scans on par with other significant risk factors for cancer, like alcohol consumption, at least at a population level,\" reports ScienceAlert. From the report: At an individual level, the theoretical chance of developing cancer from a CT scan is thought to be very minimal, if it exists at all, and patients should not be scared of undergoing these tests if they are deemed medically necessary. However, the number of CT examinations performed each year in the US has increased by more than 30 percent since 2007, and researchers suggest that unwarranted tests are exposing the population to unnecessary radiation. [...]\n \nThe anonymous data comes from 143 hospitals and outpatient facilities across the US, catalogued in the UCSF International CT Dose Registry. Using statistics from 2016 to 2022, researchers predicted 93 million",
        "id": 2562140,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/14/2333207/ct-scans-projected-to-result-in-100000-new-cancers-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CT Scans Projected to Result in 100,000 New Cancers in The US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:50:18.111492+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T15:50:17+00:00",
        "description": "FCC Chairman Brendan Carr has issued a stark ultimatum to European allies, telling them to choose between US and Chinese communications technology. In an interview with Financial Times, Carr urged \"allied western democracies\" to \"focus on the real long-term bogey: the rise of the Chinese Communist party.\" The warning comes as European governments question Starlink's reliability after Washington threatened to switch off its services in Ukraine. \n\nUK telecoms BT and Virgin Media O2 are currently trialing Starlink's satellite internet technology but haven't signed full agreements. \"If you're concerned about Starlink, just wait for the CCP's version, then you'll be really worried,\" said Carr. Carr claimed Europe is \"caught\" between Washington and Beijing, with a \"great divide\" emerging between \"CCP-aligned countries and others\" in AI and satellite technology. He also accused the European Commission of \"protectionism\" and an \"anti-American\" attitude while suggesting Nokia and Ericsson shou",
        "id": 2562136,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/15/1514205/fcc-chairman-tells-europe-to-choose-between-us-or-chinese-communications-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FCC Chairman Tells Europe To Choose Between US or Chinese Communications Tech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:50:18.409579+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T15:50:17+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Car rental giant Hertz has begun notifying its customers of a data breach that included their personal information and driver's licenses. The rental company, which also owns the Dollar and Thrifty brands, said in notices on its website that the breach relates to a cyberattack on one of its vendors between October 2024 and December 2024. The stolen data varies by region, but largely includes Hertz customer names, dates of birth, contact information, driver's licenses, payment card information, and workers' compensation claims. Hertz said a smaller number of customers had their Social Security numbers taken in the breach, along with other government-issued identification numbers. Notices on Hertz's websites disclosed the breach to customers in Australia, Canada, the European Union, New Zealand, and the United Kingdom. Hertz also disclosed the breach with several U.S. states, including California and Maine. Hertz said at least 3,400 cu",
        "id": 2562138,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/15/0128202/hertz-says-customers-personal-data-drivers-licenses-stolen-in-data-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hertz Says Customers' Personal Data, Driver's Licenses Stolen In Data Breach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:50:18.269864+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T15:50:17+00:00",
        "description": "Publishers and law professors have filed amicus briefs supporting authors who sued Meta over its AI training practices, arguing that the company's use of \"thousands of pirated books\" fails to qualify as fair use under copyright law. \n\nThe filings [PDF] in California's Northern District federal court came from copyright law professors, the International Association of Scientific, Technical and Medical Publishers (STM), Copyright Alliance, and Association of American Publishers. The briefs counter earlier support for Meta from the Electronic Frontier Foundation and IP professors. \n\nWhile Meta's defenders pointed to the 2015 Google Books ruling as precedent, the copyright professors distinguished Meta's use, arguing Google Books told users something \"about\" books without \"exploiting expressive elements,\" whereas AI models leverage the books' creative content. \n\n\"Meta's use wasn't transformative because, like the AI models, the plaintiffs' works also increased 'knowledge and skill,'\" the ",
        "id": 2562137,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/15/0519205/publishers-and-law-professors-back-authors-in-meta-ai-copyright-battle?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Publishers and Law Professors Back Authors in Meta AI Copyright Battle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T05:22:13.067375+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T05:22:12+00:00",
        "description": "An anonymous reader shares a report: Generative AI offers remarkable efficiency gains while presenting a profound challenge for the global IT services industry -- a sector concentrated in India and central to its export economy. \n\nFor decades, Indian technology firms thrived by deploying their engineering talent to serve primarily Western clients. Now they face a critical question. Will AI's productivity dividend translate into revenue growth? Or will fierce competition see these gains competed away through price reductions? \n\nIndustry soundings suggest the deflationary dynamic may already be taking hold. JPMorgan's conversations with executives, deal advisors and consultants across India's technology hubs reveal growing concern -- AI-driven efficiencies are fuelling pricing pressures. This threatens to constrain medium-term industry growth to a modest 4-5%, with little prospect of acceleration into fiscal year 2026. This emerging reality challenges the earlier narrative that AI would",
        "id": 2559947,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/15/0259250/indian-it-faces-its-kodak-moment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Indian IT Faces Its Kodak Moment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T04:16:13.866718+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T04:16:13+00:00",
        "description": "An anonymous reader quotes a report from Forbes: Robotaxi development is speeding at a fast pace in China, but we don't hear much about it in the USA, where the news focuses mostly on Waymo, with a bit about Zoox, Motional, May, trucking projects and other domestic players. China has 4 main players with robotaxi service, dominated by Baidu (the Chinese Google.) A recent session at last week's Ride AI conference in Los Angeles revealed some details about the different regulatory regime in China, and featured a report from a Chinese-American YouTuber who has taken on a mission to ride in the different vehicles.\n \nZion Maffeo, deputy general counsel for Pony.AI, provided some details on regulations in China. While Pony began with U.S. operations, its public operations are entirely in China, and it does only testing in the USA. Famously it was one of the few companies to get a California \"no safety driver\" test permit, but then lost it after a crash, and later regained it. Chinese authori",
        "id": 2559663,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/14/2327229/chinese-robotaxis-have-government-black-boxes-approach-us-quality?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chinese Robotaxis Have Government Black Boxes, Approach US Quality",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T02:05:35.342226+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T02:05:35+00:00",
        "description": "The climate crisis has tripled the length of ocean heatwaves, a study has found, supercharging deadly storms and destroying critical ecosystems such as kelp forests and coral reefs. From a report: Half of the marine heatwaves since 2000 would not have happened without global heating, which is caused by burning fossil fuels. The heatwaves have not only become more frequent but also more intense: 1C warmer on average, but much hotter in some places, the scientists said. \n\nThe research is the first comprehensive assessment of the impact of the climate crisis on heatwaves in the world's oceans, and it reveals profound changes. Hotter oceans also soak up fewer of the carbon dioxide emissions that are driving temperatures up. \"Here in the Mediterranean, we have some marine heatwaves that are 5C hotter,\" said Dr Marta Marcos at the Mediterranean Institute for Advanced Studies in Mallorca, Spain, who led the study. \"It's horrible when you go swimming. It looks like soup.\" \n\nAs well as devasta",
        "id": 2559272,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/15/0148201/climate-crisis-has-tripled-length-of-deadly-ocean-heatwaves-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Climate Crisis Has Tripled Length of Deadly Ocean Heatwaves, Study Finds",
        "vote": 0
    }
]