[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:44:48.384663+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T14:00:29+00:00",
        "description": "It may not enjoy the sort of widespread acclaim and rapturous commercial success that the likes of Horizon, The Last of Us, and Marvel’s Spider-Man have seen over recent years, but Days Gone does have its fair share of fans. \n\nSony Bend’s open world post-apocalyptic title is getting a remastered release on PS5 soon that, for reasons that aren’t entirely unfair, has attracted plenty of skepticism from audiences.\n\n And yet, the upcoming Days Gone Remastered does seem to have its own appeal, for one reason or another. It’s enough of a technical and visual upgrade to catch attention, while it’s also adding a handful of intriguing new modes, and doing all if it for a refreshingly reasonable price. \n\nFor newcomers or those who wish to give the game another go, it seems like a solid deal.",
        "id": 2561436,
        "language": null,
        "link": "https://www.youtube.com/watch?v=NKihI0Wvrnk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NKihI0Wvrnk/hqdefault.jpg",
        "title": "Days Gone Remastered PS5 - A MUST PLAY For Newcomers?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-15T15:44:48.504560+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-15T10:00:36+00:00",
        "description": "Bungie has been synonymous with many legendary franchises over the decades, and Marathon is arguably its most formative. To some extent, it inspired Halo, which itself went on to influence Destiny. With the announcement of a new entry in the franchise, you would think things had come full circle, even if it's a live-service extraction shooter.\n\nSnazzy cinematic short aside, however, Marathon's gameplay formula is less intriguing than the overall scenario that Bungie finds itself in. Launching a premium multiplayer title, even if it isn't full-priced, is a huge risk in today's market. The Bungie Way is even more so, charging players to join them on the journey to build this game into something special.\n\nIt's a familiar ride for Destiny players. Hype moments followed. It was also exhausting, especially when it seemingly took months, if not years, for changes. Leaving aside whether Marathon could suffer the same way, is it even worth hopping on in the first place?",
        "id": 2561437,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LYROOhECxgQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LYROOhECxgQ/hqdefault.jpg",
        "title": "We NEED To Talk About Marathon...",
        "vote": 0
    }
]