[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T16:30:15+00:00",
        "description": "Blade & Soul NEO is an Unreal Engine 4 remaster of a classic MMORPG by NCSoft. The game takes place in a wuxia-inspired world where just about every conflict is resolved via the use of martial arts. Things start going wrong, however, when your martial arts school is attacked by a horde of demons, and you’re essentially left for dead.\n\nUnfortunately, despite its interesting premise, Blade & Soul NEO ends up being an incredibly dull game. Its real-time action combat is surprisingly repetitive, and it takes too much time before you start seeing any real level of challenge from its main story quests. Since it’s a free-to-play game, Blade & Soul NEO also has some gratuitous levels of monetization in the form of microtransactions and battle pass.\n\nThis, coupled with the generally dull gameplay and story means that any grinding you do will also need you to get a secondary source of mental stimulation and entertainment.",
        "id": 2270612,
        "language": null,
        "link": "https://www.youtube.com/watch?v=iXNzyK9hkno",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iXNzyK9hkno/hqdefault.jpg",
        "title": "Blade And Soul NEO Review - Largely Underwhelming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T14:00:48+00:00",
        "description": "Rebellion Developments has been around for decades by this point, but Atomfall is arguably its most exciting project. Launching on March 27th for Xbox Series X/S, Xbox One, PS4, PS5, and PC, it sees the player waking up with no memories and exploring Northern England years after the Windscale fire.\n\nThings have inexplicably changed in the aftermath with a quarantine surrounding the region and an armed contingent known as Protocol keeping the peace. Outlaws and enemies roam the countryside while mutated Ferals lurk in the darker corners. That's not even getting into the mysterious B.A.R.D. bunkers and their secrets or the voice that lingers in the air.\n\nThe appeal of the post-nuclear setting aside, Atomfall's approach to story-telling and player freedom makes it a surprisingly compelling mystery, especially after we spent some hands-on time with it. Here are all the latest details you need to know before playing.",
        "id": 2268948,
        "language": null,
        "link": "https://www.youtube.com/watch?v=fpHfUO2vgCQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fpHfUO2vgCQ/hqdefault.jpg",
        "title": "Atomfall - 15 Things You Should Know BEFORE YOU BUY - NEW GAMEPLAY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T09:30:15+00:00",
        "description": "Assassin’s Creed is one of the biggest properties around in the games industry, so naturally, any time a new Assassin’s Creed game is about to come out, it’s going to generate plenty of excitement. But Assassin’s Creed Shadows has got us excited not simply because it’s a major new release, but because it is making promises that fans of the series in particular can’t help but be fascinated by. \n\nFrom a greater focus on stealth and parkour to a long-awaited feudal Japanese setting for an Assassin’s Creed game, there’s plenty that Shadows is doing that has turned our heads and then kept our gaze locked on the upcoming action RPG.",
        "id": 2267240,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bf3mVZ-kpg4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bf3mVZ-kpg4/hqdefault.jpg",
        "title": "5 BIG Reasons For Fans To Be Excited For Assassin’s Creed Shadows",
        "vote": 0
    }
]