[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T23:04:12+00:00",
        "description": "Broadcom's VMware acquisition has significantly boosted revenue, largely driven by high-priced VMware Cloud Foundation bundles adopted by the majority of its top customers. The Register reports: Broadcom's acquisition of VMware appears to be a big success, on the balance sheet at least, after the company announced a big majority of its top 10,000 customers have decided to acquire its Cloud Foundation stack and posted strong growth. The chips-and-code company today announced its results for the quarter ended February 2nd, its first for FY 2025. Revenue of $14.92 billion represented 25 percent year-on-year growth. Net income of $5.5 billion was a 315 percent increase on the result from Q1 2024.\n \nBroadcom no longer breaks out VMware revenue: sales of Virtzilla's wares are all now lumped into its infrastructure software business unit, which posted $6.7 billion revenue for Q1, up from $4.55 billion for the same quarter last year. Direct comparisons of those numbers are not wise as Broadc",
        "id": 2272815,
        "language": null,
        "link": "https://slashdot.org/story/25/03/07/229224/70-of-large-vmware-customers-bought-broadcoms-biggest-bundle?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "70% of Large VMware Customers Bought Broadcom's Biggest Bundle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T23:04:12+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Thursday, music labels sought to add nearly 500 more sound recordings to a lawsuit accusing the Internet Archive (IA) of mass copyright infringement through its Great 78 Project, which seeks to digitize all 3 million three-minute recordings published on 78 revolutions-per-minute (RPM) records from about 1898 to the 1950s. If the labels' proposed second amended complaint is accepted by the court, damages sought in the case -- which some already feared could financially ruin IA and shut it down for good -- could increase to almost $700 million. (Initially, the labels sought about $400 million in damages.) IA did not respond to Ars' request for comment, but the filing noted that IA has not consented to music labels' motion to amend their complaint. [...]\n \nSome sound recording archivists and historians also continue to defend the Great 78 Project as a critical digitization effort at a time when quality of physical 78 RPM records ",
        "id": 2272816,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/07/221238/music-labels-will-regret-coming-for-the-internet-archive-sound-historian-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Music Labels Will Regret Coming For the Internet Archive, Sound Historian Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T20:54:17+00:00",
        "description": "The spectacular collapse of fintech middleman Synapse has left $200 million in customer money frozen and up to $95 million missing, with no clear answers about where the funds went. After Synapse, a financial technology company connecting other fintechs to banks, filed for bankruptcy in April 2024, customers of apps like Yotta, Juno, and Copper found themselves locked out of their savings. \n\nFounded in 2014 by Sankaet Pathak, Synapse connected consumer-facing fintech platforms with banks holding customer deposits. The disaster unfolded after relationships with regional bank Evolve and unicorn client Mercury deteriorated, triggering a chain reaction through the financial infrastructure. Nearly a year later, Fortune reports that a Department of Justice criminal investigation is underway, while the bankruptcy's court-appointed trustee called the situation an \"awful, awful\" mess. The debacle, the outlet writes, exposes the risks lurking beneath popular financial apps operating in a regul",
        "id": 2272023,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/07/1825257/the-spectacular-synapse-collapse?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Spectacular Synapse Collapse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T20:54:17+00:00",
        "description": "Global telecom operators are struggling to shut down aging 2G networks despite pressure to free up spectrum for 4G and 5G services, as the transition threatens to exclude millions of vulnerable users. \n\nWhile Vietnam successfully decommissioned 2G in November 2024 by providing free 4G phones to low-income users, countries like South Africa and India have delayed shutdowns over concerns about cutting off phone access for millions. According to GSMA Intelligence, 61 countries have planned or initiated 2G network shutdowns to enhance bandwidth and reduce maintenance costs. For 2.5 billion people worldwide, smartphones cost about 30% of monthly income, keeping basic phones essential despite declining global feature phone sales.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Why+Most+Countries+Are+Struggling+To+Shut+Down+2G%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F07%2F1817251%2F%3Futm_source%3Dtwitter%26u",
        "id": 2272024,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/07/1817251/why-most-countries-are-struggling-to-shut-down-2g?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Most Countries Are Struggling To Shut Down 2G",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T19:48:56+00:00",
        "description": "Warner Bros. Home Entertainment has confirmed widespread issues affecting DVDs manufactured between 2006-2008 that are experiencing premature disc rot. The company is offering replacements for affected titles but no refunds, even when replacements aren't possible. \n\nThe problem manifests in various ways: complete disc failure, freezing midway through playback, or menu issues. Movie critic Chris Bumbray recently discovered several of his classic film DVDs had deteriorated, including titles not available digitally. DVD collectors have documented this issue for years via YouTube and forums, with speculation that a Pennsylvania manufacturing plant used subpar materials.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=WB+Offers+Replacements%2C+Not+Refunds%2C+for+Hundreds+of+Rotting+DVDs%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F03%2F07%2F1846204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"http",
        "id": 2271589,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/07/1846204/wb-offers-replacements-not-refunds-for-hundreds-of-rotting-dvds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WB Offers Replacements, Not Refunds, for Hundreds of Rotting DVDs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T18:43:45+00:00",
        "description": "Apple is postponing the rollout of its more personalized Siri features, originally promised as part of its Apple Intelligence initiative. \"It's going to take us longer than we thought to deliver on these features and we anticipate rolling them out in the coming year,\" Apple told DaringFireball. The future update seeks to give Siri greater awareness of personal context and the ability to perform actions across apps.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Delays+'More+Personalized+Siri'+Apple+Intelligence+Features%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F03%2F07%2F1833202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F03%2F07%2F1833202%2Fapple-delays-more-personalized-siri-apple-intelligence-features%3Futm_source%3Dslashd",
        "id": 2271119,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/03/07/1833202/apple-delays-more-personalized-siri-apple-intelligence-features?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Delays 'More Personalized Siri' Apple Intelligence Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T18:43:45+00:00",
        "description": "Europe's new tech rule aims to keep digital markets open and is not targeted at U.S. tech giants, EU antitrust and tech chiefs told U.S. congressmen, reminding them that U.S. enforcers have in recent years also cracked down on these companies. From a report: The comments by EU antitrust chief Teresa Ribera and EU tech chief Henna Virkkunnen came after U.S. House Judiciary Chair Jim Jordan and Scott Fitzgerald, chairman of the subcommittee on the administrative state, regulatory reform and antitrust demanded clarifications on the Digital Markets Act (DMA). \n\n\"The DMA does not target U.S. companies,\" Ribera and Virkkunnen wrote in a joint letter dated March 6 to Jordan and Fitzgerald seen by Reuters. \"It applies to all companies which fulfil the clearly defined criteria for being designated as a gatekeeper in the European Union irrespective of where they are headquartered,\" they said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.c",
        "id": 2271120,
        "language": null,
        "link": "https://slashdot.org/story/25/03/07/1755246/eu-denies-picking-on-us-tech-giants?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EU Denies Picking on US Tech Giants",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T17:38:40+00:00",
        "description": "PhD students trained in small research groups are more likely to remain in academia than those from larger labs, according to a comprehensive analysis published in Nature Human Behaviour. \n\nThe study, which examined 1.5 million scientists and 1.8 million mentorships across chemistry, physics and neuroscience, found that trainees from large research groups had 38-48% lower \"survival rates\" in academia between the 1980s and 1995 compared to their small-group counterparts. \n\nHowever, researchers from larger labs who do stay in academia tend to achieve greater career success, publishing papers with higher citation rates and more frequently ranking among the most-cited scientists. \n\nThe research team, led by social-data scientist Roberta Sinatra from the University of Copenhagen, discovered that successful large-group scientists typically published more first-author papers with their mentors as last authors, suggesting they received substantial attention despite the group size.<p><div cla",
        "id": 2270571,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/07/1717212/study-reveals-lab-size-impacts-phd-students-academic-careers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Study Reveals Lab Size Impacts PhD Students' Academic Careers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T17:38:40+00:00",
        "description": "The White House is weighing measures to restrict Chinese artificial-intelligence upstart DeepSeek, including banning its chatbot from government devices because of national-security concerns, WSJ reported Friday, citing people familiar with the matter. From the report: U.S. officials are worried about DeepSeek's handling of user data, which the Chinese company says it stores in servers located in China, the people said. Officials also believe DeepSeek hasn't sufficiently explained how it uses the data it collects and who has access to the data, they said. \n\nThe Trump administration is likely to adopt a rule that would bar people from downloading DeepSeek's chatbot app onto U.S. government devices, the people said. Officials are also considering two other possible moves: banning the DeepSeek app from U.S. app stores and putting limits on how U.S.-based cloud service providers could offer DeepSeek's AI models to their customers, people close to the matter said. They cautioned that disc",
        "id": 2270572,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/07/1616237/us-likely-to-ban-chinese-app-deepseek-from-government-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Likely To Ban Chinese App DeepSeek From Government Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T16:33:33+00:00",
        "description": "An anonymous reader shares a report: A physicist has cast doubt on a test that underlies a high-profile claim by Microsoft to have created the first 'topological qubits', a long-sought goal of the company's quantum computing effort. The critique comes amid mounting speculation about the validity of Microsoft's claim. \n\nMicrosoft announced the breakthrough, which could lead to a quantum computer more resistant to information loss than with other approaches, on 19 February. Without a peer-reviewed paper backing up the claim, some researchers were sceptical. An accompanying paper in Nature described a method to measure the read-out from future topological qubits, but did not offer proof of their existence. \n\nIn the latest critique, posted as a preprint, Henry Legg, a theoretical physicist at the University of St Andrews, UK, raises concerns about a test that Microsoft uses to look for Majoranas, so-far undiscovered quasiparticles arising from the collective behaviour of electrons that a",
        "id": 2270050,
        "language": null,
        "link": "https://slashdot.org/story/25/03/07/1350230/microsoft-quantum-computing-breakthrough-faces-fresh-challenge?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Quantum Computing 'Breakthrough' Faces Fresh Challenge",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T15:28:38+00:00",
        "description": "A Brazilian judge has ordered Apple to open its iOS platform to alternative app stores within 90 days, according to Valor International. The ruling cited Apple's compliance with similar requirements in the European Union under the Digital Markets Act without showing \"significant impact or irreparable harm to its economic model.\" \n\nThe case originated from a 2022 complaint by Mercado Livre. Brazil previously issued a 20-day deadline in November for Apple to permit alternative payment options and sideloading, but that injunction was overturned in December. Apple plans to appeal.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Brazil+Orders+Apple+To+Allow+iOS+Sideloading+Within+90+Days%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F03%2F07%2F138226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.p",
        "id": 2269481,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/03/07/138226/brazil-orders-apple-to-allow-ios-sideloading-within-90-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brazil Orders Apple To Allow iOS Sideloading Within 90 Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T15:28:38+00:00",
        "description": "FiveThirtyEight founder Nate Silver, on the site's demise: Last night, as President Trump delivered his State of the Union address, the Wall Street Journal reported that ABC News would lay off the remaining staff at 538 as part of broader cuts within corporate parent Disney. Having been through several rounds of this before, including two years ago when the staff was cut by more than half and my tenure expired too, I know it's a brutal process for everyone involved. It's also tough being in a business while having a constant anvil over your head, as we had in pretty much every odd-numbered (non-election) year from 2017 onward at 538/FiveThirtyEight. I don't know all of the staffers from the most recent iteration of the site, but the ones I have met or who I overlapped with are all extremely conscientious and hard-working people and were often forced to work double-duty as jobs were cut but frequently not replaced. My heart goes out to them, and I'm happy to provide recommendations fo",
        "id": 2269480,
        "language": null,
        "link": "https://politics.slashdot.org/story/25/03/07/1339236/nate-silver-on-the-demise-of-fivethirtyeight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nate Silver on the Demise of FiveThirtyEight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T14:23:29+00:00",
        "description": "Intuitive Machines' Athena lander touched down near the lunar south pole Thursday but may have toppled during landing, jeopardizing its scientific mission. \"We're trying to evaluate exactly what happened in that last bit,\" said Tim Crain, Intuitive Machines' chief technology officer. Data from an inertial measurement unit suggests the 15-foot robotic spacecraft is lying on its side. \n\nThe landing issues mirror problems faced by the company's Odysseus spacecraft last year, which also toppled after touchdown. Noisy data from laser altitude instruments likely contributed to the landing complications, officials said. CEO Steve Altemus reported the spacecraft isn't generating expected power, probably because its solar panels are improperly oriented. The company believes Athena landed somewhere on Mons Mouton, though outside the planned landing zone. \n\nThe $62.5 million NASA-contracted mission carries several payloads, including a drill to search for frozen water, three small rovers, and a",
        "id": 2268923,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/07/1321219/intuitive-machines-lunar-lander-reaches-moon-status-uncertain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intuitive Machines Lunar Lander Reaches Moon, Status Uncertain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T13:19:01+00:00",
        "description": "An anonymous reader quotes a report from The Verge: DuckDuckGo has big plans for embedding AI into its search engine. The privacy-focused company just announced that its AI-generated answers, which appear for certain queries on its search engine, have exited beta and now source information from across the web -- not just Wikipedia. It will soon integrate web search within its AI chatbot, which has also exited beta. DuckDuckGo first launched AI-assisted answers -- originally called DuckAssist -- in 2023. The feature is billed as a less obnoxious version of tools like Google's AI Overviews, designed to offer more concise responses and let you adjust how often you see them, including turning the responses off entirely. If you have DuckDuckGo's AI-generated answers set to \"often,\" you'll still only see them around 20 percent of the time, though the company plans on increasing the frequency eventually.\n \nSome of DuckDuckGo's AI-assisted answers bring up a box for follow-up questions, redi",
        "id": 2268493,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/07/0432251/duckduckgo-is-amping-up-its-ai-search-tool?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DuckDuckGo Is Amping Up Its AI Search Tool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T11:07:57+00:00",
        "description": "Mistral has launched a new multimodal OCR API that converts complex PDF documents into AI-friendly Markdown files. The API is designed for efficiency, handles visual elements like illustrations, supports complex formatting such as mathematical expressions, and reportedly outperforms similar offerings from major competitors. TechCrunch reports: Unlike most OCR APIs, Mistral OCR is a multimodal API, meaning that it can detect when there are illustrations and photos intertwined with blocks of text. The OCR API creates bounding boxes around these graphical elements and includes them in the output. Mistral OCR also doesn't just output a big wall of text; the output is formatted in Markdown, a formatting syntax that developers use to add links, headers, and other formatting elements to a plain text file.\n \nMistral OCR is available on Mistral's own API platform or through its cloud partners (AWS, Azure, Google Cloud Vertex, etc.). And for companies working with classified or sensitive data,",
        "id": 2267613,
        "language": null,
        "link": "https://slashdot.org/story/25/03/07/0426243/mistral-adds-a-new-api-that-turns-any-pdf-document-into-an-ai-ready-markdown-file?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mistral Adds a New API That Turns Any PDF Document Into an AI-Ready Markdown File",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T07:52:43+00:00",
        "description": "SpaceX's eighth Starship test flight ended in failure after losing control and breaking apart shortly after launch, sending debris over Florida. \"Starship didn't make it quite as high or as far\" as the attempt nearly two months ago,\" notes NPR. That attempt ended with an explosion that sent flaming debris raining down on the Turks and Caicos. From the report: This time, wreckage from the latest explosion was seen streaming from the skies over Florida. It was not immediately known whether the spacecraft's self-destruct system had kicked in to blow it up. The 403-foot rocket blasted off from Texas. SpaceX caught the first-stage booster back at the pad with giant mechanical arms, but engines on the spacecraft on top started shutting down as it streaked eastward for what was supposed to be a controlled entry over the Indian Ocean, half a world away. Contact was lost as the spacecraft went into an out-of-control spin.\n \nStarship reached nearly 90 miles in altitude before trouble struck an",
        "id": 2266589,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/07/0422209/spacexs-latest-starship-test-flight-ends-with-another-explosion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX's Latest Starship Test Flight Ends With Another Explosion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T04:32:08+00:00",
        "description": "Newer generative AI models have begun developing deceptive behaviors -- such as cheating at chess -- when they cannot achieve objectives through standard reasoning methods. The findings come from a preprint study from Palisade Research. An anonymous reader shares an excerpt from a Popular Science article: To learn more, the team from Palisade Research tasked OpenAI's o1-preview model, DeepSeek R1, and multiple other similar programs with playing games of chess against Stockfish, one of the world's most advanced chess engines. In order to understand the generative AI's reasoning during each match, the team also provided a \"scratchpad,\" allowing the AI to convey its thought processes through text. They then watched and recorded hundreds of chess matches between generative AI and Stockfish. The results were somewhat troubling. While earlier models like OpenAI's GPT-4o and Anthropic's Claude Sonnet 3.5 only attempted to \"hack\" games after researchers nudged them along with additional pro",
        "id": 2265829,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/06/233246/ai-tries-to-cheat-at-chess-when-its-losing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Tries To Cheat At Chess When It's Losing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T02:21:59+00:00",
        "description": "The U.S. Citizenship and Immigration Services (USCIS) is proposing to expand mandatory social media screening, currently required only for new arrivals, to include all non-citizens already residing in the U.S. who apply for immigration benefits. The Register reports: Back in 2019, the Department of Homeland Security, which runs USCIS, decided anyone looking to enter the US on a work visa or similar had to hand over their social media handles to the authorities so that they could be looked over for wrongdoing and subversion. In fact, this goes back to 2014, at least, to one degree or another, and has been standard procedure for years for foreigners, particularly those coming in on a visa. [...]\n \nOn January 20 this year, President Trump signed an executive order calling for much tougher vetting of foreign aliens, and in response, USCIS has proposed rules saying those already in the country who are going through some process with the agency -- such as applying for permanent residency o",
        "id": 2265385,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/06/2248204/us-mulls-policing-social-media-of-would-be-citizens?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Mulls Policing Social Media of Would-Be Citizens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T01:16:50+00:00",
        "description": "Google Gboard for Android is introducing circle or pill-shaped keys for some beta testers today. \"Instead of the key borders being rounded rectangles, Gboard is switching to circles and pills for letters, while the space bar and other keys are now pill-shaped,\" reports 9to5Google. \"While there should be no functional change to touch targets, these new shapes really shift the look of Gboard for Android.\" From the report: On paper, it's a bit more modern (and rounded) compared to what came before. However, it's a bit cramped if you have \"Long press for symbols\" enabled, which goes from the top-right corner to being directly above the letter. The physical analog Gboard is moving away from is how most keys on laptops and desktops are square.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gboard+Testing+Circle%2C+Pill-Shaped+Keys+On+Android%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F06%2F2242258%2F%3Futm_source%3",
        "id": 2265050,
        "language": null,
        "link": "https://slashdot.org/story/25/03/06/2242258/gboard-testing-circle-pill-shaped-keys-on-android?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gboard Testing Circle, Pill-Shaped Keys On Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T01:16:50+00:00",
        "description": "Earlier this week, Meta chief product officer Chris Cox said the company's upcoming open-source Llama 4 AI will help power AI agents for hundreds of millions of businesses. CNBC reports: The AI agents won't just be responding to prompts. They will be capable of new levels of reasoning and action -- surfing the web and handling many tasks that might be of use to consumers and businesses. And that's where Shih comes in. Meta's AI is already being used by over 700 million consumers, according to Shih, and her job is to bring the same technologies to businesses. \"Not every business, especially small businesses, has the ability to hire these large AI teams, and so now we're building business AIs for these small businesses so that even they can benefit from all of this innovation that's happening,\" she told CNBC's Julia Boorstin in an interview for the CNBC Changemakers Spotlight series.\n \nShe expects the uptake among businesses to happen soon, and spread far and wide. \"We're quickly comin",
        "id": 2265051,
        "language": null,
        "link": "https://meta.slashdot.org/story/25/03/06/2234251/meta-is-targeting-hundreds-of-millions-of-businesses-in-agentic-ai-deployment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Is Targeting 'Hundreds of Millions' of Businesses In Agentic AI Deployment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-07T00:04:52+00:00",
        "description": "An anonymous reader quotes a report from Reuters: The U.S. House Judiciary Committee subpoenaed Alphabet on Thursday seeking its communications with former President Joe Biden's administration about content moderation policies. House Judiciary Committee Chairman Jim Jordan, a Republican, also asked the YouTube parent company for similar communications with companies and groups outside government, according to a copy of the subpoena seen by Reuters. The subpoena seeks communications about limits or bans on content about President Donald Trump, Tesla CEO and close Trump ally Elon Musk, the virus that causes COVID-19 and a host of other conservative discussion topics. \"Alphabet, to our knowledge, has not similarly disavowed the Biden-Harris Administration's attempts to censor speech,\" Jordan said in a letter.\n \nMeanwhile, Google spokesperson Jose Castaneda said the company will \"continue to show the committee how we enforce our policies independently, rooted in our commitment to free ex",
        "id": 2264677,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/06/2138250/us-house-panel-subpoenas-alphabet-over-content-moderation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US House Panel Subpoenas Alphabet Over Content Moderation",
        "vote": 0
    }
]