[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T16:25:31.638602+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T15:30:28+00:00",
        "description": "Resident Evil 9 has finally been revealed, or rather, Resident Evil Requiem has. TThe survival horror game is coming to Xbox Series X/S, PS5, and PC - no previous-gen consoles this time - on February 27th, 2026. It almost felt too good to be true.\n\nHowever, the development team also debuted the first trailer and suffice it to say that it has us scrambling. Grace Ashcroft, daughter of Alyssa Ashcroft, is apparently the protagonist this time and ventures to the Wrenwood Hotel to investigate a case. Terrible things are afoot right away as she's shown tied with no escape.\n\nFrom there, we're treated to many other incredible revelations. Ground Zero at Raccoon City, which the game has confirmed we'll revisit; a new mutated human that can slither around; a mysterious figure in a hood whose allegiance is unknown; and much more. It's a lot to take in - let's dive into everything we know and what we can speculate.",
        "id": 2874291,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TFojuRHguHQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TFojuRHguHQ/hqdefault.jpg",
        "title": "Resident Evil 9 Requiem - Seriously, What’s Going On?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T16:25:31.861166+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T15:30:10+00:00",
        "description": "Mario Kart World is an extremely ambitious game, and it seems to have made it a personal challenge to rethink practically every aspect. Not all of those work out: the Free Roam mode in particular is likely to be divisive among those who expected more structure, and while I imagine the Grand Prix and Battle Mode changes will be largely well-received, there will certainly be some who are disappointed. \n\nBut almost everything else, from the new mechanics to the new tracks, from the excellent graphics to the amazing soundtrack, from the Knockout Tour mode to the more physics driven emergent style of gameplay, is a home run. Whether or not Mario Kart World is better than Mario Kart 8 Deluxe is a question that will be answered in due time, for now, we can at least say that, in attempting to avoid having to answer that question, Nintendo have turned out an extremely high quality, polished, and fun package that almost anyone can enjoy in Mario Kart World.",
        "id": 2874292,
        "language": null,
        "link": "https://www.youtube.com/watch?v=RdJlKWzTKio",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RdJlKWzTKio/hqdefault.jpg",
        "title": "Mario Kart World Review - The Switch 2's First Killer Game?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T05:33:34.018148+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T04:45:03+00:00",
        "description": "Summer Game Fest 2025 was a pretty cracking event. With tons of new game reveals, announcements and updates, there was a lot to keep track of. In this video, we take a look at 20 of the biggest announcements at the event. So, let’s dive right in.",
        "id": 2871440,
        "language": null,
        "link": "https://www.youtube.com/watch?v=C1VcAeWYB1U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/C1VcAeWYB1U/hqdefault.jpg",
        "title": "Summer Game Fest 2025 - 20 HUGE Game Announcements That Blew Our Minds",
        "vote": 0
    }
]