[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T23:39:08.578383+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T23:28:00+00:00",
        "description": "Is copyrighted material a requirement for training AI? asks the Washington Post. That's what top AI companies are arguing, and \"Few AI developers have tried the more ethical route &mdash; until now. \n\n\"A group of more than two dozen AI researchers have found that they could build a massive eight-terabyte dataset using only text that was openly licensed or in public domain. They tested the dataset quality by using it to train a 7 billion parameter language model, which performed about as well as comparable industry efforts, such as Llama 2-7B, which Meta released in 2023.\"\n\n A paper published Thursday detailing their effort also reveals that the process was painstaking, arduous and impossible to fully automate. The group built an AI model that is significantly smaller than the latest offered by OpenAI's ChatGPT or Google's Gemini, but their findings appear to represent the biggest, most transparent and rigorous effort yet to demonstrate a different way of building popular AI tools.... ",
        "id": 2876412,
        "language": null,
        "link": "https://slashdot.org/story/25/06/07/0527212/ai-firms-say-they-cant-respect-copyright-but-a-nonprofits-researchers-just-built-a-copyright-respecting-dataset?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Firms Say They Can't Respect Copyright.  But A Nonprofit's Researchers Just Built a Copyright-Respecting Dataset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T23:39:08.735669+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T22:28:00+00:00",
        "description": "TweakTown writes that the Switch 2 \"has reportedly beaten the record for the most-sold console within 24 hours and is on track to shatter the two-month record,\" selling over 3 million units and tripling the PlayStation 4's previous launch day sales. \nSo Nintendo's first console in 8 years becomes \"one of the most successful hardware releases of all time,\" writes Barron's, raising hopes for the future:\n\n[2017's original Switch] ultimately sold more than 152 million units... Switch 2's big advantage is its backward compatibility, allowing it to play current-generation Switch games and giving gamers solace that their large investments in software are intact... Many older Switch games also play better on the Switch 2, taking advantage of the extra horsepower. \n\n\nBloomberg writes that its bigger screen and faster chip \"live up to the hype:\n\nDespite the hype and a $150 increase over the launch price for the original, the second-generation system manages to impress with faster performance, i",
        "id": 2876413,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/07/2224259/nintendo-switch-2-has-record-breaking-launch-selling-over-3-million-units?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nintendo Switch 2 Has Record-Breaking Launch, Selling Over 3 Million Units",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T21:29:30.745482+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T20:59:00+00:00",
        "description": "Mike Judge always seemed to have secret geek sympathies. He co-created the HBO series Silicon Valley, as well as the movie Office Space (reviewed in 1999 by Slashdot contributor Jon Katz). \n\nNow comes the word that besides rebooting Buffy the Vampire Slayer &mdash; and an animated scifi/action/horror film called Predator: Killer of Killers &mdash; Hulu is also relaunching Judge's animated series King of the Hill on August 4th. And Cinemablend notes they took great pains to ensure the inclusion of internet-loving neighbor Dale Gribble despite the death of voice actor Johnny Hardwick:\n\n\n\nCo-creators Mike Judge and Greg Daniels joined the cast of returning voice actors for a revealing Q&amp;A at ATX Fest while also revealing longtime cast member Toby Huss took over the role of Dale Gribble... Hardwick passed away in August 2023 at 64, with fans and co-stars paying tribute soon after. It was revealed at the time that he'd recorded some audio for the new season, but it was clear that anoth",
        "id": 2875905,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/07/2055259/king-of-the-hill-and-dale-gribble-return-to-tv-after-15-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'King of the Hill' (and Dale Gribble) Return To TV After 15 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T19:19:04.705226+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T18:58:00+00:00",
        "description": "LSD \"is used to treat conditions like depression, post-traumatic stress disorder and addiction,\" notes Science Daily. And now a microbiology student \"has found a long sought-after fungus that produces effects similar to the semisynthetic drug...\"\n\n\nMorning glory plants live in symbiosis with fungi that produce the same ergot alkaloids the Swiss chemist Albert Hofmann modified when he invented LSD in the late 1930s. Hofmann hypothesized that a fungus in morning glories produced alkaloids similar to those in LSD, but the species remained a mystery... \n\nThe researchers dubbed the fungus \"Periglandula clandestina\" for its ability to have eluded investigators for decades.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Student+Discovers+Long-Awaited+Mystery+Fungus+Sought+By+LSD's+Inventor%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F06%2F07%2F1854211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"htt",
        "id": 2875324,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/07/1854211/student-discovers-long-awaited-mystery-fungus-sought-by-lsds-inventor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Student Discovers Long-Awaited Mystery Fungus Sought By LSD's Inventor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T18:14:03.956936+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T17:34:00+00:00",
        "description": "Once upon a time, long-time Slashdot reader tgibson learned how to type on a manual typewriter, back in an 8th grade classroom. \nAnd to this day, they write, \"my bias is to nod approvingly at touch typists and roll my eyes at those who need to stare at the keyboard while typing...\" But how true is that for computer professionals today?\n\nAfter 15 years I left industry and became a post-secondary computer science educator. Occasionally I rant to my students about the importance of touch-typing as a skill to have as a software engineer. \n\nBut I've been out of the game for some time now. Those of you hiring or working with freshly-minted software engineers, what's your take? \n\nOne anonymous Slashdot reader responded:\n\nOh, you mean the kid in the next cubicle that has said \"Hey Siri\" 297 times this morning? I'll let you know when he starts typing. A minor suggestion to office managers... please purchase a very quiet keyboard. Fellow cube-mates who are accomplished typists would consider th",
        "id": 2875003,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/06/07/0811223/ask-slashdot-how-important-is-it-for-programmers-to-learn-touch-typing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ask Slashdot:  How Important Is It For Programmers to Learn Touch Typing?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T17:10:04.353596+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T16:34:00+00:00",
        "description": "MIT comp-sci professor Ryan Williams suspected that a small amount of memory \"would be as helpful as a lot of time in all conceivable computations...\" writes Quanta magazine. \n\n\"In February, he finally posted his proof online, to widespread acclaim...\"\n\n\nEvery algorithm takes some time to run, and requires some space to store data while it's running. Until now, the only known algorithms for accomplishing certain tasks required an amount of space roughly proportional to their runtime, and researchers had long assumed there's no way to do better. Williams' proof established a mathematical procedure for transforming any algorithm &mdash; no matter what it does &mdash; into a form that uses much less space. \nWhat's more, this result &mdash; a statement about what you can compute given a certain amount of space &mdash; also implies a second result, about what you cannot compute in a certain amount of time. This second result isn't surprising in itself: Researchers expected it to be true, b",
        "id": 2874570,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/07/0714256/for-algorithms-a-little-memory-outweighs-a-lot-of-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'For Algorithms, a Little Memory Outweighs a Lot of Time'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T16:05:23.522147+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T15:34:00+00:00",
        "description": "Meta's Facebook and Instagram apps \"were siphoning people's data through a digital back door for months,\" writes a Washington Post tech columnist, citing researchers who found no privacy setting could've stopped what Meta and Yandex were doing, since those two companies \"circumvented privacy and security protections that Google set up for Android devices. \n\n\"But their tactics underscored some privacy vulnerabilities in web browsers or apps. These steps can reduce your risks.\"\n\n Stop using the Chrome browser. Mozilla's Firefox, the Brave browser and DuckDuckGo's browser block many common methods of tracking you from site to site. Chrome, the most popular web browser, does not... For iPhone and Mac folks, Safari also has strong privacy protections. It's not perfect, though. No browser protections are foolproof. The researchers said Firefox on Android devices was partly susceptible to the data harvesting tactics they identified, in addition to Chrome. (DuckDuckGo and Brave largely did bl",
        "id": 2874236,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/07/035249/washington-posts-privacy-tip-stop-using-chrome-delete-metas-apps-and-yandex?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Washington Post's Privacy Tip: Stop Using Chrome, Delete Meta's Apps (and Yandex)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T14:59:03.787326+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T14:34:00+00:00",
        "description": "\"Everyone has a blog these days, even Claude,\" Anthropic wrote this week on a page titled \"Claude Explains.\" \n\n\"Welcome to the small corner of the Anthropic universe where Claude is writing on every topic under the sun\". \n\nNot any more. After blog posts titled \"Improve code maintainability with Claude\" and \"Rapidly develop web applications with Claude\" &mdash; Anthropic suddenly removed the whole page sometime after Wednesday. But TechCrunch explains the whole thing was always less than it seemed, and \"One might be easily misled into thinking that Claude is responsible for the blog's copy end-to-end.\"\nAccording to a spokesperson, the blog is overseen by Anthropic's \"subject matter experts and editorial teams,\" who \"enhance\" Claude's drafts with \"insights, practical examples, and [...] contextual knowledge.\" \n\"This isn't just vanilla Claude output &mdash; the editorial process requires human expertise and goes through iterations,\" the spokesperson said. \"From a technical perspective, C",
        "id": 2873906,
        "language": null,
        "link": "https://slashdot.org/story/25/06/07/0412244/anthropics-ai-is-writing-its-own-blog---oh-wait-no-its-not?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic's AI is Writing Its Own Blog - Oh Wait. No It's Not",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T13:54:04.174512+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T13:00:00+00:00",
        "description": "Cybercriminals have been increasingly turning to \"residential proxy\" services over the past two to three years to disguise malicious web traffic as everyday online activity, according to research presented at the Sleuthcon cybercrime conference. The shift represents a response to law enforcement's growing success in targeting traditional \"bulletproof\" hosting services, which previously allowed criminals to maintain anonymous web infrastructure. \n\nResidential proxies route traffic through decentralized networks running on consumer devices like old Android phones and low-end laptops, providing real IP addresses assigned to homes and offices. This approach makes malicious activity extremely difficult to detect because it appears to originate from trusted consumer locations rather than suspicious server farms. The technology creates particular challenges when attackers appear to come from the same residential IP ranges as employees of target organizations.<p><div class=\"share_submission\" ",
        "id": 2873542,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/07/0137211/cybercriminals-are-hiding-malicious-web-traffic-in-plain-sight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cybercriminals Are Hiding Malicious Web Traffic in Plain Sight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T12:50:06.744130+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T12:00:00+00:00",
        "description": "Britain is moving toward major nuclear power commitments after years of delays, as government officials acknowledge they can no longer postpone critical energy infrastructure decisions. The U.K. Treasury has exhausted options for delaying nuclear power choices, Politico reported this week, citing sources within Whitehall and the nuclear industry. \n\nThe urgency stems from Britain's aging nuclear infrastructure, where five power plants currently supply 15% of the country's total energy needs but face shutdown by 2030. This timeline has created significant pressure on policymakers to secure replacement capacity or risk substantial gaps in the nation's electricity supply.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Britain+Prepares+To+Go+All-In+On+Nuclear+Power+-+After+Years+of+Dither%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F07%2F0220214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https:",
        "id": 2873243,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/07/0220214/britain-prepares-to-go-all-in-on-nuclear-power---after-years-of-dither?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Britain Prepares To Go All-In On Nuclear Power - After Years of Dither",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T10:40:29.579580+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T10:00:00+00:00",
        "description": "Startup Nord Quantique has demonstrated that a single piece of hardware can host an error-detecting logical qubit by using two quantum frequencies within one resonator. The breakthrough has the potential to slash the hardware demands for quantum error correction and deliver more compact and efficient quantum computing architectures. Ars Technica reports: The company did two experiments with this new hardware. First, it ran multiple rounds of error detection on data stored in the logical qubit, essentially testing its ability to act like a quantum memory and retain the information stored there. Without correcting errors, the system rapidly decayed, with an error probability in each round of measurement of about 12 percent. By the time the system reached the 25th measurement, almost every instance had already encountered an error. The second time through, the company repeated the process, discarding any instances in which an error occurred. In almost every instance, that meant the resul",
        "id": 2872626,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/06/2223229/startup-puts-a-logical-qubit-in-a-single-piece-of-hardware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Startup Puts a Logical Qubit In a Single Piece of Hardware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T07:23:31.608517+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T07:00:00+00:00",
        "description": "Apple has urged Australia not to follow the European Union in mandating iPhone app sideloading, warning that such policies pose serious privacy and security risks. \"This communication comes as the Australian federal government considers new rules that could force Apple to open up its iOS ecosystem, much like what happened in Europe with recent legislation,\" notes Neowin. Apple claims that allowing alternative app stores has led to increased exposure to malware, scams, and harmful content. From the report: Apple, in its response to this Australian paper (PDF), stated that Australia should not use the EU's Digital Markets Act \"as a blueprint\". The company's core argument is that the changes mandated by the EU's DMA, which came into full effect in March 2024, introduce serious security and privacy risks for users. Apple claims that allowing sideloading and alternative app stores effectively opens the door for malware, fraud, scams, and other harmful content. The tech company also highlig",
        "id": 2871880,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/06/2249222/apple-warns-australia-against-joining-eu-in-mandating-iphone-app-sideloading?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Warns Australia Against Joining EU In Mandating iPhone App Sideloading",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T04:08:25.013617+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: In 2019, we told you about a new interactive digital \"murder map\" of London compiled by University of Cambridge criminologist Manuel Eisner. Drawing on data catalogued in the city coroners' rolls, the map showed the approximate location of 142 homicide cases in late medieval London. The Medieval Murder Maps project has since expanded to include maps of York and Oxford homicides, as well as podcast episodes focusing on individual cases. It's easy to lose oneself down the rabbit hole of medieval murder for hours, filtering the killings by year, choice of weapon, and location. Think of it as a kind of 14th-century version of Clue: It was the noblewoman's hired assassins armed with daggers in the streets of Cheapside near St. Paul's Cathedral. And that's just the juiciest of the various cases described in a new paper published in the journal Criminal Law Forum.\n \nThe noblewoman was Ela Fitzpayne, wife of a knight named Sir Robert Fitz",
        "id": 2871216,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/06/2122243/cambridge-mapping-project-solves-a-medieval-murder?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cambridge Mapping Project Solves a Medieval Murder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T01:58:25.278191+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T01:21:00+00:00",
        "description": "Physicists at Loughborough University have created what they believe is the world's smallest violin, measuring just 35 microns long and 13 microns wide -- smaller than the width of a human hair, which typically ranges from 17 to 180 microns in diameter. The microscopic instrument, created using the university's new nanolithography system, serves as a demonstration of precision manufacturing capabilities that researchers will apply to studies of computing efficiency and energy harvesting methods. \n\nThe team used a NanoFrazor machine employing thermal scanning probe lithography, where a heated needle-like tip etches highly precise patterns at the nanoscale onto a chip coated with gel-like resist material. While the individual violin takes roughly three hours to produce, the research team spent several months refining their techniques to achieve the final result, which exists as a microscopic image rather than a playable instrument.<p><div class=\"share_submission\" style=\"position:relativ",
        "id": 2870859,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/07/0121245/scientists-create-worlds-smallest-violin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Create 'World's Smallest Violin'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-07T00:53:25.257029+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-07T00:30:00+00:00",
        "description": "Longtime Slashdot reader sinij shares a report from Car and Driver: [Volvo] is debuting a new version of the three-point seatbelt that it believes is a major improvement over the original. The new design will be a smart belt that adapts to each occupant's body and adjusts the belt load accordingly. It uses data from interior and exterior sensors to customize protection based on the road conditions and the specific occupants. The technology will debut on the upcoming EX60 crossover.\n \nAccording to Volvo, the onboard sensors can accurately detect a passenger's height, weight, body shape, and seating position. Based on real-time data, the belts optimize protection -- increasing belt load for larger passengers or lowering it for smaller passengers. While the technology for customizing protection isn't new -- Volvo's current belts already use three load-limiting profiles- the new belts increase that number to 11. The belts should also get safer over time, too, as they are equipped to recei",
        "id": 2870616,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/06/222246/volvo-debuts-new-iot-seatbelt-design?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Volvo Debuts New IoT Seatbelt Design",
        "vote": 0
    }
]