[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T23:29:32.701586+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T22:50:00+00:00",
        "description": "LinkedIn is rolling out an AI-powered people search tool that lets users find connections by describing what they need instead of relying on names or titles. For example, you can enter a more descriptive search, such as \"Northwestern alumni who work in entertaining marketing,\" or even pose a question, like \"Who can help me understand the US work visa system.\" The Verge reports: LinkedIn senior director of product management Rohan Rajiv tells The Verge that the platform will rank results based on the connections you might have with someone, as well as their relevance to your search. [...] LinkedIn is rolling out AI-powered people search to Premium users in the US starting today, but the platform plans on bringing it to all users soon.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LinkedIn+Is+Making+It+Easier+To+Search+For+People+With+AI%3A+https%3A%2F%2Fsearch.slashdot.org%2Fstory%2F25%2F11%2F13%2F2218200%2F%3Futm_s",
        "id": 4064200,
        "language": "en-us",
        "link": "https://search.slashdot.org/story/25/11/13/2218200/linkedin-is-making-it-easier-to-search-for-people-with-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LinkedIn Is Making It Easier To Search For People With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T22:29:09.668453+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T22:13:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Jeff Bezos' Blue Origin has landed the booster of its New Glenn mega-rocket on a drone ship in the Atlantic Ocean on just its second attempt -- making it the second company to perform such a feat, following Elon Musk's SpaceX. It's an accomplishment that will help the new rocket system become an option to send larger payloads to space, the Moon, and beyond. Thursday's launch wasn't just about the landing attempt, though. Roughly 34 minutes after takeoff, the upper stage of New Glenn successfully deployed the rocket's first commercial payload: twin spacecraft for NASA that will travel to Mars to study the red planet's atmosphere. The pair of achievements are remarkable for the second-ever launch of such a massive rocket system. And it could put Blue Origin in position to compete with SpaceX, which dominates the world's launch market with its Falcon 9, Falcon Heavy, and Starship rockets. You can watch a recording of the launch here.<p",
        "id": 4063760,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/13/2211216/blue-origin-sticks-first-new-glenn-rocket-landing-and-launches-nasa-spacecraft",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blue Origin Sticks First New Glenn Rocket Landing and Launches NASA Spacecraft",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T22:29:09.770480+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T21:26:00+00:00",
        "description": "German Chancellor Friedrich Merz said Chinese suppliers such as Huawei will be excluded from the country's future telecommunication networks on security grounds as he pushes for more digital sovereignty. From a report: \"We have decided within the government that everywhere it's possible we'll replace components, for example in the 5G network, with components we have produced ourselves,\" Merz told a business conference in Berlin on Thursday. \"And we won't allow any components from China in the 6G network.\" \n\nEurope is increasingly concerned about its reliance on foreign technology, ranging from Asian semiconductors to US artificial intelligence and cloud infrastructure, as trade and geopolitical tensions threaten critical supply chains. Germany last year ordered telecom operators to remove Huawei equipment from their core networks, citing risks to national security. Berlin is now considering using public funds to pay Deutsche Telekom AG and others to strip out Chinese gear, Bloomberg N",
        "id": 4063761,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/1842225/germany-to-ban-huawei-from-future-6g-network-in-sovereignty-push",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Germany To Ban Huawei From Future 6G Network in Sovereignty Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T21:28:34.252517+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T20:50:00+00:00",
        "description": "bobthesungeek76036 writes: Beijing's proposed regulation aims to tame rapid launches by forcing cars to boot up in a restricted performance mode after every ignition. \n\nUnder a proposed update to the National Standard, every passenger car would need a default mode in which it takes no less than five seconds to reach 100 km/h (62 mph) at startup, unless the driver manually selects a quicker setting. \n\nThe draft title \"Technical Specifications for Power-Driven Vehicles Operating on Roads\" appears to be part of a broader safety and road behavior initiative in China. It is intended to replace the current GB 7258-2017 standard that didn't impose such restrictions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Plans+To+Limit+How+Fast+Your+Car+Accelerates+To+62+MPH+At+Startup%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F13%2F175228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.",
        "id": 4063274,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/175228/china-plans-to-limit-how-fast-your-car-accelerates-to-62-mph-at-startup",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Plans To Limit How Fast Your Car Accelerates To 62 MPH At Startup",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T20:27:51.296014+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T20:10:00+00:00",
        "description": "Michael Burry, the investor made famous for his bet against the US housing market ahead of the 2008 financial crisis, is closing his hedge fund [non-paywalled source] as he warned that market valuations had become unhinged from fundamentals. From a report: Scion Asset Management this week terminated its registration with US securities regulators, according to a Securities and Exchange Commission database. Burry told investors that he would \"liquidate the funds and return capital -- but for a small audit/tax holdback -- by year's end,\" according to two people with direct knowledge of a letter he sent to investors. \n\n\"My estimation of value in securities is not now, and has not been for some time, in sync with the markets,\" said the letter, which was dated October 27. The move to close Scion comes as some investors have become concerned that markets are trading at frothy levels after years of strong returns. Those jitters flared up on Thursday, with the tech-heavy Nasdaq Composite slidi",
        "id": 4062800,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/13/1744254/big-short-investor-michael-burry-to-close-hedge-fund-as-he-warns-on-valuations",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Big Short' Investor Michael Burry To Close Hedge Fund as He Warns on Valuations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T20:27:51.571064+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T19:31:00+00:00",
        "description": "China's state-sponsored hackers used AI technology from Anthropic to automate break-ins of major corporations and foreign governments during a September hacking campaign, the company said Thursday. From a report: The effort focused on dozens of targets and involved a level of automation that Anthropic's cybersecurity investigators had not previously seen, according to Jacob Klein, the company's head of threat intelligence. \n\nHackers have been using AI for years now to conduct individual tasks such as crafting phishing emails or scanning the internet for vulnerable systems, but in this instance 80% to 90% of the attack was automated, with humans only intervening in a handful of decision points, Klein said. \n\nThe hackers conducted their attacks \"literally with the click of a button, and then with minimal human interaction,\" Klein said. Anthropic disrupted the campaigns and blocked the hackers' accounts, but not before as many as four intrusions were successful. In one case, the hackers ",
        "id": 4062801,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/13/1715248/chinese-hackers-used-anthropics-ai-to-automate-cyberattacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Hackers Used Anthropic's AI To Automate Cyberattacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T19:27:08.825566+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T18:51:00+00:00",
        "description": "An anonymous reader shares a report: Robinhood Markets is betting its Gen Z and millennial clientele are as eager to send out for delivery of a wad of cash as they are to order pizza or a pint of ice cream. \n\nThe brokerage is joining with food-and-drink delivery app Gopuff to allow customers to withdraw cash from their Robinhood bank accounts and have it brought right to their door. For a $6.99 delivery fee -- or $2.99 if they have more than $100,000 in assets across their Robinhood accounts -- users can skip the ATM and have money delivered in a sealed paper bag while they are at home. \n\nIt is a new feature that Robinhood first teased in March, when Chief Executive Vlad Tenev unveiled the company's plans to roll out many traditional and -- as with its cash-delivery service -- unconventional banking services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Robinhood+Offers+To+Bring+Cash+To+Your+Doorstep%2C+for+a+Fee%",
        "id": 4062288,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/13/1712207/robinhood-offers-to-bring-cash-to-your-doorstep-for-a-fee",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Robinhood Offers To Bring Cash To Your Doorstep, for a Fee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T18:26:36.039921+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T18:07:00+00:00",
        "description": "Mozilla announced on Thursday that it is building an AI Window for Firefox, a new opt-in browsing mode that will let users interact with an AI assistant and chatbot. The feature will become one of three browsing experiences in Firefox alongside the existing classic and private windows. Users will be able to select which AI model they want to use in the AI Window, according to a post on the Mozilla Connect forum. \n\nThe company opened a waitlist for users who want to receive updates and be among the first to test the feature. Mozilla described the AI Window as an \"intelligent and user-controlled space\" that it is developing in the open through community feedback. Users who try the feature and decide against it can switch it off entirely.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mozilla+Launches+AI+Window+for+Firefox%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F13%2F186229%2F%3Futm_source%3Dtwitter%26ut",
        "id": 4061824,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/186229/mozilla-launches-ai-window-for-firefox",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mozilla Launches AI Window for Firefox",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T18:26:36.183753+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T17:30:00+00:00",
        "description": "BrianFagioli writes: Popular privacy firm Proton is floating a plan on Reddit that should unsettle anyone who values privacy, writes Nerds.xyz. The company is considering recycling abandoned email addresses that were originally created by bots a decade ago. These addresses were never used, yet many of them are extremely common names that have silently collected misdirected emails, password reset attempts, and even entries in breach datasets. Handing those addresses to new owners today would mean that sensitive messages intended for completely different people could start landing in a stranger's inbox overnight. \n\nProton says it's just gathering feedback, but the fact that this made it far enough to ask the community is troubling. Releasing these long-abandoned addresses would create confusion, risk exposure of personal data, and undermine the trust users place in a privacy focused provider. It's hard to see how Proton could justify taking a gamble with other people's digital identitie",
        "id": 4061825,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/13/172239/proton-might-recycle-abandoned-email-addresses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Proton Might Recycle Abandoned Email Addresses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:26:08.581634+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:51:00+00:00",
        "description": "Verizon is planning to cut roughly 15,000 jobs, looking to reduce costs as it contends with increased competition for wireless service and home internet, according to WSJ, which cites people familiar with the matter. From the report: The cuts, the largest ever for the carrier, are set to take place in the next week, the people said. The majority of the reduction is expected to be made through layoffs. Verizon also plans to transition about 200 stores into franchised operations, which will shift employees off its payroll. \n\nVerizon, the largest U.S. telecommunications provider by subscriber base, faces a fierce battle for both wireless and home internet customers. It has lost crucial postpaid phone subscribers for three consecutive quarters. Last month, Verizon named its lead independent director Daniel Schulman as its new chief executive officer. Schulman, a former CEO of PayPal and Virgin Mobile USA, has said he would aggressively reduce the company's entire cost base and take steps ",
        "id": 4061153,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/1651220/verizon-to-cut-about-15000-jobs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Verizon To Cut About 15,000 Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:25:46.253777+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:05:00+00:00",
        "description": "Reddit cofounder Alexis Ohanian said he had serious doubts a decade ago about sharing the platform's data with Sam Altman. Ohanian recounted on the \"Brew Markets\" podcast that between 2015 and 2016, Altman asked Reddit to let him \"aggressively scrape\" the site's content. Altman had recently helped Reddit raise $50 million in a Series B round and was launching OpenAI as a nonprofit. \n\nOhanian described Altman as \"very smart\" and \"incredibly cunning\" but questioned whether he was \"the most philanthropically minded guy.\" The Reddit cofounder said he \"felt in my bones\" the company should refuse the request and debated internally about it against Steve Huffman. Ohanian said he \"lost that debate.\" Reddit and OpenAI announced a formal licensing deal in 2024.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Reddit+Cofounder+Had+a+Bad+Feeling+About+Giving+Data+To+Sam+Altman%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%",
        "id": 4060510,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/1549226/reddit-cofounder-had-a-bad-feeling-about-giving-data-to-sam-altman",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Cofounder Had a Bad Feeling About Giving Data To Sam Altman",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:25:46.367162+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T15:29:00+00:00",
        "description": "An anonymous reader shares a report: France has lifted its travel ban on Telegram founder Pavel Durov, who is under investigation over illegal content on his messaging app, judicial sources close to the case said Thursday. The entrepreneur, 41, was detained in Paris in 2024 and is under formal investigation by French authorities over the platform's alleged complicity in criminal activity. Durov, who was initially banned from leaving France, had his judicial control relaxed in July, allowing him to reside in the United Arab Emirates, where Telegram is based, for a maximum of two weeks at a time.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=France+Fully+Lifts+Travel+Ban+on+Telegram+Founder+Durov%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F13%2F1529216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook",
        "id": 4060511,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/13/1529216/france-fully-lifts-travel-ban-on-telegram-founder-durov",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "France Fully Lifts Travel Ban on Telegram Founder Durov",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T15:25:19.928775+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T14:16:00+00:00",
        "description": "An anonymous reader shares a report: The Chinese electric car has become a symbol of the country's seemingly unstoppable rise on the world stage. Many observers point to their growing popularity as evidence that China is winning the race to dominate new technologies. But in China, these electric cars represent something entirely different: the profound threats that Beijing's meddling in markets poses to both China and the world. \n\nBloated by excessive investment, distorted by government intervention, and plagued by heavy losses, China's EV industry appears destined for a crash. EV companies are locked in a cutthroat struggle for survival. Wei Jianjun, the chairman of the Chinese automaker Great Wall Motor, warned in May that China's car industry could tumble into a financial crisis; it \"just hasn't erupted yet.\" \n\nTo bypass government censorship of bad economic news, market analysts have opted for a seemingly anodyne term to describe the Chinese car industry's downward spiral: involut",
        "id": 4059949,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/1446256/chinas-ev-market-is-imploding",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's EV Market Is Imploding",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T14:24:55.823779+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T14:06:00+00:00",
        "description": "Google says it will build a new \"advanced flow\" to allow experienced users to install Android apps from unverified developers, easing up on restrictions it proposed in late August. The company said earlier that Android would block such installations starting next year. The new flow will include clear warnings about security risks but will give users final control over the decision. \n\nGoogle said it is designing the system to resist coercion and prevent users from being tricked into bypassing safety checks. The company is currently gathering early feedback on the feature's design. Google also announced that developers who distribute apps exclusively outside the Play Store can now join an early access program for developer verification.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+To+Allow+'Experienced+Users'+To+Install+Unverified+Android+Apps%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F13%2F146214",
        "id": 4059347,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/146214/google-to-allow-experienced-users-to-install-unverified-android-apps",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google To Allow 'Experienced Users' To Install Unverified Android Apps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T13:23:24.234808+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T13:00:00+00:00",
        "description": "Iceland has formally classified the potential collapse of a major Atlantic Ocean current system a national security threat, warning that a disruption could trigger a modern-day ice age in Northern Europe and destabilize global weather systems. The move elevates the risk across government and enables it to strategize for worst-case scenarios. Reuters reports: The Atlantic Meridional Overturning Circulation, or AMOC, current brings warm water from the tropics northward toward the Arctic, and the flow of warm water helps keep Europe's winters mild. But as warming temperatures speed the thaw of Arctic ice and cause meltwater from Greenland's ice sheet to pour into the ocean, scientists warn the cold freshwater could disrupt the current's flow.\n \nA potential collapse of AMOC could trigger a modern-day ice age, with winter temperatures across Northern Europe plummeting to new cold extremes, bringing far more snow and ice. The AMOC has collapsed in the past - notably before the last Ice Age ",
        "id": 4058799,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/12/2339231/iceland-deems-possible-atlantic-current-collapse-a-security-risk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iceland Deems Possible Atlantic Current Collapse A Security Risk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T10:21:43.424807+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T10:00:00+00:00",
        "description": "FX has renewed Alien: Earth for a second season and signed creator Noah Hawley to a massive nine-figure overall deal with Disney Entertainment Television. Deadline reports: Inspired by Ridley Scott's sci-fi thriller film Alien, Hawley adapted the film franchise for television with the strong support of Scott Free and its president, David W. Zucker, who is an executive producer of the series. It earned a positive reaction from fans, posting a 94% Certified Fresh rating from Rotten Tomatoes and a Metacritic Must-Watch score of 85. \"It has been our great privilege to work with Noah for more than a decade on some of FX's best and biggest shows, and we are thrilled to extend our partnership well into the future,\" said FX Chairman John Landgraf. \"Noah never stops surprising us with truly original stories -- and his unique ability to bring them to vibrant life as a director and producer as well as writer makes him extraordinary. We can't wait to get to work on the next season of Alien: Earth",
        "id": 4057508,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/12/2359226/alien-earth-renewed-for-second-season",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Alien: Earth Renewed For Second Season",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T07:19:25.111972+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T07:00:00+00:00",
        "description": "For the first time, astronomers captured the shockwave of a supernova bursting through the surface of a dying red supergiant star, revealing a surprisingly symmetrical, grape-shaped explosion. Space.com reports: Seeing this moment in detail has previously been elusive because it's rare for a supernova to be spotted early enough and for telescopes to be trained on it -- and when they have been, the exploding star has been too far away. So, when supernova 2024ggi went boom on April 10, 2024 in the relatively nearby spiral galaxy NGC 3621, which is 22 million light-years away in the constellation of Hydra, the Water Snake, astronomer Yi Yang of Tsinghua University in Beijing knew he had to act.\n \nAlthough the supernova itself couldn't be resolved as anything put a point of light, the polarization of that light held the clues as to the geometry of the breakout. \"The geometry of a supernova explosion provides fundamental information on stellar evolution and the physical processes leading t",
        "id": 4056643,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/12/2346249/scientists-watch-supernova-shockwave-shoot-through-a-dying-star-for-first-time",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Watch Supernova Shockwave Shoot Through a Dying Star For First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T04:16:47.262388+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Electrek: Production is now underway at Toyota's new $13.9 billion battery plant in North Carolina, the company's first outside Japan. After the first batteries rolled off the production line at its new facility in Liberty, North Carolina, on Wednesday, Toyota said today marks a \"pivotal moment\" in the company's history. The facility is Toyota's 11th plant in the US and its first battery plant outside of Japan.\n \nToyota first announced plans to build EV batteries in the US almost four years ago. The nearly $14 billion facility will create up to 5,100 jobs in the area. In addition, the Japanese auto giant announced plans to invest an additional $10 billion in its US operations over the next five years. Since it first arrived in the US nearly 70 years ago, Toyota has invested close to $60 billion.\n \nThe mega site spans 1,850 acres, or about the size of 121 football fields, and can produce up to 30 GWh annually. Toyota will use the hub to develop ",
        "id": 4055851,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/12/2332244/toyota-opens-the-doors-to-its-first-ev-battery-plant-in-the-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Toyota Opens the Doors To Its First EV Battery Plant In the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T02:15:41.468688+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T02:02:00+00:00",
        "description": "Russia's first AI humanoid robot, Aldol, fell just seconds after its debut at a technology event in Moscow on Tuesday. \"The robot was being led on stage to the soundtrack from the film 'Rocky,' before it suddenly lost its balance and fell,\" reports the BBC. \"Assistants could then be seen scrambling to cover it with a cloth -- which ended up tangling in the process.\" Developers of Aldol blamed poor lighting and calibration issues for the collapse, saying the robot's stereo cameras are sensitive to light and the hall was dark.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russia's+AI+Robot+Falls+Seconds+After+Being+Unveiled%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F11%2F12%2F2327202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F1",
        "id": 4055308,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/12/2327202/russias-ai-robot-falls-seconds-after-being-unveiled",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia's AI Robot Falls Seconds After Being Unveiled",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T02:15:41.555392+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T01:25:00+00:00",
        "description": "Slashdot readers Tablizer and fjo3 share news that an AI-generated country song has topped the U.S. sales chart for the first time this week. ABC News reports: The new country tune, \"Walk my Walk\" by Breaking Rust, recently hit No. 1 on Billboard's Country Digital Song Sales chart, reaching over 3 million streams on Spotify in less than a month. That success has garnered mixed reactions from music fans and artists alike, particularly on TikTok, where hundreds of users have posted videos addressing the tune and others discussing the music in the comments.\n \nBillboard has acknowledged Breaking Rust is an AI act and said it is one of at least six to chart in the past few months alone. \"Ultimately, this feels like an experiment to see just how far something like this can go and what happens in the future and in other disciplines of art as well,\" senior entertainment reporter Kelley L. Carter told ABC News. \"AI artists won't require things that a real human artist will require, and once co",
        "id": 4055309,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/12/2320241/ai-generated-song-tops-country-music-chart",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Generated Song Tops Country Music Chart",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T01:15:15.471889+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T00:45:00+00:00",
        "description": "Waymo is rolling out robotaxi rides that use freeways across Los Angeles, San Francisco, and Phoenix for the first time -- \"a critical expansion for the company that it says will reduce ride times by up to 50%,\" reports TechCrunch. From the report: That stat could help attract a whole new group of users who need to travel between the many towns and suburbs within the greater San Francisco Bay Area or quicken commutes across the sprawling Los Angeles and Phoenix metro areas. Using freeways is also essential for Waymo to offer rides to and from the San Francisco Airport, a location the company is currently testing in.\n \nThe service won't be offered to all Waymo riders at first, the company said. Waymo riders who want to experience freeway rides can note their preference in the Waymo app. Once the rider hails a ride, they may be matched with a freeway trip, according to the company.\n \nThe company's robotaxi routes will now stretch to San Jose, an expansion that will create a unified 260-",
        "id": 4055034,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/12/238227/waymo-robotaxis-are-now-giving-rides-on-freeways",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo Robotaxis Are Now Giving Rides On Freeways",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T00:14:47.015697+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from CNBC: Anthropic announced plans Wednesday to spend $50 billion on a U.S. artificial intelligence infrastructure build-out, starting with custom data centers in Texas and New York. The facilities, which will be designed to support the company's rapid enterprise growth and its long-term research agenda, will be developed in partnership with Fluidstack.\n \nFluidstack is an AI cloud platform that supplies large-scale graphics processing unit, or GPU, clusters to clients like Meta, Midjourney and Mistral. Additional sites are expected to follow, with the first locations going live in 2026. The project is expected to create 800 permanent jobs and more than 2,000 construction roles. The investment positions Anthropic as a major domestic player in physical AI infrastructure at a moment when policymakers are increasingly focused on U.S.-based compute capacity and technological sovereignty. \"We're getting closer to AI that can accelerate scientific discov",
        "id": 4054683,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/12/2217257/anthropic-to-spend-50-billion-on-us-ai-infrastructure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic To Spend $50 Billion On US AI Infrastructure",
        "vote": 0
    }
]