[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T18:55:29.662581+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T18:00:23+00:00",
        "description": "Dogs have become cherished members of our families, seamlessly integrated into our daily lives and routines. Our love for them runs deep, yet we often overlook their most fundamental needs. All too often, their well-being takes a backseat to the demands of human life. And while we may provide the basics we tend to neglect the deeper, more essential needs that truly support their health and happiness. Dogs have a remarkable way of teaching us about compassion, presence, and responsibility. Perhaps they’re in our lives not just for companionship, but to remind us of what it means to care selflessly and live with intention. In this TEDxOldHickory talk Ali Hemyari, a world renowned dog training expert, shares firsthand insights drawn from working with thousands of dogs - including specialized working breeds and law enforcement canines. \n\nAli Hemyari is a dynamic and accomplished entrepreneur, having founded multiple successful companies within and outside of the pet industry. As a recogni",
        "id": 4061955,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=N_6giH_t4HI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N_6giH_t4HI/hqdefault.jpg",
        "title": "You love your dog, but do you really get them? | Ali Hemyari | TEDxOldHickory",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:37.519580+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:56:59+00:00",
        "description": "Andrew Platt discusses the topics of ambition and motivation in our daily lives.   Dr. Andrew Platt (PhD, Semitic Languages and Literature, Catholic University of America) is currently serving as an Educational Trainer and Instructional Coach at Tianjin International School, a Lifeplus School in that city. This is his seventh year with Lifeplus/LDI and he has previously served to design and launch new educational programming in Yantai and Qingdao, both in the Shandong province. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4061328,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2jHWxUovYRg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2jHWxUovYRg/hqdefault.jpg",
        "title": "What gets you out of bed in the morning?  | Andrew Platt | TEDxYantai Huasheng Intl School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:37.686069+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:56:14+00:00",
        "description": "Mair shares a deeply personal journey, moving from post-secondary education to nonprofit technology, to Indigenous foodways, and eventually back to nonprofit work with a focus on reconciliation. Throughout her story, she explains that although education is often framed through a Western structure, true learning is much broader and includes understanding food as medicine, developing essential life skills, and carrying community values. Her message shows that education is not limited to classrooms or curricula, but is rooted in culture, identity, and reconciliation, offering a vision of learning that strengthens both individuals and communities. Mair Greenfield is an Indigenous education leader and member of Kebaowek First Nation whose career spans post-secondary education, nonprofit technology, and Indigenous foodways. She currently serves as Director at the Gord Downie & Chanie Wenjack Fund and has held leadership roles at Canadore College’s First Peoples’ Centre, Nourish Leadership, ",
        "id": 4061329,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vmmiTwEYMTg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vmmiTwEYMTg/hqdefault.jpg",
        "title": "The Future of Indigenous Education | Mair Greenfield | TEDxRosedale Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:37.822274+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:56:11+00:00",
        "description": "We genuinely want to help guide young people with advice about life. But research shows that when we look back and tell the story of our lives, our narratives become accidentally distorted - and those omissions leave young people feeling lost when their path is anything but linear. When Harvard scholar Alexis Redding discovered a lost trove of interviews from 50 years ago, it began a journey that led her to uncover a powerful new way to understand how young people grow, stumble, and make meaning on the path to adulthood. In this talk, she shares her research about how we can tell our own stories more completely – and better support young adults in the process. Dr. Alexis Redding is a developmental psychologist and the faculty co-chair of Higher Education at the Harvard Graduate School of Education. She is a leading expert on college student mental health and the editor of the forthcoming book Mental Health in College: What Research Tells Us About Supporting Students. Her research is f",
        "id": 4061330,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9V95WhTylz4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9V95WhTylz4/hqdefault.jpg",
        "title": "Why we keep telling young adults the wrong stories | Alexis Redding | TEDxCapeMay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:37.987401+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:55:58+00:00",
        "description": "Cara Hanig, Director of College Counseling at Beaver Country Day School, tells an evocative story about the art of learning to listen. She reflects on Lauren, her college roommate, and the unlikely friendship that shaped her. Through shared experiences, quiet support, and the transformative power of listening, Cara explores how meaningful connection can grow from difference. In my heart and soul, I will never not be a camp counselor. I'm also a wife and a mom of a 10-year-old son, which happens to be my favorite role. I'm originally from upstate New York, and I live in Framingham with my family and my ridiculous dog, Hobbes. I'm the Director of College Counseling at Beaver Country Day School, and I've been in the college counseling/ admission world since I graduated from college. I love playing music, cooking, hiking, and family time! This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/",
        "id": 4061331,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wZRQU6l7t6M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wZRQU6l7t6M/hqdefault.jpg",
        "title": "Listening Like Lauren | Cara Hanig | TEDxBeaverCountryDaySchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.176705+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:55:50+00:00",
        "description": "Emma Thiebault, senior at Beaver Country Day School, explores the surprising ways the four years of high school mirror the five stages of grief. What began as a joke becomes a thoughtful reflection on how we navigate change, identity, and growing up. Through personal stories and deep reflection, Emma shows us that high school isn’t just a rite of passage—it’s an emotional journey of letting go and moving forward. Emma Thiebault is a senior at Beaver Country Day School. She's from Boston, MA, and a lifer at Beaver. She likes to run, cook, listen to music, and hangout with friends. She plans to pursue global commerce and political science next year in college. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4061332,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aV6UPKWgIvo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aV6UPKWgIvo/hqdefault.jpg",
        "title": "Bargaining with Time: What Ifs, Whys, and What’s Next | Emma Thiebault | TEDxBeaverCountryDaySchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.304590+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:55:04+00:00",
        "description": "Nate Guevin (they/them) explores the intersections of identity, individuality, and community—and the roles each has played in shaping their life. They reflect on discovering their identity, the support found in community during times of need, and the tension that can arise when these values conflict. Through honest reflection, NG invites us to consider how identity and community can challenge each other—and ultimately lift each other up. Nate Guevin (they/them) is a non-binary creative, teacher, and cat parent, who is currently in their seventh year teaching design to the middle school population at Beaver Country Day School. In their spare time, NG spends time with their spouse, Mira, and their two cats, Dumpling and Egg. They are also an avid skateboarder and fingerboarder, creating their own miniature skateboards to use with their hands. They started learning digital design with focus in laser cutting and 3D printing in their sophomore year at Bennington College, which they continu",
        "id": 4061333,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xBx6rCmyzyA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xBx6rCmyzyA/hqdefault.jpg",
        "title": "Community & Individuality: Life with Both | Nate Guevin | TEDxBeaverCountryDaySchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.441308+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:56+00:00",
        "description": "Halima Jibril Usman, a blind chef, demonstrates her incredible cooking skills to prove that disability does not define ability. Through her passion and talent, she inspires others to challenge limitations, embrace their potential, and show that anyone can achieve greatness with determination. This talk celebrates resilience, creativity, and the power of change. Halima is a talented blind chef whose passion for cooking turns simple ingredients into unforgettable meals. She inspires others by proving that determination and creativity know no limits.\" This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4061334,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=S9cl5qtBhd0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S9cl5qtBhd0/hqdefault.jpg",
        "title": "The Blind chef: Endless Talent | Halima Jibril Usman | TEDxZaria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.584214+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:48+00:00",
        "description": "Badamasi Aliyu Abdullahi explores the power of personal branding and how it shapes our professional and personal lives. He shares practical strategies to define your unique identity, communicate your value effectively, and stand out in a competitive world. This talk inspires individuals to take control of their narrative, build meaningful connections, and unlock opportunities through a strong personal brand. Badamasi Aliyu Abdullahi is a certified, accredited and licensed National Business Development Service Provider BDSP, a certified trainer, Youth Development Consultant, writer who helps micro, small and medium sized businesses to start, grow and expand their businesses. He is a Presidential Award Winning entrepreneur in the Youth With Enterprise and Innovation in Nigeria, Youwin Programme. He's a Co-founder of Eco Fertilizer - an organic compost fertilizer production company in Kano, founder of Founder Dogaro Da Kai Hub and founder of Dogaro Da Kai Conference, the first annual bus",
        "id": 4061335,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WtREfmJxMuI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WtREfmJxMuI/hqdefault.jpg",
        "title": "Personal Branding: Build Your Unique Identity | Badamasi Aliyu Andullahi | TEDxZaria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.698025+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:44+00:00",
        "description": "Shanshan Xu, founder of the Chinese program at Beaver Country Day School, explores what it means to live between two cultures. What if your name held a lifelong identity crisis—and also a hidden superpower? In this talk, Shanshan shares how navigating her Chinese and American identities reveals the beauty, tension, and transformation that come from embracing contradiction. Shanshan is the Chinese program founder and Upper School Chinese teacher at Beaver Country Day School in Chestnut Hill, MA. From Chengdu, China, hometown of Giant Pandas and the most delicious food in the world, she majored in Asian Studies at Mount Holyoke College in western Mass and wanted to inspire kids to learn more about China by teaching Chinese. Shanshan now lives in Boston with her husband Drew and one year old son, Theodore (Ruru). She loves spending time with her family and friends, traveling and tasting food from all over the world. This talk was given at a TEDx event using the TED conference format but ",
        "id": 4061336,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yeRH7AkXm4c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yeRH7AkXm4c/hqdefault.jpg",
        "title": "Between Words and Worlds | Shanshan Xu | TEDxBeaverCountryDaySchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.843682+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:30+00:00",
        "description": "Dr. Nurudeen Usman sheds light on how depression is often ignored in local communities, leaving many to struggle in silence. He explores the cultural misconceptions, stigma, and lack of awareness that prevent people from seeking help. This talk encourages communities to recognize mental health challenges, offer support, and take meaningful steps toward healing, proving that understanding and action can transform lives. Dr. Nuruddeen Usman is a pharmacist and academic with over a decade of progressive experience in pharmacy practice, academia, and healthcare consultancy. He holds a Bachelor of Pharmacy (B.Pharm.) from Ahmadu Bello University, Zaria; a Master’s degree (M.Pharm.) and a PhD in Clinical Pharmacy from the University of Nigeria, Nsukka.\nHe is currently a Senior Lecturer in the Department of Clinical Pharmacy and Pharmacy Practice, Faculty of Pharmaceutical Sciences, Usmanu Danfodiyo University, Sokoto, where he combines teaching, research, and student mentorship. His core ac",
        "id": 4061337,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OI9SwoqSZWc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OI9SwoqSZWc/hqdefault.jpg",
        "title": "Silent Minds, Hidden Pain | Usman Nuruddeen | TEDxZaria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:38.984652+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:22+00:00",
        "description": "Under the theme Tunani Aiki Chanji, Muhammad Shamsudeen Abdullahi shows how innovative thinking can turn waste into wealth. He demonstrates how everyday trash can become valuable resources when we take action, creating economic opportunities and promoting sustainability. This talk inspires us to transform ideas into meaningful change, proving that even what we discard holds the power to shape a better future. Muhammad Shamsudeen is a seasoned resilience  and international development professional with over seven years of experience in policy, environmental governance, climate change education and community resilience. He has successfully led donor funded projects focusing on climate change mobility, policy advocacy, and sustainable development across Africa. Muhammad design strategic programs that enhance the adaptive capacity of climate vulnerable regions, particularly through data analyst, research publications, and capacity building workshops for civil society organisations and fro",
        "id": 4061338,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=T8OY7xaZR_Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/T8OY7xaZR_Y/hqdefault.jpg",
        "title": "From Waste to Wealth | Muhammad Shamsudeen Ibrahim | TEDxZaria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:39.157436+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:14+00:00",
        "description": "In this inspiring talk, Dr. Usman Hayatu Mazadu explores the transformative power of self-knowledge. He emphasizes that true change begins when we understand who we are our strengths, weaknesses, and values. By knowing ourselves first, we gain the clarity and courage to take meaningful steps toward personal growth and positive change in our lives. This talk is a guide to unlocking your potential from the inside out and embracing change that lasts. Charismatic Public Servant and a Mentor\nDr. Usman Hayatu Mazadu  is a charismatic leader, strategic thinker, and a public servant who is currently serving as the Executive Secretary of the Kaduna State Emergency Management Agency (KADSEMA).\n\nDr. Mazadu’s academic journey reflects his dedication to excellence and continuous growth. He graduated from Al-Qalam University, Katsina, in May 2014 with a Bachelor of Science (B.Sc.) degree in Computer Science. In June 2018, he obtained an MSc in Management Information Systems  from Cyprus Internation",
        "id": 4061339,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=p_iO0Ryh7uc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/p_iO0Ryh7uc/hqdefault.jpg",
        "title": "Know Yourself, Change Yourself | Dr. Usman Hayatu Mazadu | TEDxZaria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:39.332242+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:54:11+00:00",
        "description": "La historia relata cómo los repetidos “no” recibidos desde la infancia se transformaron en motor para construir un camino en la literatura. Un profesor despertó el gusto por la lectura, y desde entonces los libros, las personas y los gestos de confianza, formaron una red que impulsó nuevas etapas. La escritura se convirtió en refugio durante el desamor y en una forma de encontrarse a sí mismo, mientras comunidades literarias confirmaban que no estaba solo. A pesar de críticas y momentos duros, otras manos extendidas lo llevaron a descubrir mundos, poetas y países donde su voz fue reconocida. Con perseverancia y fidelidad a la palabra, alcanzó logros como viajar por varios países, publicar, ganar premios y entender que lo imposible es cuestión de tiempo. Comunicador social, docente universitario y gestor de cultural. Ha trabajado en instituciones educativas, bibliotecas y editoriales, liderando proyectos de comunicación institucional, producción audiovisual y mediación lectora. Es auto",
        "id": 4061340,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NGK8ONm-Dd8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NGK8ONm-Dd8/hqdefault.jpg",
        "title": "Redes sociales humanas: hacer lo imposible es cuestión de tiempo | Kevin Villacis | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:39.521598+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:53:53+00:00",
        "description": "幼い頃から全国各地を旅し、多様な地域の文化や課題に触れる中で、地方創生への関心を深める。現在までに44都道府県を訪問し、地域ごとの魅力や可能性を探求してきた。そのような経験から、「地方はどうすればもっと元気になれるか？」という問いを持つようになり、昨年末には「和歌山県データ利活用コンペティション」に応募、北海道・道北エリアの地域活性化モデルを世界に発信することを提言。政策アイデア賞を受賞した。このアイデアをより多くの人に伝え、実現へとつなげるため、今回の発表に臨む。 幼い頃から全国各地を旅し、多様な地域の文化や課題に触れる中で、地方創生への関心を深める。現在までに44都道府県を訪問し、地域ごとの魅力や可能性を探求してきた。そのような経験から、「地方はどうすればもっと元気になれるか？」という問いを持つようになり、昨年末には「和歌山県データ利活用コンペティション」に応募、北海道・道北エリアの地域活性化モデルを世界に発信することを提言。政策アイデア賞を受賞した。このアイデアをより多くの人に伝え、実現へとつなげるため、今回の発表に臨む。 This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4061341,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bvrmdOVIQKQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bvrmdOVIQKQ/hqdefault.jpg",
        "title": "ちょっと新しい\"視点\"で地方を救う | Akihisa NAGANO | TEDxWASEDA Jitsugyo Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T17:54:39.766940+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:53:33+00:00",
        "description": "4歳からピアノと極真空手を始め、早稲田実業初等部に入学。自分を表現することに興味を持ち、12歳で芸能活動をスタートし、現在は学業とタレント・モデル活動を両立させている。幼い頃から医学にも興味を持ち続け、がん研究会有明病院による「ブラックジャックセミナー」に参加し \"未来のドクター\" として認定証を頂く。これをきっかけに本格的に医師を目指すようになり、難民セミナーを通じて、海外の大学で最先端の医療技術を学びたいと志すようになる。 夢を抱き続けることの素晴らしさを、僕の人生を通して届けたい。 4歳からピアノと極真空手を始め、早稲田実業初等部に入学。自分を表現することに興味を持ち、12歳で芸能活動をスタートし、現在は学業とタレント・モデル活動を両立させている。\n幼い頃から医学にも興味を持ち続け、がん研究会有明病院による「ブラックジャックセミナー」に参加し \"未来のドクター\" として認定証を頂く。\nこれをきっかけに本格的に医師を目指すようになり、難民セミナーを通じて、海外の大学で最先端の医療技術を学びたいと志すようになる。 夢を抱き続けることの素晴らしさを、僕の人生を通して届けたい。 This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4061342,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MTjZTdfT-zI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MTjZTdfT-zI/hqdefault.jpg",
        "title": "夢の本質とは | Rui MURASAWA | TEDxWASEDA Jitsugyo Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:53:59.271836+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:40:42+00:00",
        "description": "Η κλιματική αλλαγή είναι αποτέλεσμα μιας σειράς κρίσεων, με κυριότερη τη διάβρωση των αξιών και τον υπερκαταναλωτισμό. Η ιδέα ότι η πρόοδος θα πρέπει να βασίζεται σε οικονομικά μεγέθη αποτελεί μια ύπουλη αλλοίωση των αξιών της κοινωνίας μας. Ο Καθηγητής Μιχαήλ Σκούλλος είναι Ομότιμος Καθηγητής Χημείας Περιβάλλοντος και Ωκεανογραφίας και Επικεφαλής της Έδρας και Δικτύου UNESCO για τη Διαχείριση & Εκπαίδευση για την Αειφόρο Ανάπτυξη στη Μεσόγειο στο ΕΚΠΑ. Μέλος της Ευρωπαϊκής Ακαδημίας Επιστημών, είναι ιδρυτής και Πρόεδρος του MIO-ECSDE και Πρόεδρος της Global Water Partnership – Mediterranean. Συντονίζει το Κοινοτικό Μεσογειακό Πρόγραμμα WES-BCA (2024–2027), την Ελληνική Εθνική Επιτροπή ΜΑΒ/UNESCO και το διεθνές δίκτυο MEdIES με 6.500 εκπαιδευτικά μέλη. Έχει συγγράψει βιβλία και περίπου 500 επιστημονικά άρθρα με πάνω από 8.000 ετεροαναφορές. Έχει τιμηθεί με πολυάριθμα βραβεία, όπως το Χρυσό Μετάλλιο της Πόλης των Παρισίων, το Βραβείο της Ακαδημίας Αθηνών, παράσημα από τον Λίβανο και τη",
        "id": 4060720,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dp2ddRsNJ8Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dp2ddRsNJ8Q/hqdefault.jpg",
        "title": "Η κλιματική αλλαγή: απότοκος και μητέρα των κρίσεων | Δρ. Μιχαήλ - Μάριος Σκούλλος | TEDxPlaka",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:53:59.429816+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:40:23+00:00",
        "description": "Μιλά για την επανατοποθέτηση του τρόπου με τον οποίο βλέπουμε τα άλλα ζώα. Αναδεικνύει την αξία της γνώσης και της πληροφορίας για τον κόσμο των ζώων ως ικανή συνθήκη που μπορεί να μας αλλάξει. Θέτει την πρόκληση να αναρωτηθούμε: «Είναι τα άλλα ζώα ατελείς εκδοχές του ανθρώπου ή τέλειες εκδοχές του εαυτού τους; Είμαστε το ανθρώπινο το κριτήριο αξιολόγησης της φύσης ή απλώς μια εκδοχή της;» Η Ηρώ είναι ερευνήτρια και οικολόγος με σπουδές στην Κοινωνική Ανθρωπολογία και την Ευζωία των Ζώων, θεωρώντας την προστασία της φύσης και των ζώων θεμελιακά κοινωνικά ζητήματα. Έχει πραγματοποιήσει πρωτογενή έρευνα για τις σχέσεις ανθρώπων-πολιτισμού και φαλαινών στην Ισλανδία, καθώς και για τη δράση οργανώσεων που προστατεύουν τη μεσογειακή φώκια σε Ελλάδα και Ιταλία. Έχει γυρίσει ντοκιμαντέρ για μαυροδέλφινα στην Τενερίφη, τη βιοποικιλότητα στο Ρίο και τις αλεπούδες στην Αθήνα. Εμπλέκεται σε εθελοντικές δράσεις όπως αναδασώσεις, περιβαλλοντική εκπαίδευση, περίθαλψη άγριας ζωής, διάσωση ζώων από κ",
        "id": 4060721,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XybColpIq5Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XybColpIq5Q/hqdefault.jpg",
        "title": "Τι είναι αυτό που αναζητούμε στα άλλα ζώα; | Ηρώ Τσαρμποπούλου - Φωκιανού | TEDxPlaka",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:53:59.608723+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:35:05+00:00",
        "description": "Il talk esplora il ruolo emergente dell’intelligenza artificiale nel processo creativo, evidenziando come l’artista tradizionale stia diventando sempre più un “art director” di macchine. Attraverso esempi concreti, gli speaker mostrano come le IA eseguano le indicazioni senza mai contraddirle, e riflettono sulle implicazioni di un mondo in cui le idee non vengono messe in discussione. La discussione si sviluppa tra esperienze reali, casi concreti di produzione e provocazioni creative, suggerendo un futuro in cui la ribellione creativa delle IA potrebbe diventare necessaria per stimolare veri momenti di innovazione. Marco Cioni è il CEO della Slim Dogs Production, content factory e casa di produzione video tra le più in vista nel panorama italiano. Oltre alla gestione strategica dell'azienda si occupa della direzione creativa del progetto di divulgazione cinematografica \"Slim Dogs\" su YouTube. \n\nMatteo Bruno aka Cane Secco, appassionato di videomaking fin da piccolo, nel 2007 trova in ",
        "id": 4060722,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OLxYn_okUz8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OLxYn_okUz8/hqdefault.jpg",
        "title": "I.A. ribellati! | Slim Dogs | TEDxBarletta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:53:59.774240+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:34:46+00:00",
        "description": "Biyoteknolojilerde yaklaşan devrimin ayak sesleri 2000 yılında İstanbul’da doğan Elif Damla Karakolcu, İstanbul Üniversitesi Moleküler Biyoloji ve Genetik bölümünden mezun oldu. Bugün Avrupa’nın ve dünyanın lider biyoteknoloji odaklı kitlesel fonlama platformu Capital Cell’de İletişim Direktörü olarak görev yapmakta ve bilimsel inovasyonun finans dünyasıyla buluşmasını kolaylaştırmaktadır.\n\nKariyerine Türkiye’nin öncü bilimsel kurumlarında araştırmalarla başlayan Karakolcu, bilimin dönüştürücü etkisinin yalnızca laboratuvarlarla sınırlı kalmaması gerektiğini fark ederek bilim iletişimine yöneldi.\n\nBu vizyonla başlattığı BioRevolution bülteni çok yönlü bir kaynak haline geldi.\n\nBilimsel araştırmalardan girişimcilik projelerine, liderlik programlarından uluslararası ödüllere uzanan yolculuğunda Karakolcu’nun amacı, biyoteknolojinin dünyayı dönüştürücü gücünü daha geniş kitlelerle paylaşmak, bilimi anlaşılır kılmak ve yatırım yapılabilir hale getirmektir. This talk was given at a TEDx ev",
        "id": 4060723,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Y5m2XaEca1A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y5m2XaEca1A/hqdefault.jpg",
        "title": "Biyoteknolojik Devrim | 2025 | Elif Damla Karakolcu | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:53:59.993862+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:34:32+00:00",
        "description": "A rare and emotionally compelling glimpse into the profound transformations unfolding at Elephant Sanctuary Brazil, where rescued elephants are healing from the mental, physical, and emotional traumas of captivity. Each elephant’s journey of self-rediscovery reveals their unmistakable individuality and often-unseen emotional depth, offering insights into what is truly essential for healing, wholeness, and reconnection. Kara leads the U.S. team at Global Sanctuary for Elephants, working with co-founders Scott and Kat Blais to protect, rescue, and provide sanctuary for elephants worldwide. She shapes strategy and communications to support the ongoing care of sanctuary residents, raise awareness about the harms of captivity, and improve the lives of elephants in need. Through her work, she carries forward the stories of sanctuary elephants that touch on universal lessons of healing and connection. This talk was given at a TEDx event using the TED conference format but independently organ",
        "id": 4060724,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lnqM00y0Bz4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lnqM00y0Bz4/hqdefault.jpg",
        "title": "What Sanctuary Elephants Teach Us about Healing | Kara Edwards | TEDxFolsom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:00.225853+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:34:24+00:00",
        "description": "Most people believe comfort keeps them safe. In truth, it quietly limits who they can become.\n\nIn this TEDx talk, Peter Sage shares hard-won lessons from one of the world’s toughest sporting events — insights that anyone can apply to everyday challenges. Through stories of endurance, mindset, and growth, he reveals how the principles that drive elite performers under pressure can help anyone overcome fear, build resilience, and expand what’s possible in life.\n\nIf you’re ready to conquer your own comfort zone and unlock your potential, this talk will show you where real strength begins.\n Peter is a globally renowned serial entrepreneur with expertise in human behavior and self-mastery. His distinct perspective has earned him recognition as an exceptional individual with the Brand Laureate Award, joining past honorees such as Nelson Mandela, Steve Jobs, and Cristiano Ronaldo. This talk was given at a TEDx event using the TED conference format but independently organized by a local commu",
        "id": 4060725,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2BOrbMlaxPg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2BOrbMlaxPg/hqdefault.jpg",
        "title": "How sport's toughest event taught me to conquer my comfort zone | Peter Sage | TEDxWarrenton",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:00.404242+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:34:16+00:00",
        "description": "The key to getting what you want, especially when it matters most, is the ability to persuade, says author and practitioner Joshua Bandoch. He reveals research-backed and road-tested techniques for maximizing your persuasive potential in any situation.  Persuasion expert Joshua Bandoch is the author of How to Get What You Want: Mastering the Art and Science of Persuasion. He has spent over a decade uncovering the secrets of persuasion, mining psychology, neuroscience, economics, public policy, and history for cutting-edge techniques that work. He’s put them to use in hundreds of speeches written for senior government officials delivered to just about any audience. Bandoch uses and refines these persuasion techniques on a daily basis as a think tank leader, where he crafts and communicates policies on issues like poverty, social mobility, and education to politically diverse audiences, including elected officials, local and national media, and grassroots activists. This talk was given ",
        "id": 4060726,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xuljgojxxCo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xuljgojxxCo/hqdefault.jpg",
        "title": "How to be more persuasive | Joshua Bandoch | TEDxIllinois Tech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:00.773148+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:34:07+00:00",
        "description": "En esta charla, Pancho Domínguez nos invita a descubrir cómo la adversidad puede transformarse en oportunidad y los desafíos en motores de crecimiento. Desde su infancia en el rancho, donde aprendió del ejemplo de su padre que la disciplina, el trabajo y el respeto por la vida son los cimientos del éxito, hasta su liderazgo durante la pandemia de COVID-19, reconocido como uno de los más efectivos del país, comparte cómo la resiliencia, la visión y el compromiso con los demás permiten generar cambios duraderos. Empresario destacado, líder nacional vigente y con un profundo vínculo con su comunidad, transmite estos valores a sus hijos, a su círculo cercano y a la sociedad, mostrando cómo la integridad, la amistad y el propósito pueden abrir caminos extraordinarios. Una reflexión cercana y honesta sobre cómo levantarse siempre, inspirar a otros y dejar un legado que trasciende generaciones, llevando siempre consigo las enseñanzas de su padre. Originario de Querétaro, Francisco Domínguez ",
        "id": 4060727,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vgcsoTS0Ig4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vgcsoTS0Ig4/hqdefault.jpg",
        "title": "Donde hubo piedras, brotan sueños.  | Pancho Domínguez | TEDxJardínZenea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:00.976768+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:33:59+00:00",
        "description": "¿Qué futuro estamos dejando en manos de la próxima generación? En su charla, Verónica nos sumerge en los desafíos que enfrentan los jóvenes hoy, desde el impacto de la inteligencia artificial en el trabajo y el amor, hasta la presión de tomar decisiones que definirán sus vidas. Con una mirada cercana y maternal, advierte, inspira y guía: la tecnología es poderosa, pero nuestra conciencia, valores y esfuerzo seguirán siendo la brújula que marque el rumbo.\n\nUn llamado a construir un futuro extraordinario, donde la responsabilidad, la autonomía y la creatividad se convierten en herramientas para transformar retos en oportunidades. Una charla que despierta reflexión, acción y esperanza, y que nos recuerda que lo que sembramos hoy, define el mundo de mañana. Verónica es una pionera del comercio internacional en México, con una carrera que abarca más de cuatro décadas. Licenciada en Comercio Exterior y Administración de Empresas, con estudios en la Universidad de Quebec en Montreal y una ma",
        "id": 4060728,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9ax6vcwQ4Dw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9ax6vcwQ4Dw/hqdefault.jpg",
        "title": "El reto, jóvenes construyendo un futuro extraordinario. | Verónica Valverde | TEDxJardínZenea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:01.238239+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:33:50+00:00",
        "description": "En esta charla, comparte cómo la fortuna ha marcado momentos clave en su carrera, desde los papeles que lo consagraron hasta las oportunidades que transformaron su camino artístico. Más allá del talento y la fama, explora la delgada línea entre preparación, riesgo y azar, revelando cómo la suerte puede ser tanto un motor como un maestro en la vida profesional y personal. Una mirada honesta y fascinante a la trayectoria de uno de los artistas más reconocidos de Latinoamérica, contada desde la profundidad de la experiencia y la pasión por su arte. Originario de Querétaro, es un actor, productor y artista multidisciplinario con más de 25 años de trayectoria en televisión, cine y teatro. Reconocido por su participación en telenovelas emblemáticas como Mirada de mujer, Azul tequila y La mujer de Judas, ha trabajado con las principales cadenas de Latinoamérica y Estados Unidos, consolidándose como una de las figuras más influyentes y respetadas de la industria, ahora compartiendo su experie",
        "id": 4060729,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9OXfwi7J2LQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9OXfwi7J2LQ/hqdefault.jpg",
        "title": "La suerte.  | Víctor González | TEDxJardínZenea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:01.443534+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:33:46+00:00",
        "description": "En esta charla, nos invita a reflexionar sobre la autonomía femenina en todos los ámbitos de la vida, explorando cómo la dependencia económica ha condicionado históricamente las relaciones y la toma de decisiones de las mujeres. Con una mirada aguda y fundamentada en su experiencia como abogada laboral y defensora de la equidad, aborda los desafíos contemporáneos: la presión y el hostigamiento en el trabajo, el acoso laboral, las expectativas sociales y los roles de género que aún persisten. Habla de los tiempos que han cambiado y de la urgencia de construir relaciones y entornos laborales donde la libertad, la independencia y la justicia sean la norma. Su mensaje es claro y transformador: la fuerza del empoderamiento femenino no solo reside en la voz, sino en la capacidad de reclamar dignidad, respeto y autonomía en la vida personal y profesional. Una voz que nace de la experiencia, la resiliencia y un profundo compromiso con la justicia laboral y la equidad de género. Con más de 20 ",
        "id": 4060730,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Pm9-sUsNjM4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Pm9-sUsNjM4/hqdefault.jpg",
        "title": "¿Amor o Dependencia económica?. | Marité Villanueva | TEDxJardínZenea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:01.669776+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:33:42+00:00",
        "description": "In this inspiring TEDx talk, he shares his remarkable journey from a small border village in Poonch to leading one of India’s most advanced medical institutions. Through stories of perseverance, innovation, and vision, he redefines what it means to break boundaries — from personal limitations to systemic barriers in healthcare. His journey proves that true progress begins when we turn borders into beginnings, dreams into direction, and institutions into instruments of hope for a healthier, boundaryless India. He is a renowned Hospital Administrator, Researcher and Healthcare Reformer from Poonch, J&K. An alumnus of AIIMS and GMC Jammu, he has led key national health initiatives, authored nine books, mentored over 45 scholars and contributed to healthcare systems in India and abroad. He played a pivotal role in formulating the National Ambulance Code, establishing trauma centres and standardising hospital administration education. He is the Founder-President of RFHHA and the first Indi",
        "id": 4060731,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SRriroHy3ek",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SRriroHy3ek/hqdefault.jpg",
        "title": "Redefining Healthcare from the Edge of the Nation | Prof. (Dr.) Shakti Kumar Gupta | TEDxJKPS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:01.893191+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:31:29+00:00",
        "description": "In this visionary TEDx talk, he reflects on the meaning of borders — from the fields of Ranbir Singhpura to the global frontiers of innovation — and why this is India’s moment to lead the world. Drawing lessons from history, technology, and nature, he explores how nations can build smart, secure, and open boundaries that protect without isolating. With India’s diversity, digital strength, diaspora, and ideas, he envisions a future where ancient wisdom meets modern innovation, turning the world’s oldest civilisation into the world’s newest opportunity. A Padma Shree Awardee, renowned academic and public intellectual, the youngest-ever Vice-Chancellor of the University of Jammu. He has held key positions at Oxford, Stanford and the University of Melbourne, where he founded the Australia India Institute. A trusted advisor to Prime Ministers on foreign policy and peace-building. This talk was given at a TEDx event using the TED conference format but independently organized by a local comm",
        "id": 4060732,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ktlvx_HeRfA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ktlvx_HeRfA/hqdefault.jpg",
        "title": "India’s Moment to Lead a Border-Smart World | Prof. Amitabh Mattoo | TEDxJKPS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:02.088672+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:30:23+00:00",
        "description": "Esta charla aborda los desafíos y responsabilidades que surgen en la era de la inteligencia artificial, explorando cómo su adopción puede transformar la sociedad, las relaciones humanas y las futuras generaciones. Con un enfoque en la ética y el impacto social, invita a reflexionar sobre cómo orientar esta poderosa tecnología de manera responsable, equilibrando innovación y humanidad. Una de las figuras más influyentes en el mundo digital y de negocios en América Latina, con más de 30 años de experiencia en la industria. Fue parte fundamental del lanzamiento y crecimiento de plataformas como TikTok for Business en México, y formó parte de los equipos fundadores de Twitter y Google en el país.\nActualmente es Director General de Negocios de Pinterest para América Latina de habla hispana. Licenciado en Comunicación por la Universidad Anáhuac, con estudios ejecutivos en Harvard Business School y Yale School of Management, certificado como coach en liderazgo y felicidad laboral. Profesor d",
        "id": 4060733,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2qbTmlaKaZ8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2qbTmlaKaZ8/hqdefault.jpg",
        "title": "Un uso ético y responsable de la Inteligencia Artificial. | Efraín Mendicuti | TEDxJardínZenea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-13T16:54:02.266235+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-13T16:29:43+00:00",
        "description": "En algún punto entre la enfermedad y la imaginación, él conoció a un dragón. No fue un sueño ni una metáfora: fue una prueba.\nEn esta charla-performance, el artista nos invita a recorrer el territorio donde el dolor se transforma en arte y la mente se convierte en escenario. A través de una experiencia sensorial y profundamente humana, comparte cómo enfrentó la depresión, la pérdida y el miedo, descubriendo que a veces los monstruos que nos persiguen son, en realidad, los guardianes de nuestra propia fuerza. Artista y creador multidisciplinario, encontró su voz no en el ruido del mundo, sino en la transformación interior. Tras enfrentar una crisis personal, la enfermedad de su padre y una meningitis que lo dejó sordo del oído izquierdo, descubrió en la pérdida un despertar espiritual. En 2017 dejó la vida corporativa y comenzó un viaje artístico que lo llevó a Londres, donde nació su personaje Mr. Old Street y expuso en la Bricklane Gallery. Su obra explora el arte, la mística y el su",
        "id": 4060734,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=e-F2M0yyoJc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/e-F2M0yyoJc/hqdefault.jpg",
        "title": "La prueba del dragón. | Luis Fernando Zánches | TEDxJardínZenea",
        "vote": 0
    }
]