[
    {
        "age": null,
        "album": "",
        "author": "Xbox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T21:29:29.019401+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T21:00:39+00:00",
        "description": "Looking for somewhere to meet up with your friends? You can’t beat hanging out at the Boostfield Mall! This new Arena will be open all-hours during Rocket League Season 20 launching September 17. \n\nThere’s something to suit all styles in Season 20’s Rocket Pass Premium, from the macabre Goth Trail to the comically cheery Yes! Goal Explosion. Automatically unlock the Pontiac Firebird Car Body when you purchase Season 20’s Rocket Pass Premium. Later in the Premium Tiers, unlock the Chevrolet Astro Car Body! Also, you’ll unlock the Mad Rad Wheels just for logging into Rocket League during Season 20. \n\nWe’re dialing down the disarray in 4v4 and turning up the strategy. This mode will feature two larger arenas that better accommodate eight players. The number of boost pads will increase and the layout of them will change to improve the flow of matches. This mode will have a Competitive version for the duration of Season 20, marking Rocket League’s first new Competitive Playlist in almost s",
        "id": 3567350,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=busJ-zvtbbg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 577,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjBp_7RuDBUYbd1LegWEJ8g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/busJ-zvtbbg/hqdefault.jpg",
        "title": "Head to the Boostfield Mall in Rocket League Season 20!",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Xbox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T02:09:14.470910+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T01:05:10+00:00",
        "description": "\"What you heard just now were the voices of the planet. Those born into this world. Who lived and who died. Who returned. They're howling in pain.\"\n\nFINAL FANTASY VII REMAKE INTERGRADE is coming to Xbox Series X|S and Xbox on PC as part of Xbox Play Anywhere. Pre-orders are now available. \n\nAbout the game: \n\nThe critically acclaimed FINAL FANTASY VII REMAKE INTERGRADE is the first game in the FINAL FANTASY VII remake trilogy.  It retells the original story up to the escape from Midgar, with breathtaking visuals, fast-paced gameplay, and additional story elements.\n\nThis RPG delivers unforgettable characters, a powerful narrative, and a hybrid battle system that blends real-time action with strategic, command-based combat. It also includes FF7R EPISODE INTERmission, a side story starring Yuffie Kisaragi that offers a fresh perspective running in parallel to Cloud’s journey.\n\nSUBSCRIBE TO XBOX: https://xbx.lv/2EEjmaR \n\nFOLLOW XBOX \nhttps://twitter.com/xbox \nhttps://www.facebook.com/xbox ",
        "id": 3562384,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=x6T8TOKJ8Kw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 577,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjBp_7RuDBUYbd1LegWEJ8g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x6T8TOKJ8Kw/hqdefault.jpg",
        "title": "FINAL FANTASY VII REMAKE INTERGRADE - Release Date Trailer",
        "vote": 0
    }
]