[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T23:28:11.460364+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T23:18:00+00:00",
        "description": "Paramount and Comcast's NBCUniversal are joining Microsoft in telling employees \"they could face consequences if they don't return to the office more frequently,\" reports the Washington Post:\n\nNBCUniversal sent a memo to its employees telling them to return to the office four days a week starting in January [with the option to work remotely on Fridays]. Last week, Paramount told employees to return five days a week, with the first group starting in January. Both Paramount and NBCUniversal said they would offer severance packages to eligible employees who are unwilling or unable to make the switch... Companies have been cracking down on flexible work for the past several years, with Goldman Sachs being one of the first to implement a five-day office policy. Since then, others have joined in including Amazon, AT&amp;T, JPMorgan Chase and the federal government... \n\nOverall, the number of people working full time in office hasn't changed much over the past couple of years. About 61.7 per",
        "id": 3567809,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/13/040256/more-return-to-office-crackdowns-with-617-of-employees-now-in-office-full-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Return-to-Office Crackdowns, with 61.7% of Employees Now in Office Full-Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T22:26:16.374632+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T22:18:00+00:00",
        "description": "Last week Steam and other major storefronts crashed, reports the Guardian, including Nintendo's eShop, PlayStation Store and Microsoft Store. They were all \"unable to cope with the demand for Hollow Knight: Silksong, the long-awaited sequel to the critically acclaimed 2017 indie hit Hollow Knight.\" (which had sold 15 million copies):\n\n SilkSong's release triggered widespread outages, with thousands of users reporting issues trying to buy the game in the first few hours of its release. Many were unable to complete purchases, with error messages persisting for almost three hours after the launch... Despite the technical hiccups, within 30 minutes of going live Steam reported more than 100,000 active players, suggesting many had managed to secure their copies.\n \nAftermath says the \"bug-tastic\" phenomenon displaced everything except Counter-Strike 2 and Dota 2 on Steam's list of most-played games. The Guardian notes that \"At least seven other new games have delayed their launch in the pas",
        "id": 3567617,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/13/2212239/hollow-knight-sequel-silksong-crashed-game-stores-as-20-price-irks-competitors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hollow Knight Sequel 'Silksong' Crashed Game Stores, as $20 Price Irks Competitors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T21:25:01.353457+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T20:34:00+00:00",
        "description": "Finland's second-largest university has announced new research suggesting that heart attacks could be an infectious disease. \n\n\n\n[T]he research found that, in coronary artery disease, atherosclerotic plaques containing cholesterol may harbor a gelatinous, asymptomatic biofilm formed by bacteria over years or even decades. Dormant bacteria within the biofilm remain shielded from both the patient's immune system and antibiotics because they cannot penetrate the biofilm matrix. \n\nA viral infection or another external trigger may activate the biofilm, leading to the proliferation of bacteria and an inflammatory response. The inflammation can cause a rupture in the fibrous cap of the plaque, resulting in thrombus [blood clot] formation and ultimately myocardial infarction... \"Bacterial involvement in coronary artery disease has long been suspected, but direct and convincing evidence has been lacking,\" explains professor Pekka Karhunen [who led the study with researchers from the UK and Fin",
        "id": 3567327,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/13/1457208/could-heart-attacks-be-triggered-by-infections?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could Heart Attacks Be Triggered By Infections?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T20:18:55.350942+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T19:34:00+00:00",
        "description": "It was \"little more than empty fields\" five years ago &mdash; but it's now \"a vast, heavily guarded complex stretching for 210 hectares (520 acres),\" reports the Guardian, \"the frontline of a multibillion-dollar criminal fraud industry fuelled by human trafficking and brutal violence.\"\n\nMyanmar, Cambodia and Laos have in recent years become havens for transnational crime syndicates running scam centres such as KK Park, which use enslaved workers to run complex online fraud and scamming schemes that generate huge profits. There have been some attempts to crack down on the centres and rescue the workers, who can be subjected to torture and trapped inside. But drone images and new research shared exclusively with the Guardian reveal that the number of such centres operating along the Thai-Myanmar border has more than doubled since Myanmar's military seized power in 2021, with construction continuing to this day. \nData from the Australian Strategic Policy Institute (Aspi), a defence think",
        "id": 3566909,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/13/195226/myanmars-cyber-slavery-compounds-may-hold-100000-trafficked-people?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Myanmar's 'Cyber-Slavery Compounds' May Hold 100,000 Trafficked People",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T20:18:55.567385+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T18:34:00+00:00",
        "description": "\"The United Arab Emirates wants to compete with the U.S. and China in AI,\" writes Gizmodo, \"and a new open source model may be its strongest contender yet. \n\"An Emirati AI lab called the Institute of Foundation Models (IFM) released K2 Think on Tuesday, a model that researchers say rivals OpenAI's ChatGPT and China's DeepSeek in standard benchmark tests.\"\n\n\"With just 32 billion parameters, it outperforms flagship reasoning models that are 20x larger,\" the lab wrote in a press release on Tuesday. DeepSeek's R1 has 671 billion parameters, though only 37 billion are active. Meta's latest Llama 4 models range from 17 billion to 288 billion active parameters. OpenAI doesn't share parameter information. OpenAI doesn't share parameter information. \n\nResearchers also claim that K2 Think leads \"all open-source models in math performance\" across several benchmarks. The model is intended to be more focused on math, coding, and scientific research than most other AI chatbots. The Emirati lab's se",
        "id": 3566910,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/13/1734225/uae-lab-releases-open-source-model-to-rival-chinas-deepseek?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UAE Lab Releases Open-Source Model to Rival China's DeepSeek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T18:35:37.543979+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T17:34:00+00:00",
        "description": "The Washington Post notes that past research \"indicates that exercise helps some cancer survivors avoid recurrence of their disease.\" \n\nBut a new study \"offers an explanation of how, showing that exercise changes the inner workings of our muscles and cells, although more study is still needed...\"\n\nThe study, published last month, involved 32 women who'd survived breast cancer. After a single session of interval training or weightlifting, their blood contained higher levels of certain molecules, and those factors helped put the brakes on laboratory-grown breast cancer cells. \"Our work shows that exercise can directly influence cancer biology, suppressing tumor growth through powerful molecular signals,\" said Robert Newton, the deputy director of the Exercise Medicine Research Institute at Edith Cowan University in Perth, Australia, and senior author of the new study. His group's experiment adds to mounting evidence that exercise upends the risks of not only developing but also survivin",
        "id": 3566611,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/13/0251201/a-single-exercise-session-may-slow-cancer-cell-growth-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Single Exercise Session May Slow Cancer Cell Growth, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T17:31:51.245269+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T16:34:00+00:00",
        "description": "\"Freelance developers and entire companies are making a business out of fixing shoddy vibe coded software,\" writes 404 Media, interviewing one of the \"dozens of people on Fiverr... now offering services specifically catering to people with shoddy vibe coded projects.\" \n\nHamid Siddiqi, who offers to \"review, fix your vibe code\" on Fiverr, told the 404 Media that \"Currently, I work with around 15-20 clients regularly, with additional one-off projects throughout the year. (\"Siddiqi said common issues he fixes in vibe coded projects include inconsistent UI/UX design in AI-generated frontends, poorly optimized code that impacts performance, misaligned branding elements, and features that function but feel clunky or unintuitive,\" as well as work o color schemes, animations, and layouts.) \n\nAnd others coders are also pursuing the \"vibe coded mess\" market:\nSwatantra Sohni, who started VibeCodeFixers.com, a site for people with vibe coded projects who need help from experienced developers to f",
        "id": 3566255,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/13/054206/the-software-engineers-paid-to-fix-vibe-coded-messes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Software Engineers Paid To Fix Vibe Coded Messes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T16:23:02.187797+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T15:34:00+00:00",
        "description": "In 2015 Kim Dotcom answered questions from Slashdot's readers. \n\nNow CBS News reports on \"the latest chapter in a protracted 13-year battle by the U.S. government\" to extradite Finnish-German millionaire Kim Dotcom from New Zealand:\n\nA New Zealand court has rejected the latest bid by internet entrepreneur Kim Dotcom to halt his deportation to the U.S. on charges related to his file-sharing website Megaupload. Dotcom had asked the High Court to review the legality of an official's August 2024 decision that he should be surrendered to the U.S. to face trial on charges of copyright infringement, money laundering and racketeering... The Megaupload founder had applied for what in New Zealand is called a judicial review, in which a judge is asked to evaluate whether an official's decision was lawful. A judge on Wednesday dismissed Dotcom's arguments that the decision to deport him was politically motivated and that he would face grossly disproportionate treatment in the U.S... \n\nNew Zealand",
        "id": 3565832,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/13/0155250/megaupload-founder-kim-dotcom-loses-latest-bid-to-avoid-us-extradition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Megaupload Founder Kim Dotcom Loses Latest Bid to Avoid US Extradition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T15:03:36.134080+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T14:34:00+00:00",
        "description": "ScienceDaily reports:\nForever chemicals known as PFAS have turned up in an unexpected place: beer. Researchers tested 23 different beers from across the U.S. and found that 95% contained PFAS, with the highest concentrations showing up in regions with known water contamination. The findings reveal how pollution in municipal water supplies can infiltrate popular products, raising concerns for both consumers and brewers... \n\n[PFAS] have been found in surface water, groundwater and municipal water supplies across the U.S. and the world. Although breweries typically have water filtration and treatment systems, they are not designed to remove PFAS... [T]he researchers call for greater awareness among brewers, consumers and regulators to limit overall PFAS exposure. These results also highlight the possible need for water treatment upgrades at brewing facilities as PFAS regulations in drinking water change or updates to municipal water system treatment are implemented. \n\"I hope these findin",
        "id": 3565444,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/13/014244/forever-chemicals-found-in-95-of-beers-tested-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Forever Chemicals' Found In 95% of Beers Tested In the U.S.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T13:51:03.637050+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Rainmaker Technology's bid to deploy cloud-seeding flares on small drones is being met by resistance from the airline pilots union, which has urged the Federal Aviation Administration to consider denying the startup's request unless it meets stricter safety guidelines. The FAA's decision will signal how the regulator views weather modification by unmanned aerial systems going forward. Rainmaker's bet on small drones hangs in the balance.\n \nThe Air Line Pilots Association (ALPA) told the FAA that Rainmaker's petition \"fails to demonstrate an equivalent level of safety\" and poses \"an extreme safety risk.\" Rainmaker is seeking an exemption from rules that bar small drones from carrying hazardous materials. The startup filed in July, and the FAA has yet to rule. Instead, it issued a follow-up request for information, pressing for specifics on operations and safety. In its filing, Rainmaker proposed using two flare types, one \"burn-in-pl",
        "id": 3565086,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/13/0012220/pilot-union-urges-faa-to-reject-rainmakers-drone-cloud-seeding-plan?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pilot Union Urges FAA To Reject Rainmaker's Drone Cloud-Seeding Plan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T10:20:44.930138+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T10:00:00+00:00",
        "description": "Surgeons in London report a surge in severe e-bike-related injuries, putting major strain on NHS trauma units. The BBC mentions a couple e-bike accidents overheard at the Royal London Hospital in Whitechapel. \"A 32-year-old, fit and well student... a couple of days ago he fell off an e-bike sustaining a closed left tibial plateau fracture.\" Another case involved a little girl named Frida: \"Six-year-old girl, she was hit by an electric bike, she has a closed tib/fib fracture.\" From the report: Surgeon Jaison Patel is seeing more and more cases like this. \"It's a massive burden on our department and I'm sure it's the same across the whole of London,\" he tells us. \"If we can reduce the number of patients coming in with these sorts of injuries it would be great for the patients obviously, but also takes massive pressure off us in the NHS.\"\n \nJaison deals with lower limb injuries. Just along the corridor his colleague Nick Aresti does the upper limbs. Nick explains that he is a cyclist him",
        "id": 3564065,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/13/007205/e-bike-injuries-are-a-massive-burden-say-surgeons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "E-Bike Injuries Are a Massive Burden, Say Surgeons",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T08:00:39.653556+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T07:00:00+00:00",
        "description": "Researchers in China have created synthetic magnetic fields within silicon photonic crystals, allowing them to steer and control light on a chip with unprecedented precision. \"Beyond immediate applications, the work opens new avenues for studying quantum-inspired phenomena with light,\" reports Phys.org. \"The ability to impose artificial gauge fields in photonic systems could enable devices for optical computing, quantum information, and advanced communication technologies.\" Slashdot reader alternative_right shares an excerpt from the report: The team achieved this by systematically altering the symmetry of tiny repeating units in silicon photonic crystals. Adjusting the degree of local asymmetry at each point allowed them to 'design' pseudomagnetic fields with tailored spatial patterns, without breaking fundamental time-reversal symmetry. Both theoretical analysis and experiments confirmed that these engineered fields can guide and manipulate light in versatile ways. To demonstrate pr",
        "id": 3563512,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/12/2344232/synthetic-magnetic-fields-steer-light-on-a-chip-for-faster-communications?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Synthetic Magnetic Fields Steer Light On a Chip For Faster Communications",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T04:24:28.391708+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Intercept: The company behind the Proton Mail email service, Proton, describes itself as a \"neutral and safe haven for your personal data, committed to defending your freedom.\" But last month, Proton disabled email accounts belonging to journalists reporting on security breaches of various South Korean government computer systems following a complaint by an unspecified cybersecurity agency. After a public outcry, and multiple weeks, the journalists' accounts were eventually reinstated -- but the reporters and editors involved still want answers on how and why Proton decided to shut down the accounts in the first place.\n \nMartin Shelton, deputy director of digital security at the Freedom of the Press Foundation, highlighted that numerous newsrooms use Proton's services as alternatives to something like Gmail \"specifically to avoid situations like this,\" pointing out that \"While it's good to see that Proton is reconsidering account suspension",
        "id": 3562804,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/12/230259/proton-mail-suspended-journalist-accounts-at-request-of-cybersecurity-agency?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Proton Mail Suspended Journalist Accounts At Request of Cybersecurity Agency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T02:03:29.391064+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T01:50:00+00:00",
        "description": "US EV sales hit a record 146,332 in August, grabbing nearly 10% of all new car sales, according to Kelley Blue Book. That's the highest yet and up from 9.1% in July. Electrek reports: With the federal EV tax credit set to expire on September 30, analysts say Q3 2025 is shaping up to be the strongest quarter for EV sales in US history. The current record holder is Q4 2024, when 365,824 EVs were sold.\n \nPrices ticked higher, too. The average transaction price (ATP) for an EV in August was $57,245, 3.1% more than July's revised lower ATP of $55,562. Year-over-year, though, EV prices were basically flat, down just 0.1%. The wave of EV sales also helped push up the overall market's ATP.\n \nIncentives, while not as high as July's record, remained hefty. EV buyers received discounts averaging over $9,000 in August, equal to 16% of ATP. That's more than double the incentive rate in the overall auto market and up from 13.6% a year ago. A separate report from Rho Motion found that global EV sale",
        "id": 3562364,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/12/2318235/us-ev-sales-smash-records-in-august?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US EV Sales Smash Records In August",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T02:03:29.515673+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T01:10:00+00:00",
        "description": "Newfoundland and Labrador's 10-year Education Accord report (PDF) intended to guide school reform has been found to contain at least 15 fabricated citations, including references to non-existent films and journals. Academics suggest the fake sources may have been generated by AI. \"There are sources in this report that I cannot find in the MUN Library, in the other libraries I subscribe to, in Google searches. Whether that's AI, I don't know, but fabricating sources is a telltale sign of artificial intelligence,\" said Aaron Tucker, an assistant professor at Memorial whose current research focuses on the history of AI in Canada. \"The fabrication of sources at least begs the question: did this come from generative AI?\" CBC News reports: In one case, the report references a 2008 movie from the National Film Board called Schoolyard Games. The film doesn't exist, according to a spokesperson for the board. But the exact citation used in the report can be found in a University of Victoria sty",
        "id": 3562365,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/12/239214/newfoundlands-10-year-education-report-calling-for-ethical-ai-use-contains-over-15-fake-sources?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Newfoundland's 10-Year Education Report Calling For Ethical AI Use Contains Over 15 Fake Sources",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T00:57:19.975920+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T00:30:00+00:00",
        "description": "A former Memphis disc manufacturing employee has been sentenced to nearly five years in prison after stealing pre-release Blu-rays from his employer and leaking them online. While he received 21 months for copyright infringement, a concurrent firearm charge extended his total prison term to 57 months. TorrentFreak reports: In February, the U.S. Department of Justice indicted 37-year-old Steven Hale from Tennessee, a former employee of a disc manufacturing and distribution company in Memphis. While working at the unnamed company between 2021 and 2022, Hale allegedly stole numerous \"pre-release\" DVD and Blu-ray discs from his employer. These stolen discs contained many high-profile movie titles including \"Spider-Man: No Way Home.\" In addition to the copyright infringement charge, Hale was also indicted for a firearm offense. When raiding his premises, law enforcement found a gun in a car that was registered in his name, which, for a felon, is a separate criminal offense.\n \nHale was sent",
        "id": 3562117,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/09/12/2251230/employee-who-leaked-spider-man-blu-ray-sentenced-to-nearly-5-years-prison?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Employee Who Leaked 'Spider-Man' Blu-ray Sentenced to Nearly 5 Years Prison",
        "vote": 0
    }
]