[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T18:05:44.551384+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T18:00:59+00:00",
        "description": "Kingdom Come: Deliverance 2 is one of the most critically-acclaimed RPGs of the year, and with good reason. The title got popular in large part thanks to its simulationist approach to medieval European RPG gameplay, allowing players to feel intense levels of immersion in its depiction of Bohemia and Kuttenberg. \n\nThe newest DLC, Legacy of the Forge, brings with it an even greater reason to dive into the intense crafting systems offered by the game. The premise behind the DLC is quite simple; protagonist Henry wants to accomplish one of his late father’s dreams and repair the long-dormant astronomical clock at Kuttenberg. \n\nTo do this, he must join the blacksmith guild, take charge of a long-abandoned forge, bring it back to life, and team up with his father’s former collaborators. The DLC offers a great excuse to take a break from adventuring in the otherwise intense RPG, instead inviting players to slow down and smell the hot iron.",
        "id": 3566443,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=yfESF3TzkNo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yfESF3TzkNo/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2: Legacy of the Forge DLC Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T15:44:43.564257+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T15:30:36+00:00",
        "description": "For over two decades, Sony and Microsoft have been locked in a console war defined by exclusives, services, and ecosystem lock-ins. But with cross-play breaking barriers and Microsoft already pushing its first-party titles across platforms, the question arises - should Sony follow suit and bring its heavy-hitters like Uncharted or Horizon to Xbox? \n\nOf course, the answer to that question isn’t just a simple yes or no - but rather a long and arduous understanding of how the console business works and also why Sony might be compelled to make such a move. \n\nWith this video, we will be diving deep into these factors and try to discern somewhat of a definitive answer to this burning question that has started to seep in the hearts and minds of so many fans.",
        "id": 3565694,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=pMZxsiYEJQE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pMZxsiYEJQE/hqdefault.jpg",
        "title": "Is It Time For PlayStation To Bring Its AAA Games To Xbox?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-13T14:32:04.158855+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-13T13:30:03+00:00",
        "description": "EA Sports might not have been too happy with the lukewarm response to FC 25 last year. But the studio has taken things in stride, bringing a slew of changes to FC 26, many of which are direct responses to all of the feedback received from a global community of players who don't take too kindly to substandard features in their favorite simulator of the sport.\n\nWhile me might have to wait and see how things turn out this time around, and if these new changes are going to redeem the FC franchise in the eyes of its players, it's evident that EA Sports has given a solid effort to its mission to bring the franchise back into the good graces of its fans.",
        "id": 3565303,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=atrcACFgbY8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/atrcACFgbY8/hqdefault.jpg",
        "title": "EA Sports FC 26 vs. FC 25 - 15 BIGGEST CHANGES",
        "vote": 0
    }
]